MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/**
 *******************************************************************************
 * @file HC32F558.h
 * @brief Headerfile for HC32F558 series MCU
  @verbatim
   Change Logs:
   Date             Author          Notes
   2026-04-16       CDT             First version
  @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2026, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 **/

#ifndef __HC32F558_H__
#define __HC32F558_H__

#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Configuration of the Cortex-M4 Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT          1 /*!< HC32F558 provides MPU */
#define __VTOR_PRESENT         1 /*!< HC32F558 supported vector table registers */
#define __NVIC_PRIO_BITS       4 /*!< HC32F558 uses 4 Bits for the Priority Levels */
#define __Vendor_SysTickConfig 0 /*!< Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT          1 /*!< FPU present */

    /*******************************************************************************
     * Interrupt Number Definition
     ******************************************************************************/
    typedef enum
    {
        NMI_IRQn                = -14, /* 2 Non Maskable */
        HardFault_IRQn          = -13, /* 3 Hard Fault */
        MemManageFault_IRQn     = -12, /* 4 MemManage Fault */
        BusFault_IRQn           = -11, /* 5 Bus Fault */
        UsageFault_IRQn         = -10, /* 6 Usage Fault */
        SVC_IRQn                = -5,  /* 11 SVCall */
        DebugMonitor_IRQn       = -4,  /* 12 DebugMonitor */
        PendSV_IRQn             = -2,  /* 14 Pend SV */
        SysTick_IRQn            = -1,  /* 15 System Tick */
        INT000_IRQn             = 0,
        INT001_IRQn             = 1,
        INT002_IRQn             = 2,
        INT003_IRQn             = 3,
        INT004_IRQn             = 4,
        INT005_IRQn             = 5,
        INT006_IRQn             = 6,
        INT007_IRQn             = 7,
        INT008_IRQn             = 8,
        INT009_IRQn             = 9,
        INT010_IRQn             = 10,
        INT011_IRQn             = 11,
        INT012_IRQn             = 12,
        INT013_IRQn             = 13,
        INT014_IRQn             = 14,
        INT015_IRQn             = 15,
        EXTINT_PORT_EIRQ0_IRQn  = 16,
        EXTINT_PORT_EIRQ1_IRQn  = 17,
        EXTINT_PORT_EIRQ2_IRQn  = 18,
        EXTINT_PORT_EIRQ3_IRQn  = 19,
        EXTINT_PORT_EIRQ4_IRQn  = 20,
        EXTINT_PORT_EIRQ5_IRQn  = 21,
        EXTINT_PORT_EIRQ6_IRQn  = 22,
        EXTINT_PORT_EIRQ7_IRQn  = 23,
        EXTINT_PORT_EIRQ8_IRQn  = 24,
        EXTINT_PORT_EIRQ9_IRQn  = 25,
        EXTINT_PORT_EIRQ10_IRQn = 26,
        EXTINT_PORT_EIRQ11_IRQn = 27,
        EXTINT_PORT_EIRQ12_IRQn = 28,
        EXTINT_PORT_EIRQ13_IRQn = 29,
        EXTINT_PORT_EIRQ14_IRQn = 30,
        EXTINT_PORT_EIRQ15_IRQn = 31,
        SWINT0_IRQn             = 0,
        SWINT1_IRQn             = 1,
        SWINT2_IRQn             = 2,
        SWINT3_IRQn             = 3,
        SWINT4_IRQn             = 4,
        SWINT5_IRQn             = 5,
        SWINT6_IRQn             = 6,
        SWINT7_IRQn             = 7,
        SWINT8_IRQn             = 8,
        SWINT9_IRQn             = 9,
        SWINT10_IRQn            = 10,
        SWINT11_IRQn            = 11,
        SWINT12_IRQn            = 12,
        SWINT13_IRQn            = 13,
        SWINT14_IRQn            = 14,
        SWINT15_IRQn            = 15,
        SWINT16_IRQn            = 16,
        SWINT17_IRQn            = 17,
        SWINT18_IRQn            = 18,
        SWINT19_IRQn            = 19,
        SWINT20_IRQn            = 20,
        SWINT21_IRQn            = 21,
        SWINT22_IRQn            = 22,
        SWINT23_IRQn            = 23,
        SWINT24_IRQn            = 24,
        SWINT25_IRQn            = 25,
        SWINT26_IRQn            = 26,
        SWINT27_IRQn            = 27,
        SWINT28_IRQn            = 28,
        SWINT29_IRQn            = 29,
        SWINT30_IRQn            = 30,
        SWINT31_IRQn            = 31,
        DMA1_ERR_IRQn           = 32,
        DMA1_TC0_BTC0_IRQn      = 33,
        DMA1_TC1_BTC1_IRQn      = 34,
        DMA1_TC2_BTC2_IRQn      = 35,
        DMA1_TC3_BTC3_IRQn      = 36,
        DMA1_TC4_BTC4_IRQn      = 37,
        DMA1_TC5_BTC5_IRQn      = 38,
        DMA1_TC6_BTC6_IRQn      = 39,
        DMA1_TC7_BTC7_IRQn      = 40,
        EFM_PEERR_RDCOL_IRQn    = 41,
        EFM_OPTEND_IRQn         = 42,
        FPU_ERR_IRQn            = 43,
        DMA2_ERR_IRQn           = 44,
        DMA2_TC0_BTC0_IRQn      = 45,
        DMA2_TC1_BTC1_IRQn      = 46,
        DMA2_TC2_BTC2_IRQn      = 47,
        DMA2_TC3_BTC3_IRQn      = 48,
        DMA2_TC4_BTC4_IRQn      = 49,
        DMA2_TC5_BTC5_IRQn      = 50,
        DMA2_TC6_BTC6_IRQn      = 51,
        DMA2_TC7_BTC7_IRQn      = 52,
        PID_IRQn                = 53,
        PID_CMP_IRQn            = 54,
        FMAC_FIR_IRQn           = 55,
        FMAC_IIR_IRQn           = 56,
        FMAC_RAM_ECCER_IRQn     = 57,
        CORDIC_IRQn             = 58,
        TMR0_1_IRQn             = 59,
        TMR0_2_IRQn             = 60,
        XTAL_IRQn               = 61,
        SWDT_IRQn               = 62,
        TMR6_1_GCMP_IRQn        = 63,
        TMR6_1_OVF_UDF_IRQn     = 64,
        TMR6_1_DTE_IRQn         = 65,
        TMR6_1_SCMP_IRQn        = 66,
        TMR6_2_GCMP_IRQn        = 67,
        TMR6_2_OVF_UDF_IRQn     = 68,
        TMR6_2_DTE_IRQn         = 69,
        TMR6_2_SCMP_IRQn        = 70,
        TMR6_3_GCMP_IRQn        = 71,
        TMR6_3_OVF_UDF_IRQn     = 72,
        TMR6_3_DTE_IRQn         = 73,
        TMR6_3_SCMP_IRQn        = 74,
        TMR6_4_GCMP_IRQn        = 75,
        TMR6_4_OVF_UDF_IRQn     = 76,
        TMR6_4_DTE_IRQn         = 77,
        TMR6_4_SCMP_IRQn        = 78,
        TMR6_5_GCMP_IRQn        = 79,
        TMR6_5_OVF_UDF_IRQn     = 80,
        TMR6_5_DTE_IRQn         = 81,
        TMR6_5_SCMP_IRQn        = 82,
        TMR6_6_GCMP_IRQn        = 83,
        TMR6_6_OVF_UDF_IRQn     = 84,
        TMR6_6_DTE_IRQn         = 85,
        TMR6_6_SCMP_IRQn        = 86,
        TRLPWM_IRQn             = 87,
        EMB_GR0_IRQn            = 88,
        EMB_GR1_IRQn            = 89,
        EMB_GR2_IRQn            = 90,
        EMB_GR3_IRQn            = 91,
        EMB_GR4_IRQn            = 92,
        EMB_GR5_IRQn            = 93,
        HRPWM1_IRQn             = 94,
        HRPWM2_IRQn             = 95,
        HRPWM3_IRQn             = 96,
        HRPWM4_IRQn             = 97,
        HRPWM5_IRQn             = 98,
        HRPWM6_IRQn             = 99,
        HRPWM7_IRQn             = 100,
        HRPWM8_IRQn             = 101,
        HRPWM_EMB_IRQn          = 102,
        SDFM_FILTER0_IRQn       = 103,
        SDFM_FILTER1_IRQn       = 104,
        SDFM_FILTER2_IRQn       = 105,
        SDFM_FILTER3_IRQn       = 106,
        CMP1_IRQn               = 107,
        CMP2_IRQn               = 108,
        CMP3_IRQn               = 109,
        CMP4_IRQn               = 110,
        CMP5_IRQn               = 111,
        CMP6_IRQn               = 112,
        CMP7_IRQn               = 113,
        CMP8_IRQn               = 114,
        SPI1_IRQn               = 115,
        SPI2_IRQn               = 116,
        SPI3_IRQn               = 117,
        EVENT_PORT1_IRQn        = 118,
        EVENT_PORT2_IRQn        = 119,
        EVENT_PORT3_IRQn        = 120,
        EVENT_PORT4_IRQn        = 121,
        MCANRAM_ECCER_IRQn      = 122,
        MCAN1_INT0_IRQn         = 123,
        MCAN1_INT1_IRQn         = 124,
        MCAN2_INT0_IRQn         = 125,
        MCAN2_INT1_IRQn         = 126,
        MCAN3_INT0_IRQn         = 127,
        MCAN3_INT1_IRQn         = 128,
        USART1_IRQn             = 129,
        USART1_TCI_IRQn         = 130,
        USART2_IRQn             = 131,
        USART2_TCI_IRQn         = 132,
        USART3_IRQn             = 133,
        USART3_TCI_IRQn         = 134,
        USART4_IRQn             = 135,
        USART4_TCI_IRQn         = 136,
        HASH_IRQn               = 137,
        SKE_IRQn                = 138,
        SOGI_IRQn               = 139,
        I2C1_IRQn               = 140,
        I2C2_IRQn               = 141,
        I2C3_IRQn               = 142,
        SPI1_WUPI_IRQn          = 143,
        USART1_WUPI_IRQn        = 144,
        LVD1_IRQn               = 145,
        LVD2_IRQn               = 146,
        FCM_IRQn                = 147,
        WDT_IRQn                = 148,
        CTC_IRQn                = 149,
        ERMU_IRQn               = 150,
        ADC1_IRQn               = 151,
        ADC2_IRQn               = 152,
        ADC3_IRQn               = 153,
        ADC4_IRQn               = 154,
        TRNG_IRQn               = 155,
    } IRQn_Type;

#include <core_cm4.h>
#include <stdint.h>

