MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    /**
     *******************************************************************************
     ** \brief Event number enumeration
     ******************************************************************************/
    typedef enum
    {
        EVT_SRC_SWI_IRQ0  = 0U,
        EVT_SRC_SWI_IRQ1  = 1U,
        EVT_SRC_SWI_IRQ2  = 2U,
        EVT_SRC_SWI_IRQ3  = 3U,
        EVT_SRC_SWI_IRQ4  = 4U,
        EVT_SRC_SWI_IRQ5  = 5U,
        EVT_SRC_SWI_IRQ6  = 6U,
        EVT_SRC_SWI_IRQ7  = 7U,
        EVT_SRC_SWI_IRQ8  = 8U,
        EVT_SRC_SWI_IRQ9  = 9U,
        EVT_SRC_SWI_IRQ10 = 10U,
        EVT_SRC_SWI_IRQ11 = 11U,
        EVT_SRC_SWI_IRQ12 = 12U,
        EVT_SRC_SWI_IRQ13 = 13U,
        EVT_SRC_SWI_IRQ14 = 14U,
        EVT_SRC_SWI_IRQ15 = 15U,
        EVT_SRC_SWI_IRQ16 = 16U,
        EVT_SRC_SWI_IRQ17 = 17U,
        EVT_SRC_SWI_IRQ18 = 18U,
        EVT_SRC_SWI_IRQ19 = 19U,
        EVT_SRC_SWI_IRQ20 = 20U,
        EVT_SRC_SWI_IRQ21 = 21U,
        EVT_SRC_SWI_IRQ22 = 22U,
        EVT_SRC_SWI_IRQ23 = 23U,
        EVT_SRC_SWI_IRQ24 = 24U,
        EVT_SRC_SWI_IRQ25 = 25U,
        EVT_SRC_SWI_IRQ26 = 26U,
        EVT_SRC_SWI_IRQ27 = 27U,
        EVT_SRC_SWI_IRQ28 = 28U,
        EVT_SRC_SWI_IRQ29 = 29U,
        EVT_SRC_SWI_IRQ30 = 30U,
        EVT_SRC_SWI_IRQ31 = 31U,
        /* External Interrupt */
        EVT_SRC_PORT_EIRQ0  = 0U,  /* EIRQ0 */
        EVT_SRC_PORT_EIRQ1  = 1U,  /* EIRQ1 */
        EVT_SRC_PORT_EIRQ2  = 2U,  /* EIRQ2 */
        EVT_SRC_PORT_EIRQ3  = 3U,  /* EIRQ3 */
        EVT_SRC_PORT_EIRQ4  = 4U,  /* EIRQ4 */
        EVT_SRC_PORT_EIRQ5  = 5U,  /* EIRQ5 */
        EVT_SRC_PORT_EIRQ6  = 6U,  /* EIRQ6 */
        EVT_SRC_PORT_EIRQ7  = 7U,  /* EIRQ7 */
        EVT_SRC_PORT_EIRQ8  = 8U,  /* EIRQ8 */
        EVT_SRC_PORT_EIRQ9  = 9U,  /* EIRQ9 */
        EVT_SRC_PORT_EIRQ10 = 10U, /* EIRQ10 */
        EVT_SRC_PORT_EIRQ11 = 11U, /* EIRQ11 */
        EVT_SRC_PORT_EIRQ12 = 12U, /* EIRQ12 */
        EVT_SRC_PORT_EIRQ13 = 13U, /* EIRQ13 */
        EVT_SRC_PORT_EIRQ14 = 14U, /* EIRQ14 */
        EVT_SRC_PORT_EIRQ15 = 15U, /* EIRQ15 */
        /* DMA1 */
        EVT_SRC_DMA1_TC0  = 33U, /* DMA1_TC0 */
        EVT_SRC_DMA1_BTC0 = 34U, /* DMA1_BTC0 */
        EVT_SRC_DMA1_TC1  = 35U, /* DMA1_TC1 */
        EVT_SRC_DMA1_BTC1 = 36U, /* DMA1_BTC1 */
        EVT_SRC_DMA1_TC2  = 37U, /* DMA1_TC2 */
        EVT_SRC_DMA1_BTC2 = 38U, /* DMA1_BTC2 */
        EVT_SRC_DMA1_TC3  = 39U, /* DMA1_TC3 */
        EVT_SRC_DMA1_BTC3 = 40U, /* DMA1_BTC3 */
        EVT_SRC_DMA1_TC4  = 41U, /* DMA1_TC4 */
        EVT_SRC_DMA1_BTC4 = 42U, /* DMA1_BTC4 */
        EVT_SRC_DMA1_TC5  = 43U, /* DMA1_TC5 */
        EVT_SRC_DMA1_BTC5 = 44U, /* DMA1_BTC5 */
        EVT_SRC_DMA1_TC6  = 45U, /* DMA1_TC6 */
        EVT_SRC_DMA1_BTC6 = 46U, /* DMA1_BTC6 */
        EVT_SRC_DMA1_TC7  = 47U, /* DMA1_TC7 */
        EVT_SRC_DMA1_BTC7 = 48U, /* DMA1_BTC7 */
        /* EFM */
        EVT_SRC_EFM_OPTEND = 51U, /* EFM_OPTEND */
        /* DMA2 */
        EVT_SRC_DMA2_TC0  = 65U, /* DMA2_TC0 */
        EVT_SRC_DMA2_BTC0 = 66U, /* DMA2_BTC0 */
        EVT_SRC_DMA2_TC1  = 67U, /* DMA2_TC1 */
        EVT_SRC_DMA2_BTC1 = 68U, /* DMA2_BTC1 */
        EVT_SRC_DMA2_TC2  = 69U, /* DMA2_TC2 */
        EVT_SRC_DMA2_BTC2 = 70U, /* DMA2_BTC2 */
        EVT_SRC_DMA2_TC3  = 71U, /* DMA2_TC3 */
        EVT_SRC_DMA2_BTC3 = 72U, /* DMA2_BTC3 */
        EVT_SRC_DMA2_TC4  = 73U, /* DMA2_TC4 */
        EVT_SRC_DMA2_BTC4 = 74U, /* DMA2_BTC4 */
        EVT_SRC_DMA2_TC5  = 75U, /* DMA2_TC5 */
        EVT_SRC_DMA2_BTC5 = 76U, /* DMA2_BTC5 */
        EVT_SRC_DMA2_TC6  = 77U, /* DMA2_TC6 */
        EVT_SRC_DMA2_BTC6 = 78U, /* DMA2_BTC6 */
        EVT_SRC_DMA2_TC7  = 79U, /* DMA2_TC7 */
        EVT_SRC_DMA2_BTC7 = 80U, /* DMA2_BTC7 */
        /* PID */
        EVT_SRC_PID_1    = 81U, /* PID_1 */
        EVT_SRC_PID_2    = 82U, /* PID_2 */
        EVT_SRC_PID_CMP  = 83U, /* PID_CMP */
        EVT_SRC_PID_BUST = 84U, /* PID_BUST */
        /* FMAC */
        EVT_SRC_FMAC_FIR_DONE  = 85U, /* FMAC_FIR */
        EVT_SRC_FMAC_IIR1_DONE = 86U, /* FMAC_IIR1 */
        EVT_SRC_FMAC_IIR2_DONE = 87U, /* FMAC_IIR2 */
        EVT_SRC_FMAC_IIR3_DONE = 88U, /* FMAC_IIR3 */
        EVT_SRC_FMAC_IIR4_DONE = 89U, /* FMAC_IIR4 */
        EVT_SRC_FMAC_IIR5_DONE = 90U, /* FMAC_IIR5 */
        EVT_SRC_FMAC_IIR6_DONE = 91U, /* FMAC_IIR6 */
        EVT_SRC_FMAC_ECC_ERR   = 92U, /* FMAC_ECC */
        /* CORDIC */
        EVT_SRC_CORDIC_RDMA = 94U, /* CORDIC_RDMA */
        EVT_SRC_CORDIC_WDMA = 95U, /* CORDIC_WDMA */
        /* TIMER0 */
        EVT_SRC_TMR0_1_CMP_A = 96U,  /* TMR0_1_CMPA */
        EVT_SRC_TMR0_1_CMP_B = 97U,  /* TMR0_1_CMPB */
        EVT_SRC_TMR0_1_OVF_A = 98U,  /* TMR0_1_OVFA */
        EVT_SRC_TMR0_1_OVF_B = 99U,  /* TMR0_1_OVFB */
        EVT_SRC_TMR0_2_CMP_A = 100U, /* TMR0_2_CMPA */
        EVT_SRC_TMR0_2_CMP_B = 101U, /* TMR0_2_CMPB */
        EVT_SRC_TMR0_2_OVF_A = 102U, /* TMR0_2_OVFA */
        EVT_SRC_TMR0_2_OVF_B = 103U, /* TMR0_2_OVFB */
        /* TIMER6_1 */
        EVT_SRC_TMR6_1_GCMP_A = 128U, /* TMR6_1_GCMA */
        EVT_SRC_TMR6_1_GCMP_B = 129U, /* TMR6_1_GCMB */
        EVT_SRC_TMR6_1_GCMP_C = 130U, /* TMR6_1_GCMC */
        EVT_SRC_TMR6_1_GCMP_D = 131U, /* TMR6_1_GCMD */
        EVT_SRC_TMR6_1_GCMP_E = 132U, /* TMR6_1_GCME */
        EVT_SRC_TMR6_1_GCMP_F = 133U, /* TMR6_1_GCMF */
        EVT_SRC_TMR6_1_OVF    = 134U, /* TMR6_1_GOVF */
        EVT_SRC_TMR6_1_UDF    = 135U, /* TMR6_1_GUDF */
        EVT_SRC_TMR6_1_SCMP_A = 137U, /* TMR6_1_SCMA */
        EVT_SRC_TMR6_1_SCMP_B = 138U, /* TMR6_1_SCMB */
        /* TIMER6_2 */
        EVT_SRC_TMR6_2_GCMP_A = 139U, /* TMR6_2_GCMA */
        EVT_SRC_TMR6_2_GCMP_B = 140U, /* TMR6_2_GCMB */
        EVT_SRC_TMR6_2_GCMP_C = 141U, /* TMR6_2_GCMC */
        EVT_SRC_TMR6_2_GCMP_D = 142U, /* TMR6_2_GCMD */
        EVT_SRC_TMR6_2_GCMP_E = 143U, /* TMR6_2_GCME */
        EVT_SRC_TMR6_2_GCMP_F = 144U, /* TMR6_2_GCMF */
        EVT_SRC_TMR6_2_OVF    = 145U, /* TMR6_2_GOVF */
        EVT_SRC_TMR6_2_UDF    = 146U, /* TMR6_2_GUDF */
        EVT_SRC_TMR6_2_SCMP_A = 148U, /* TMR6_2_SCMA */
        EVT_SRC_TMR6_2_SCMP_B = 149U, /* TMR6_2_SCMB */
        /* TIMER6_3 */
        EVT_SRC_TMR6_3_GCMP_A = 150U, /* TMR6_3_GCMA */
        EVT_SRC_TMR6_3_GCMP_B = 151U, /* TMR6_3_GCMB */
        EVT_SRC_TMR6_3_GCMP_C = 152U, /* TMR6_3_GCMC */
        EVT_SRC_TMR6_3_GCMP_D = 153U, /* TMR6_3_GCMD */
        EVT_SRC_TMR6_3_GCMP_E = 154U, /* TMR6_3_GCME */
        EVT_SRC_TMR6_3_GCMP_F = 155U, /* TMR6_3_GCMF */
        EVT_SRC_TMR6_3_OVF    = 156U, /* TMR6_3_GOVF */
        EVT_SRC_TMR6_3_UDF    = 157U, /* TMR6_3_GUDF */
        EVT_SRC_TMR6_3_SCMP_A = 159U, /* TMR6_3_SCMA */
        EVT_SRC_TMR6_3_SCMP_B = 160U, /* TMR6_3_SCMB */
        /* TIMER6_4 */
        EVT_SRC_TMR6_4_GCMP_A = 161U, /* TMR6_4_GCMA */
        EVT_SRC_TMR6_4_GCMP_B = 162U, /* TMR6_4_GCMB */
        EVT_SRC_TMR6_4_GCMP_C = 163U, /* TMR6_4_GCMC */
        EVT_SRC_TMR6_4_GCMP_D = 164U, /* TMR6_4_GCMD */
        EVT_SRC_TMR6_4_GCMP_E = 165U, /* TMR6_4_GCME */
        EVT_SRC_TMR6_4_GCMP_F = 166U, /* TMR6_4_GCMF */
        EVT_SRC_TMR6_4_OVF    = 167U, /* TMR6_4_GOVF */
        EVT_SRC_TMR6_4_UDF    = 168U, /* TMR6_4_GUDF */
        EVT_SRC_TMR6_4_SCMP_A = 170U, /* TMR6_4_SCMA */
        EVT_SRC_TMR6_4_SCMP_B = 171U, /* TMR6_4_SCMB */
        /* TIMER6_5 */
        EVT_SRC_TMR6_5_GCMP_A = 172U, /* TMR6_5_GCMA */
        EVT_SRC_TMR6_5_GCMP_B = 173U, /* TMR6_5_GCMB */
        EVT_SRC_TMR6_5_GCMP_C = 174U, /* TMR6_5_GCMC */
        EVT_SRC_TMR6_5_GCMP_D = 175U, /* TMR6_5_GCMD */
        EVT_SRC_TMR6_5_GCMP_E = 176U, /* TMR6_5_GCME */
        EVT_SRC_TMR6_5_GCMP_F = 177U, /* TMR6_5_GCMF */
        EVT_SRC_TMR6_5_OVF    = 178U, /* TMR6_5_GOVF */
        EVT_SRC_TMR6_5_UDF    = 179U, /* TMR6_5_GUDF */
        EVT_SRC_TMR6_5_SCMP_A = 181U, /* TMR6_5_SCMA */
        EVT_SRC_TMR6_5_SCMP_B = 182U, /* TMR6_5_SCMB */
        /* TIMER6_6 */
        EVT_SRC_TMR6_6_GCMP_A = 183U, /* TMR6_6_GCMA */
        EVT_SRC_TMR6_6_GCMP_B = 184U, /* TMR6_6_GCMB */
        EVT_SRC_TMR6_6_GCMP_C = 185U, /* TMR6_6_GCMC */
        EVT_SRC_TMR6_6_GCMP_D = 186U, /* TMR6_6_GCMD */
        EVT_SRC_TMR6_6_GCMP_E = 187U, /* TMR6_6_GCME */
        EVT_SRC_TMR6_6_GCMP_F = 188U, /* TMR6_6_GCMF */
        EVT_SRC_TMR6_6_OVF    = 189U, /* TMR6_6_GOVF */
        EVT_SRC_TMR6_6_UDF    = 190U, /* TMR6_6_GUDF */
        EVT_SRC_TMR6_6_SCMP_A = 192U, /* TMR6_6_SCMA */
        EVT_SRC_TMR6_6_SCMP_B = 193U, /* TMR6_6_SCMB */
        /* TRLPWM */
        EVT_SRC_TRLPWM = 208U, /* TRLPWM */
        /* HRPWM */
        EVT_SRC_HRPWM_INT1 = 244U, /* HRPWM_INT1 */
        EVT_SRC_HRPWM_INT2 = 245U, /* HRPWM_INT2 */
        EVT_SRC_HRPWM_INT3 = 246U, /* HRPWM_INT3 */
        EVT_SRC_HRPWM_INT4 = 247U, /* HRPWM_INT4 */
        EVT_SRC_HRPWM_INT5 = 248U, /* HRPWM_INT5 */
        EVT_SRC_HRPWM_INT6 = 249U, /* HRPWM_INT6 */
        EVT_SRC_HRPWM_INT7 = 250U, /* HRPWM_INT7 */
        EVT_SRC_HRPWM_INT8 = 251U, /* HRPWM_INT8 */
        /* HRPWM_GLOB_AOS */
        EVT_SRC_HRPWM_GLOB_AOS1  = 252U, /* HRPWM_GLOB_AOS1 */
        EVT_SRC_HRPWM_GLOB_AOS2  = 253U, /* HRPWM_GLOB_AOS2 */
        EVT_SRC_HRPWM_GLOB_AOS3  = 254U, /* HRPWM_GLOB_AOS3 */
        EVT_SRC_HRPWM_GLOB_AOS4  = 255U, /* HRPWM_GLOB_AOS4 */
        EVT_SRC_HRPWM_GLOB_AOS5  = 256U, /* HRPWM_GLOB_AOS5 */
        EVT_SRC_HRPWM_GLOB_AOS6  = 257U, /* HRPWM_GLOB_AOS6 */
        EVT_SRC_HRPWM_GLOB_AOS7  = 258U, /* HRPWM_GLOB_AOS7 */
        EVT_SRC_HRPWM_GLOB_AOS8  = 259U, /* HRPWM_GLOB_AOS8 */
        EVT_SRC_HRPWM_GLOB_AOS9  = 260U, /* HRPWM_GLOB_AOS9 */
        EVT_SRC_HRPWM_GLOB_AOS10 = 261U, /* HRPWM_GLOB_AOS10 */
        /* SDFM */
        EVT_SRC_SDFM_FILTER0_RDMA = 292U, /* SDFM_FILTER0_RDMA */
        EVT_SRC_SDFM_FILTER1_RDMA = 293U, /* SDFM_FILTER1_RDMA */
        EVT_SRC_SDFM_FILTER2_RDMA = 294U, /* SDFM_FILTER2_RDMA */
        EVT_SRC_SDFM_FILTER3_RDMA = 295U, /* SDFM_FILTER3_RDMA */
        EVT_SRC_SDFM_FILTER0_JDMA = 296U, /* SDFM_FILTER0_JDMA */
        EVT_SRC_SDFM_FILTER1_JDMA = 297U, /* SDFM_FILTER1_JDMA */
        EVT_SRC_SDFM_FILTER2_JDMA = 298U, /* SDFM_FILTER2_JDMA */
        EVT_SRC_SDFM_FILTER3_JDMA = 299U, /* SDFM_FILTER3_JDMA */
        /* CMP */
        EVT_SRC_CMP1 = 320U, /* CMP_1_IRQ */
        EVT_SRC_CMP2 = 321U, /* CMP_2_IRQ */
        EVT_SRC_CMP3 = 322U, /* CMP_3_IRQ */
        EVT_SRC_CMP4 = 323U, /* CMP_4_IRQ */
        EVT_SRC_CMP5 = 324U, /* CMP_5_IRQ */
        EVT_SRC_CMP6 = 325U, /* CMP_6_IRQ */
        EVT_SRC_CMP7 = 326U, /* CMP_7_IRQ */
        EVT_SRC_CMP8 = 327U, /* CMP_8_IRQ */
        /* SPI1 */
        EVT_SRC_SPI1_SPRI   = 352U, /* SPI1_SPRI */
        EVT_SRC_SPI1_SPTI   = 353U, /* SPI1_SPTI */
        EVT_SRC_SPI1_SPII   = 354U, /* SPI1_SPII */
        EVT_SRC_SPI1_SPEI   = 355U, /* SPI1_SPEI */
        EVT_SRC_SPI1_SPTEND = 356U, /* SPI1_SPTEND */
        /* SPI2 */
        EVT_SRC_SPI2_SPRI   = 357U, /* SPI2_SPRI */
        EVT_SRC_SPI2_SPTI   = 358U, /* SPI2_SPTI */
        EVT_SRC_SPI2_SPII   = 359U, /* SPI2_SPII */
        EVT_SRC_SPI2_SPEI   = 360U, /* SPI2_SPEI */
        EVT_SRC_SPI2_SPTEND = 361U, /* SPI2_SPTEND */
        /* SPI3 */
        EVT_SRC_SPI3_SPRI   = 362U, /* SPI3_SPRI */
        EVT_SRC_SPI3_SPTI   = 363U, /* SPI3_SPTI */
        EVT_SRC_SPI3_SPII   = 364U, /* SPI3_SPII */
        EVT_SRC_SPI3_SPEI   = 365U, /* SPI3_SPEI */
        EVT_SRC_SPI3_SPTEND = 366U, /* SPI3_SPTEND */
        /* EVENT PORT */
        EVT_SRC_EVENT_PORT1 = 372U, /* EVENT_PORT1 */
        EVT_SRC_EVENT_PORT2 = 373U, /* EVENT_PORT2 */
        EVT_SRC_EVENT_PORT3 = 374U, /* EVENT_PORT3 */
        EVT_SRC_EVENT_PORT4 = 375U, /* EVENT_PORT4 */
        /* USART1 */
        EVT_SRC_USART1_BRKWKPI = 384U, /* USART_1_BRKWKPI */
        EVT_SRC_USART1_EI      = 385U, /* USART_1_EI */
        EVT_SRC_USART1_RI      = 386U, /* USART_1_RI */
        EVT_SRC_USART1_TI      = 387U, /* USART_1_TI */
        EVT_SRC_USART1_RTO     = 388U, /* USART_1_RTO */
        EVT_SRC_USART1_TENDI   = 389U, /* USART_1_TENDI */
        EVT_SRC_USART1_TCI     = 390U, /* USART_1_TCI */
        /* USART2 */
        EVT_SRC_USART2_BRKWKPI = 391U, /* USART_2_BRKWKPI */
        EVT_SRC_USART2_EI      = 392U, /* USART_2_EI */
        EVT_SRC_USART2_RI      = 393U, /* USART_2_RI */
        EVT_SRC_USART2_TI      = 394U, /* USART_2_TI */
        EVT_SRC_USART2_RTO     = 395U, /* USART_2_RTO */
        EVT_SRC_USART2_TENDI   = 396U, /* USART_2_TENDI */
        EVT_SRC_USART2_TCI     = 397U, /* USART_2_TCI */
        /* USART3 */
        EVT_SRC_USART3_BRKWKPI = 398U, /* USART_3_BRKWKPI */
        EVT_SRC_USART3_EI      = 399U, /* USART_3_EI */
        EVT_SRC_USART3_RI      = 400U, /* USART_3_RI */
        EVT_SRC_USART3_TI      = 401U, /* USART_3_TI */
        EVT_SRC_USART3_RTO     = 402U, /* USART_3_RTO */
        EVT_SRC_USART3_TENDI   = 403U, /* USART_3_TENDI */
        EVT_SRC_USART3_TCI     = 404U, /* USART_3_TCI */
        /* USART4 */
        EVT_SRC_USART4_BRKWKPI = 405U, /* USART_4_BRKWKPI */
        EVT_SRC_USART4_EI      = 406U, /* USART_4_EI */
        EVT_SRC_USART4_RI      = 407U, /* USART_4_RI */
        EVT_SRC_USART4_TI      = 408U, /* USART_4_TI */
        EVT_SRC_USART4_RTO     = 409U, /* USART_4_RTO */
        EVT_SRC_USART4_TENDI   = 410U, /* USART_4_TENDI */
        EVT_SRC_USART4_TCI     = 411U, /* USART_4_TCI */
        /* HASH */
        EVT_SRC_HASH = 413U, /* HASH_INT */
        /* AOS_STRG */
        EVT_SRC_AOS_STRG = 415U, /* AOS_STRG */
        /* SKE */
        EVT_SRC_SKE = 416U, /* SKE */
        /* I2C1 */
        EVT_SRC_I2C1_RXI = 432U, /* I2C_1_RXI */
        EVT_SRC_I2C1_TXI = 433U, /* I2C_1_TXI */
        EVT_SRC_I2C1_TEI = 434U, /* I2C_1_TEI */
        EVT_SRC_I2C1_EEI = 435U, /* I2C_1_EEI */
        EVT_SRC_I2C1_TCI = 436U, /* I2C_1_TCI */
        /* I2C2 */
        EVT_SRC_I2C2_RXI = 437U, /* I2C_2_RXI */
        EVT_SRC_I2C2_TXI = 438U, /* I2C_2_TXI */
        EVT_SRC_I2C2_TEI = 439U, /* I2C_2_TEI */
        EVT_SRC_I2C2_EEI = 440U, /* I2C_2_EEI */
        EVT_SRC_I2C2_TCI = 441U, /* I2C_2_TCI */
        /* I2C3 */
        EVT_SRC_I2C3_RXI = 442U, /* I2C_3_RXI */
        EVT_SRC_I2C3_TXI = 443U, /* I2C_3_TXI */
        EVT_SRC_I2C3_TEI = 444U, /* I2C_3_TEI */
        EVT_SRC_I2C3_EEI = 445U, /* I2C_3_EEI */
        EVT_SRC_I2C3_TCI = 446U, /* I2C_3_TCI */
        /* LVD */
        EVT_SRC_LVD1 = 465U, /* LVD1 */
        EVT_SRC_LVD2 = 466U, /* LVD2 */
        /* WDT */
        EVT_SRC_WDT_REFUDF = 471U, /* WDT_REFUDF */
        /* ADC1 */
        EVT_SRC_ADC1_EOCA = 480U, /* ADC_1_EOCA */
        EVT_SRC_ADC1_EOCB = 481U, /* ADC_1_EOCB */
        EVT_SRC_ADC1_EOCC = 482U, /* ADC_1_EOCC */
        EVT_SRC_ADC1_CMP0 = 483U, /* ADC_1_CMP0 */
        EVT_SRC_ADC1_CMP1 = 484U, /* ADC_1_CMP1 */
        /* ADC2 */
        EVT_SRC_ADC2_EOCA = 485U, /* ADC_2_EOCA */
        EVT_SRC_ADC2_EOCB = 486U, /* ADC_2_EOCB */
        EVT_SRC_ADC2_EOCC = 487U, /* ADC_2_EOCC */
        EVT_SRC_ADC2_CMP0 = 488U, /* ADC_2_CMP0 */
        EVT_SRC_ADC2_CMP1 = 489U, /* ADC_2_CMP1 */
        /* ADC3 */
        EVT_SRC_ADC3_EOCA = 490U, /* ADC_3_EOCA */
        EVT_SRC_ADC3_EOCB = 491U, /* ADC_3_EOCB */
        EVT_SRC_ADC3_EOCC = 492U, /* ADC_3_EOCC */
        EVT_SRC_ADC3_CMP0 = 493U, /* ADC_3_CMP0 */
        EVT_SRC_ADC3_CMP1 = 494U, /* ADC_3_CMP1 */
        /* ADC4 */
        EVT_SRC_ADC4_EOCA = 495U, /* ADC_4_EOCA */
        EVT_SRC_ADC4_EOCB = 496U, /* ADC_4_EOCB */
        EVT_SRC_ADC4_EOCC = 497U, /* ADC_4_EOCC */
        EVT_SRC_ADC4_CMP0 = 498U, /* ADC_4_CMP0 */
        EVT_SRC_ADC4_CMP1 = 499U, /* ADC_4_CMP1 */
        /* TRNG */
        EVT_SRC_TRNG_END = 500U, /* TRNG_END */
        EVT_SRC_MAX      = 511U,
    } en_event_src_t;

