MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    /**
     *******************************************************************************
     ** \brief Interrupt number enumeration
     ******************************************************************************/
    typedef enum
    {
        INT_SRC_SWI_IRQ0  = 0U,
        INT_SRC_SWI_IRQ1  = 1U,
        INT_SRC_SWI_IRQ2  = 2U,
        INT_SRC_SWI_IRQ3  = 3U,
        INT_SRC_SWI_IRQ4  = 4U,
        INT_SRC_SWI_IRQ5  = 5U,
        INT_SRC_SWI_IRQ6  = 6U,
        INT_SRC_SWI_IRQ7  = 7U,
        INT_SRC_SWI_IRQ8  = 8U,
        INT_SRC_SWI_IRQ9  = 9U,
        INT_SRC_SWI_IRQ10 = 10U,
        INT_SRC_SWI_IRQ11 = 11U,
        INT_SRC_SWI_IRQ12 = 12U,
        INT_SRC_SWI_IRQ13 = 13U,
        INT_SRC_SWI_IRQ14 = 14U,
        INT_SRC_SWI_IRQ15 = 15U,
        INT_SRC_SWI_IRQ16 = 16U,
        INT_SRC_SWI_IRQ17 = 17U,
        INT_SRC_SWI_IRQ18 = 18U,
        INT_SRC_SWI_IRQ19 = 19U,
        INT_SRC_SWI_IRQ20 = 20U,
        INT_SRC_SWI_IRQ21 = 21U,
        INT_SRC_SWI_IRQ22 = 22U,
        INT_SRC_SWI_IRQ23 = 23U,
        INT_SRC_SWI_IRQ24 = 24U,
        INT_SRC_SWI_IRQ25 = 25U,
        INT_SRC_SWI_IRQ26 = 26U,
        INT_SRC_SWI_IRQ27 = 27U,
        INT_SRC_SWI_IRQ28 = 28U,
        INT_SRC_SWI_IRQ29 = 29U,
        INT_SRC_SWI_IRQ30 = 30U,
        INT_SRC_SWI_IRQ31 = 31U,
        /* External Interrupt */
        INT_SRC_PORT_EIRQ0  = 0U,  /* EIRQ0 */
        INT_SRC_PORT_EIRQ1  = 1U,  /* EIRQ1 */
        INT_SRC_PORT_EIRQ2  = 2U,  /* EIRQ2 */
        INT_SRC_PORT_EIRQ3  = 3U,  /* EIRQ3 */
        INT_SRC_PORT_EIRQ4  = 4U,  /* EIRQ4 */
        INT_SRC_PORT_EIRQ5  = 5U,  /* EIRQ5 */
        INT_SRC_PORT_EIRQ6  = 6U,  /* EIRQ6 */
        INT_SRC_PORT_EIRQ7  = 7U,  /* EIRQ7 */
        INT_SRC_PORT_EIRQ8  = 8U,  /* EIRQ8 */
        INT_SRC_PORT_EIRQ9  = 9U,  /* EIRQ9 */
        INT_SRC_PORT_EIRQ10 = 10U, /* EIRQ10 */
        INT_SRC_PORT_EIRQ11 = 11U, /* EIRQ11 */
        INT_SRC_PORT_EIRQ12 = 12U, /* EIRQ12 */
        INT_SRC_PORT_EIRQ13 = 13U, /* EIRQ13 */
        INT_SRC_PORT_EIRQ14 = 14U, /* EIRQ14 */
        INT_SRC_PORT_EIRQ15 = 15U, /* EIRQ15 */
        /* DMA1 */
        INT_SRC_DMA1_ERR  = 32U, /* DMA1_ERR */
        INT_SRC_DMA1_TC0  = 33U, /* DMA1_TC0 */
        INT_SRC_DMA1_BTC0 = 34U, /* DMA1_BTC0 */
        INT_SRC_DMA1_TC1  = 35U, /* DMA1_TC1 */
        INT_SRC_DMA1_BTC1 = 36U, /* DMA1_BTC1 */
        INT_SRC_DMA1_TC2  = 37U, /* DMA1_TC2 */
        INT_SRC_DMA1_BTC2 = 38U, /* DMA1_BTC2 */
        INT_SRC_DMA1_TC3  = 39U, /* DMA1_TC3 */
        INT_SRC_DMA1_BTC3 = 40U, /* DMA1_BTC3 */
        INT_SRC_DMA1_TC4  = 41U, /* DMA1_TC4 */
        INT_SRC_DMA1_BTC4 = 42U, /* DMA1_BTC4 */
        INT_SRC_DMA1_TC5  = 43U, /* DMA1_TC5 */
        INT_SRC_DMA1_BTC5 = 44U, /* DMA1_BTC5 */
        INT_SRC_DMA1_TC6  = 45U, /* DMA1_TC6 */
        INT_SRC_DMA1_BTC6 = 46U, /* DMA1_BTC6 */
        INT_SRC_DMA1_TC7  = 47U, /* DMA1_TC7 */
        INT_SRC_DMA1_BTC7 = 48U, /* DMA1_BTC7 */
        /* EFM */
        INT_SRC_EFM_PEERR  = 49U, /* EFM_PEERR */
        INT_SRC_EFM_RDCOL  = 50U, /* EFM_RDCOL */
        INT_SRC_EFM_OPTEND = 51U, /* EFM_OPTEND */
        /* FPU */
        INT_SRC_FPU_ERR = 63U, /* FPU_ERR */
        /* DMA2 */
        INT_SRC_DMA2_ERR  = 64U, /* DMA2_ERR */
        INT_SRC_DMA2_TC0  = 65U, /* DMA2_TC0 */
        INT_SRC_DMA2_BTC0 = 66U, /* DMA2_BTC0 */
        INT_SRC_DMA2_TC1  = 67U, /* DMA2_TC1 */
        INT_SRC_DMA2_BTC1 = 68U, /* DMA2_BTC1 */
        INT_SRC_DMA2_TC2  = 69U, /* DMA2_TC2 */
        INT_SRC_DMA2_BTC2 = 70U, /* DMA2_BTC2 */
        INT_SRC_DMA2_TC3  = 71U, /* DMA2_TC3 */
        INT_SRC_DMA2_BTC3 = 72U, /* DMA2_BTC3 */
        INT_SRC_DMA2_TC4  = 73U, /* DMA2_TC4 */
        INT_SRC_DMA2_BTC4 = 74U, /* DMA2_BTC4 */
        INT_SRC_DMA2_TC5  = 75U, /* DMA2_TC5 */
        INT_SRC_DMA2_BTC5 = 76U, /* DMA2_BTC5 */
        INT_SRC_DMA2_TC6  = 77U, /* DMA2_TC6 */
        INT_SRC_DMA2_BTC6 = 78U, /* DMA2_BTC6 */
        INT_SRC_DMA2_TC7  = 79U, /* DMA2_TC7 */
        INT_SRC_DMA2_BTC7 = 80U, /* DMA2_BTC7 */
        /* PID */
        INT_SRC_PID_1    = 81U, /* PID_1 */
        INT_SRC_PID_2    = 82U, /* PID_2 */
        INT_SRC_PID_CMP  = 83U, /* PID_CMP */
        INT_SRC_PID_BUST = 84U, /* PID_BUST */
        /* FMAC */
        INT_SRC_FMAC_FIR     = 85U, /* FMAC_FIR _DONE */
        INT_SRC_FMAC_IIR1    = 86U, /* FMAC_IIR1_DONE */
        INT_SRC_FMAC_IIR2    = 87U, /* FMAC_IIR2_DONE */
        INT_SRC_FMAC_IIR3    = 88U, /* FMAC_IIR3_DONE */
        INT_SRC_FMAC_IIR4    = 89U, /* FMAC_IIR4_DONE */
        INT_SRC_FMAC_IIR5    = 90U, /* FMAC_IIR5_DONE */
        INT_SRC_FMAC_IIR6    = 91U, /* FMAC_IIR6_DONE */
        INT_SRC_FMAC_ECC_ERR = 92U, /* FMAC_ECCER */
        /* CORDIC */
        INT_SRC_CORDIC = 93U, /* CORDIC_IRQ */
        /* TIMER0 */
        INT_SRC_TMR0_1_CMP_A = 96U,  /* TMR0_1_CMPA */
        INT_SRC_TMR0_1_CMP_B = 97U,  /* TMR0_1_CMPB */
        INT_SRC_TMR0_1_OVF_A = 98U,  /* TMR0_1_OVFA */
        INT_SRC_TMR0_1_OVF_B = 99U,  /* TMR0_1_OVFB */
        INT_SRC_TMR0_2_CMP_A = 100U, /* TMR0_2_CMPA */
        INT_SRC_TMR0_2_CMP_B = 101U, /* TMR0_2_CMPB */
        INT_SRC_TMR0_2_OVF_A = 102U, /* TMR0_2_OVFA */
        INT_SRC_TMR0_2_OVF_B = 103U, /* TMR0_2_OVFB */
        /* XTAL */
        INT_SRC_XTAL_STOP = 125U, /* XTAL_STOP */
        /* SWDT */
        INT_SRC_SWDT_REFUDF = 127U, /* SWDT_REFUDF */
        /* TIMER6_1 */
        INT_SRC_TMR6_1_GCMP_A = 128U, /* TMR6_1_GCMA */
        INT_SRC_TMR6_1_GCMP_B = 129U, /* TMR6_1_GCMB */
        INT_SRC_TMR6_1_GCMP_C = 130U, /* TMR6_1_GCMC */
        INT_SRC_TMR6_1_GCMP_D = 131U, /* TMR6_1_GCMD */
        INT_SRC_TMR6_1_GCMP_E = 132U, /* TMR6_1_GCME */
        INT_SRC_TMR6_1_GCMP_F = 133U, /* TMR6_1_GCMF */
        INT_SRC_TMR6_1_OVF    = 134U, /* TMR6_1_GOVF */
        INT_SRC_TMR6_1_UDF    = 135U, /* TMR6_1_GUDF */
        INT_SRC_TMR6_1_DTE    = 136U, /* TMR6_1_GDTE */
        INT_SRC_TMR6_1_SCMP_A = 137U, /* TMR6_1_SCMA */
        INT_SRC_TMR6_1_SCMP_B = 138U, /* TMR6_1_SCMB */
        /* TIMER6_2 */
        INT_SRC_TMR6_2_GCMP_A = 139U, /* TMR6_2_GCMA */
        INT_SRC_TMR6_2_GCMP_B = 140U, /* TMR6_2_GCMB */
        INT_SRC_TMR6_2_GCMP_C = 141U, /* TMR6_2_GCMC */
        INT_SRC_TMR6_2_GCMP_D = 142U, /* TMR6_2_GCMD */
        INT_SRC_TMR6_2_GCMP_E = 143U, /* TMR6_2_GCME */
        INT_SRC_TMR6_2_GCMP_F = 144U, /* TMR6_2_GCMF */
        INT_SRC_TMR6_2_OVF    = 145U, /* TMR6_2_GOVF */
        INT_SRC_TMR6_2_UDF    = 146U, /* TMR6_2_GUDF */
        INT_SRC_TMR6_2_DTE    = 147U, /* TMR6_2_GDTE */
        INT_SRC_TMR6_2_SCMP_A = 148U, /* TMR6_2_SCMA */
        INT_SRC_TMR6_2_SCMP_B = 149U, /* TMR6_2_SCMB */
        /* TIMER6_3 */
        INT_SRC_TMR6_3_GCMP_A = 150U, /* TMR6_3_GCMA */
        INT_SRC_TMR6_3_GCMP_B = 151U, /* TMR6_3_GCMB */
        INT_SRC_TMR6_3_GCMP_C = 152U, /* TMR6_3_GCMC */
        INT_SRC_TMR6_3_GCMP_D = 153U, /* TMR6_3_GCMD */
        INT_SRC_TMR6_3_GCMP_E = 154U, /* TMR6_3_GCME */
        INT_SRC_TMR6_3_GCMP_F = 155U, /* TMR6_3_GCMF */
        INT_SRC_TMR6_3_OVF    = 156U, /* TMR6_3_GOVF */
        INT_SRC_TMR6_3_UDF    = 157U, /* TMR6_3_GUDF */
        INT_SRC_TMR6_3_DTE    = 158U, /* TMR6_3_GDTE */
        INT_SRC_TMR6_3_SCMP_A = 159U, /* TMR6_3_SCMA */
        INT_SRC_TMR6_3_SCMP_B = 160U, /* TMR6_3_SCMB */
        /* TIMER6_4 */
        INT_SRC_TMR6_4_GCMP_A = 161U, /* TMR6_4_GCMA */
        INT_SRC_TMR6_4_GCMP_B = 162U, /* TMR6_4_GCMB */
        INT_SRC_TMR6_4_GCMP_C = 163U, /* TMR6_4_GCMC */
        INT_SRC_TMR6_4_GCMP_D = 164U, /* TMR6_4_GCMD */
        INT_SRC_TMR6_4_GCMP_E = 165U, /* TMR6_4_GCME */
        INT_SRC_TMR6_4_GCMP_F = 166U, /* TMR6_4_GCMF */
        INT_SRC_TMR6_4_OVF    = 167U, /* TMR6_4_GOVF */
        INT_SRC_TMR6_4_UDF    = 168U, /* TMR6_4_GUDF */
        INT_SRC_TMR6_4_DTE    = 169U, /* TMR6_4_GDTE */
        INT_SRC_TMR6_4_SCMP_A = 170U, /* TMR6_4_SCMA */
        INT_SRC_TMR6_4_SCMP_B = 171U, /* TMR6_4_SCMB */
        /* TIMER6_5 */
        INT_SRC_TMR6_5_GCMP_A = 172U, /* TMR6_5_GCMA */
        INT_SRC_TMR6_5_GCMP_B = 173U, /* TMR6_5_GCMB */
        INT_SRC_TMR6_5_GCMP_C = 174U, /* TMR6_5_GCMC */
        INT_SRC_TMR6_5_GCMP_D = 175U, /* TMR6_5_GCMD */
        INT_SRC_TMR6_5_GCMP_E = 176U, /* TMR6_5_GCME */
        INT_SRC_TMR6_5_GCMP_F = 177U, /* TMR6_5_GCMF */
        INT_SRC_TMR6_5_OVF    = 178U, /* TMR6_5_GOVF */
        INT_SRC_TMR6_5_UDF    = 179U, /* TMR6_5_GUDF */
        INT_SRC_TMR6_5_DTE    = 180U, /* TMR6_5_GDTE */
        INT_SRC_TMR6_5_SCMP_A = 181U, /* TMR6_5_SCMA */
        INT_SRC_TMR6_5_SCMP_B = 182U, /* TMR6_5_SCMB */
        /* TIMER6_6 */
        INT_SRC_TMR6_6_GCMP_A = 183U, /* TMR6_6_GCMA */
        INT_SRC_TMR6_6_GCMP_B = 184U, /* TMR6_6_GCMB */
        INT_SRC_TMR6_6_GCMP_C = 185U, /* TMR6_6_GCMC */
        INT_SRC_TMR6_6_GCMP_D = 186U, /* TMR6_6_GCMD */
        INT_SRC_TMR6_6_GCMP_E = 187U, /* TMR6_6_GCME */
        INT_SRC_TMR6_6_GCMP_F = 188U, /* TMR6_6_GCMF */
        INT_SRC_TMR6_6_OVF    = 189U, /* TMR6_6_GOVF */
        INT_SRC_TMR6_6_UDF    = 190U, /* TMR6_6_GUDF */
        INT_SRC_TMR6_6_DTE    = 191U, /* TMR6_6_GDTE */
        INT_SRC_TMR6_6_SCMP_A = 192U, /* TMR6_6_SCMA */
        INT_SRC_TMR6_6_SCMP_B = 193U, /* TMR6_6_SCMB */
        /* TRLPWM */
        INT_SRC_TRLPWM = 208U, /* TRLPWM */
        /* EMB */
        INT_SRC_EMB_GR0 = 226U, /* EMB_GR0 */
        INT_SRC_EMB_GR1 = 227U, /* EMB_GR1 */
        INT_SRC_EMB_GR2 = 228U, /* EMB_GR2 */
        INT_SRC_EMB_GR3 = 229U, /* EMB_GR3 */
        INT_SRC_EMB_GR4 = 230U, /* EMB_GR4 */
        INT_SRC_EMB_GR5 = 231U, /* EMB_GR5 */
        /* HRPWM */
        INT_SRC_HRPWM1 = 244U, /* HRPWM_INT1 */
        INT_SRC_HRPWM2 = 245U, /* HRPWM_INT2 */
        INT_SRC_HRPWM3 = 246U, /* HRPWM_INT3 */
        INT_SRC_HRPWM4 = 247U, /* HRPWM_INT4 */
        INT_SRC_HRPWM5 = 248U, /* HRPWM_INT5 */
        INT_SRC_HRPWM6 = 249U, /* HRPWM_INT6 */
        INT_SRC_HRPWM7 = 250U, /* HRPWM_INT7 */
        INT_SRC_HRPWM8 = 251U, /* HRPWM_INT8 */
        /* SDFM */
        INT_SRC_SDFM_FILTER0 = 288U, /* SDFM_FILTER0_INT */
        INT_SRC_SDFM_FILTER1 = 289U, /* SDFM_FILTER1_INT */
        INT_SRC_SDFM_FILTER2 = 290U, /* SDFM_FILTER2_INT */
        INT_SRC_SDFM_FILTER3 = 291U, /* SDFM_FILTER3_INT */
        /* CMP */
        INT_SRC_CMP1 = 320U, /* CMP_1_IRQ */
        INT_SRC_CMP2 = 321U, /* CMP_2_IRQ */
        INT_SRC_CMP3 = 322U, /* CMP_3_IRQ */
        INT_SRC_CMP4 = 323U, /* CMP_4_IRQ */
        INT_SRC_CMP5 = 324U, /* CMP_5_IRQ */
        INT_SRC_CMP6 = 325U, /* CMP_6_IRQ */
        INT_SRC_CMP7 = 326U, /* CMP_7_IRQ */
        INT_SRC_CMP8 = 327U, /* CMP_8_IRQ */
        /* SPI1 */
        INT_SRC_SPI1_SPRI = 352U, /* SPI_1_SPRI */
        INT_SRC_SPI1_SPTI = 353U, /* SPI_1_SPTI */
        INT_SRC_SPI1_SPII = 354U, /* SPI_1_SPII */
        INT_SRC_SPI1_SPEI = 355U, /* SPI_1_SPEI */
        /* SPI2 */
        INT_SRC_SPI2_SPRI = 357U, /* SPI_2_SPRI */
        INT_SRC_SPI2_SPTI = 358U, /* SPI_2_SPTI */
        INT_SRC_SPI2_SPII = 359U, /* SPI_2_SPII */
        INT_SRC_SPI2_SPEI = 360U, /* SPI_2_SPEI */
        /* SPI3 */
        INT_SRC_SPI3_SPRI = 362U, /* SPI_3_SPRI */
        INT_SRC_SPI3_SPTI = 363U, /* SPI_3_SPTI */
        INT_SRC_SPI3_SPII = 364U, /* SPI_3_SPII */
        INT_SRC_SPI3_SPEI = 365U, /* SPI_3_SPEI */
        /* EVENT PORT */
        INT_SRC_EVENT_PORT1 = 372U, /* EVENT_PORT1 */
        INT_SRC_EVENT_PORT2 = 373U, /* EVENT_PORT2 */
        INT_SRC_EVENT_PORT3 = 374U, /* EVENT_PORT3 */
        INT_SRC_EVENT_PORT4 = 375U, /* EVENT_PORT4 */
        /* MCAN */
        INT_SRC_MCANRAM_ECCER = 376U, /* MCANRAM_ECCER */
        INT_SRC_MCAN1_INT0    = 377U, /* MCAN1_INT0 */
        INT_SRC_MCAN1_INT1    = 378U, /* MCAN1_INT1 */
        INT_SRC_MCAN2_INT0    = 379U, /* MCAN2_INT0 */
        INT_SRC_MCAN2_INT1    = 380U, /* MCAN2_INT1 */
        INT_SRC_MCAN3_INT0    = 381U, /* MCAN3_INT0 */
        INT_SRC_MCAN3_INT1    = 382U, /* MCAN3_INT1 */
        /* USART1 */
        INT_SRC_USART1_BRKWKPI = 384U, /* USART_1_BRKWKPI */
        INT_SRC_USART1_EI      = 385U, /* USART_1_EI */
        INT_SRC_USART1_RI      = 386U, /* USART_1_RI */
        INT_SRC_USART1_TI      = 387U, /* USART_1_TI */
        INT_SRC_USART1_RTO     = 388U, /* USART_1_RTO */
        INT_SRC_USART1_TENDI   = 389U, /* USART_1_TENDI */
        INT_SRC_USART1_TCI     = 390U, /* USART_1_TCI */
        /* USART2 */
        INT_SRC_USART2_BRKWKPI = 391U, /* USART_2_BRKWKPI */
        INT_SRC_USART2_EI      = 392U, /* USART_2_EI */
        INT_SRC_USART2_RI      = 393U, /* USART_2_RI */
        INT_SRC_USART2_TI      = 394U, /* USART_2_TI */
        INT_SRC_USART2_RTO     = 395U, /* USART_2_RTO */
        INT_SRC_USART2_TENDI   = 396U, /* USART_2_TENDI */
        INT_SRC_USART2_TCI     = 397U, /* USART_2_TCI */
        /* USART3 */
        INT_SRC_USART3_BRKWKPI = 398U, /* USART_3_BRKWKPI */
        INT_SRC_USART3_EI      = 399U, /* USART_3_EI */
        INT_SRC_USART3_RI      = 400U, /* USART_3_RI */
        INT_SRC_USART3_TI      = 401U, /* USART_3_TI */
        INT_SRC_USART3_RTO     = 402U, /* USART_3_RTO */
        INT_SRC_USART3_TENDI   = 403U, /* USART_3_TENDI */
        INT_SRC_USART3_TCI     = 404U, /* USART_3_TCI */
        /* USART4 */
        INT_SRC_USART4_BRKWKPI = 405U, /* USART_4_BRKWKPI */
        INT_SRC_USART4_EI      = 406U, /* USART_4_EI */
        INT_SRC_USART4_RI      = 407U, /* USART_4_RI */
        INT_SRC_USART4_TI      = 408U, /* USART_4_TI */
        INT_SRC_USART4_RTO     = 409U, /* USART_4_RTO */
        INT_SRC_USART4_TENDI   = 410U, /* USART_4_TENDI */
        INT_SRC_USART4_TCI     = 411U, /* USART_4_TCI */
        /* HASH */
        INT_SRC_HASH = 413U, /* HASH_INT */
        /* SKE */
        INT_SRC_SKE = 416U, /* SKE */
        /* SOGI */
        INT_SRC_SOGI_PLL_INTC1 = 423U, /* SOGI_PLL_INTC1 */
        INT_SRC_SOGI_PLL_INTC2 = 424U, /* SOGI_PLL_INTC2 */
        /* I2C1 */
        INT_SRC_I2C1_RXI = 432U, /* I2C_1_RXI */
        INT_SRC_I2C1_TXI = 433U, /* I2C_1_TXI */
        INT_SRC_I2C1_TEI = 434U, /* I2C_1_TEI */
        INT_SRC_I2C1_EEI = 435U, /* I2C_1_EEI */
        INT_SRC_I2C1_TCI = 436U, /* I2C_1_TCI */
        /* I2C2 */
        INT_SRC_I2C2_RXI = 437U, /* I2C_2_RXI */
        INT_SRC_I2C2_TXI = 438U, /* I2C_2_TXI */
        INT_SRC_I2C2_TEI = 439U, /* I2C_2_TEI */
        INT_SRC_I2C2_EEI = 440U, /* I2C_2_EEI */
        INT_SRC_I2C2_TCI = 441U, /* I2C_2_TCI */
        /* I2C3 */
        INT_SRC_I2C3_RXI = 442U, /* I2C_3_RXI */
        INT_SRC_I2C3_TXI = 443U, /* I2C_3_TXI */
        INT_SRC_I2C3_TEI = 444U, /* I2C_3_TEI */
        INT_SRC_I2C3_EEI = 445U, /* I2C_3_EEI */
        INT_SRC_I2C3_TCI = 446U, /* I2C_3_TCI */
        /* SPI1_WUPI */
        INT_SRC_SPI1_WUPI = 463U, /* SPI1_WUPI */
        /* USART1 */
        INT_SRC_USART1_WUPI = 464U, /* USART_1_WUPI */
        /* LVD */
        INT_SRC_LVD1 = 465U, /* LVD1 */
        INT_SRC_LVD2 = 466U, /* LVD2 */
        /* FCM */
        INT_SRC_FCMFERRI = 468U, /* FCMFERRI */
        INT_SRC_FCMMENDI = 469U, /* FCMMENDI */
        INT_SRC_FCMCOVFI = 470U, /* FCMCOVFI */
        /* WDT */
        INT_SRC_WDT_REFUDF = 471U, /* WDT_REFUDF */
        /* CTC */
        INT_SRC_CTC_ERR = 472U, /* CTC_ERR */
        /* ERMU */
        INT_SRC_ERMU_LPI = 473U, /* ERMU_LPI */
        /* ADC1 */
        INT_SRC_ADC1_EOCA = 480U, /* ADC_1_EOCA */
        INT_SRC_ADC1_EOCB = 481U, /* ADC_1_EOCB */
        INT_SRC_ADC1_EOCC = 482U, /* ADC_1_EOCC */
        INT_SRC_ADC1_CMP0 = 483U, /* ADC_1_CMP0 */
        INT_SRC_ADC1_CMP1 = 484U, /* ADC_1_CMP1 */
        /* ADC2 */
        INT_SRC_ADC2_EOCA = 485U, /* ADC_2_EOCA */
        INT_SRC_ADC2_EOCB = 486U, /* ADC_2_EOCB */
        INT_SRC_ADC2_EOCC = 487U, /* ADC_2_EOCC */
        INT_SRC_ADC2_CMP0 = 488U, /* ADC_2_CMP0 */
        INT_SRC_ADC2_CMP1 = 489U, /* ADC_2_CMP1 */
        /* ADC3 */
        INT_SRC_ADC3_EOCA = 490U, /* ADC_3_EOCA */
        INT_SRC_ADC3_EOCB = 491U, /* ADC_3_EOCB */
        INT_SRC_ADC3_EOCC = 492U, /* ADC_3_EOCC */
        INT_SRC_ADC3_CMP0 = 493U, /* ADC_3_CMP0 */
        INT_SRC_ADC3_CMP1 = 494U, /* ADC_3_CMP1 */
        /* ADC4 */
        INT_SRC_ADC4_EOCA = 495U, /* ADC_4_EOCA */
        INT_SRC_ADC4_EOCB = 496U, /* ADC_4_EOCB */
        INT_SRC_ADC4_EOCC = 497U, /* ADC_4_EOCC */
        INT_SRC_ADC4_CMP0 = 498U, /* ADC_4_CMP0 */
        INT_SRC_ADC4_CMP1 = 499U, /* ADC_4_CMP1 */
        /* TRNG */
        INT_SRC_TRNG_END = 500U, /* TRNG_END */
        INT_SRC_MAX      = 511U,
    } en_int_src_t;

#if defined(__CC_ARM)
#pragma anon_unions
#endif

    /***************************************************************************** */
    /* Device Specific Peripheral Registers structures */
    /***************************************************************************** */

    /**
     * @brief ADC
     */
    typedef struct
    {
        __IO uint8_t STR;
        uint8_t RESERVED0[1];
        __IO uint16_t CR0;
        __IO uint16_t CR1;
        __IO uint16_t CR2;
        uint8_t RESERVED1[4];
        __IO uint32_t CHSELRA;
        __IO uint32_t CHSELRB;
        __IO uint32_t AVCHSELR;
        uint8_t RESERVED2[4];
        __IO uint32_t TRGSR;
        __IO uint8_t SSTR0;
        __IO uint8_t SSTR1;
        __IO uint8_t SSTR2;
        __IO uint8_t SSTR3;
        __IO uint8_t SSTR4;
        __IO uint8_t SSTR5;
        __IO uint8_t SSTR6;
        __IO uint8_t SSTR7;
        __IO uint8_t SSTR8;
        __IO uint8_t SSTR9;
        __IO uint8_t SSTR10;
        __IO uint8_t SSTR11;
        __IO uint8_t SSTR12;
        __IO uint8_t SSTR13;
        __IO uint8_t SSTR14;
        __IO uint8_t SSTR15;
        __IO uint8_t SSTRL;
        uint8_t RESERVED3[3];
        __IO uint32_t DIFCHSELR;
        __IO uint16_t CHMUXR0;
        __IO uint16_t CHMUXR1;
        __IO uint16_t CHMUXR2;
        __IO uint16_t CHMUXR3;
        __IO uint32_t CHSELRC;
        __I uint8_t ISR;
        __IO uint8_t ICR;
        __IO uint8_t ISCLRR;
        uint8_t RESERVED4[5];
        __IO uint16_t SYNCCR;
        uint8_t RESERVED5[2];
        __I uint16_t DR0;
        __I uint16_t DR1;
        __I uint16_t DR2;
        __I uint16_t DR3;
        __I uint16_t DR4;
        __I uint16_t DR5;
        __I uint16_t DR6;
        __I uint16_t DR7;
        __I uint16_t DR8;
        __I uint16_t DR9;
        __I uint16_t DR10;
        __I uint16_t DR11;
        __I uint16_t DR12;
        __I uint16_t DR13;
        __I uint16_t DR14;
        __I uint16_t DR15;
        __I uint16_t DR16;
        __I uint16_t DR17;
        __I uint16_t DR18;
        __I uint16_t DR19;
        __I uint16_t DR20;
        __I uint16_t DR21;
        __I uint16_t DR22;
        __I uint16_t DR23;
        uint8_t RESERVED6[2];
        __I uint16_t DR25;
        __I uint16_t DR26;
        __I uint16_t DR27;
        __I uint16_t DR28;
        __I uint16_t DR29;
        uint8_t RESERVED7[20];
        __IO uint16_t AWDCR;
        __I uint8_t AWDSR;
        __IO uint8_t AWDSCLRR;
        __IO uint16_t AWD0DR0;
        __IO uint16_t AWD0DR1;
        __IO uint8_t AWD0CHSR;
        uint8_t RESERVED8[3];
        __IO uint16_t AWD1DR0;
        __IO uint16_t AWD1DR1;
        __IO uint8_t AWD1CHSR;
        uint8_t RESERVED9[79];
        __IO uint32_t OFR0;
        __IO uint32_t OFR1;
        __IO uint32_t OFR2;
        __IO uint32_t OFR3;
        __IO uint32_t OFR4;
        __IO uint32_t OFR5;
        __IO uint32_t OFR6;
        __IO uint32_t OFR7;
        uint8_t RESERVED10[48];
        __I uint32_t FDR0;
        __I uint32_t FDR1;
        __I uint32_t FDR2;
        __I uint32_t FDR3;
        __I uint32_t FDR4;
        __I uint32_t FDR5;
        __I uint32_t FDR6;
        __I uint32_t FDR7;
        __I uint32_t FDR8;
        __I uint32_t FDR9;
        __I uint32_t FDR10;
        __I uint32_t FDR11;
        __I uint32_t FDR12;
        __I uint32_t FDR13;
        __I uint32_t FDR14;
        __I uint32_t FDR15;
        __I uint32_t FDR16;
        __I uint32_t FDR17;
        __I uint32_t FDR18;
        __I uint32_t FDR19;
        __I uint32_t FDR20;
        __I uint32_t FDR21;
        __I uint32_t FDR22;
        __I uint32_t FDR23;
    } CM_ADC_TypeDef;

    /**
     * @brief AOS
     */
    typedef struct
    {
        __O uint32_t INTSFTTRG;
        __IO uint32_t DMA1_TRGSEL0;
        __IO uint32_t DMA1_TRGSEL1;
        __IO uint32_t DMA1_TRGSEL2;
        __IO uint32_t DMA1_TRGSEL3;
        __IO uint32_t DMA1_TRGSEL4;
        __IO uint32_t DMA1_TRGSEL5;
        __IO uint32_t DMA1_TRGSEL6;
        __IO uint32_t DMA1_TRGSEL7;
        __IO uint32_t DMA2_TRGSEL0;
        __IO uint32_t DMA2_TRGSEL1;
        __IO uint32_t DMA2_TRGSEL2;
        __IO uint32_t DMA2_TRGSEL3;
        __IO uint32_t DMA2_TRGSEL4;
        __IO uint32_t DMA2_TRGSEL5;
        __IO uint32_t DMA2_TRGSEL6;
        __IO uint32_t DMA2_TRGSEL7;
        __IO uint32_t DMA_RC_TRGSEL;
        __IO uint32_t TMR6_TRGSEL0;
        __IO uint32_t TMR6_TRGSEL1;
        __IO uint32_t TMR6_TRGSEL2;
        __IO uint32_t TMR6_TRGSEL3;
        __IO uint32_t TMR6_TRGSEL4;
        __IO uint32_t TMR6_TRGSEL5;
        __IO uint32_t TRLPWM_TRGSEL0;
        __IO uint32_t TRLPWM_TRGSEL1;
        __IO uint32_t TRLPWM_TRGSEL2;
        __IO uint32_t TRLPWM_TRGSEL3;
        __IO uint32_t TRLPWM_TRGSEL4;
        __IO uint32_t TRLPWM_TRGSEL5;
        __IO uint32_t HRPWM_TRGSEL0;
        __IO uint32_t HRPWM_TRGSEL1;
        __IO uint32_t HRPWM_TRGSEL2;
        __IO uint32_t HRPWM_TRGSEL3;
        __IO uint32_t HRPWM_TRGSEL4;
        __IO uint32_t HRPWM_TRGSEL5;
        __IO uint32_t HRPWM_TRGSEL6;
        __IO uint32_t HRPWM_TRGSEL7;
        __IO uint32_t HRPWM_TRGSEL8;
        __IO uint32_t PEVNT_TRGSEL12;
        __IO uint32_t PEVNT_TRGSEL34;
        __IO uint32_t TMR0_TRGSEL;
        __IO uint32_t HASH_TRGSELB;
        __IO uint32_t HASH_TRGSELA;
        __IO uint32_t SOGI_TRGSEL;
        __IO uint32_t ADC1_TRGSEL0;
        __IO uint32_t ADC1_TRGSEL1;
        __IO uint32_t ADC1_TRGSEL2;
        __IO uint32_t ADC2_TRGSEL0;
        __IO uint32_t ADC2_TRGSEL1;
        __IO uint32_t ADC2_TRGSEL2;
        __IO uint32_t ADC3_TRGSEL0;
        __IO uint32_t ADC3_TRGSEL1;
        __IO uint32_t ADC3_TRGSEL2;
        __IO uint32_t ADC4_TRGSEL0;
        __IO uint32_t ADC4_TRGSEL1;
        __IO uint32_t ADC4_TRGSEL2;
        __IO uint32_t COMTRGSEL1;
        __IO uint32_t COMTRGSEL2;
        uint8_t RESERVED0[20];
        __IO uint32_t PEVNTDIRR1;
        __I uint32_t PEVNTIDR1;
        __IO uint32_t PEVNTODR1;
        __IO uint32_t PEVNTORR1;
        __IO uint32_t PEVNTOSR1;
        __IO uint32_t PEVNTRISR1;
        __IO uint32_t PEVNTFALR1;
        __IO uint32_t PEVNTDIRR2;
        __I uint32_t PEVNTIDR2;
        __IO uint32_t PEVNTODR2;
        __IO uint32_t PEVNTORR2;
        __IO uint32_t PEVNTOSR2;
        __IO uint32_t PEVNTRISR2;
        __IO uint32_t PEVNTFALR2;
        __IO uint32_t PEVNTDIRR3;
        __I uint32_t PEVNTIDR3;
        __IO uint32_t PEVNTODR3;
        __IO uint32_t PEVNTORR3;
        __IO uint32_t PEVNTOSR3;
        __IO uint32_t PEVNTRISR3;
        __IO uint32_t PEVNTFALR3;
        __IO uint32_t PEVNTDIRR4;
        __I uint32_t PEVNTIDR4;
        __IO uint32_t PEVNTODR4;
        __IO uint32_t PEVNTORR4;
        __IO uint32_t PEVNTOSR4;
        __IO uint32_t PEVNTRISR4;
        __IO uint32_t PEVNTFALR4;
        __IO uint32_t PEVNTNFCR;
    } CM_AOS_TypeDef;

    /**
     * @brief CMP
     */
    typedef struct
    {
        __IO uint8_t MDR;
        __IO uint8_t FIR;
        __IO uint8_t OCR;
        __I uint8_t OMR;
        __IO uint32_t PMSR;
        uint8_t RESERVED0[8];
        __IO uint32_t BWSR1;
        __IO uint16_t BWSR2;
        uint8_t RESERVED1[2];
        __IO uint32_t SCCR;
        __IO uint32_t SCMR;
    } CM_CMP_TypeDef;

