MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    /**
     * @brief CMU
     */
    typedef struct
    {
        uint8_t RESERVED0[19564];
        __IO uint8_t LRCCR;
        uint8_t RESERVED1[7];
        __IO uint8_t LRCTRM;
        uint8_t RESERVED2[67];
        __IO uint8_t XTALCFGR;
        uint8_t RESERVED3[29527];
        __IO uint16_t PERICKSEL;
        uint8_t RESERVED4[6];
        __IO uint16_t CANCKCFGR;
        uint8_t RESERVED5[6];
        __IO uint32_t SCFGR;
        uint8_t RESERVED6[2];
        __IO uint8_t CKSWR;
        uint8_t RESERVED7[3];
        __IO uint8_t PLLHCR;
        uint8_t RESERVED8[7];
        __IO uint8_t XTALCR;
        uint8_t RESERVED9[3];
        __IO uint8_t HRCCR;
        uint8_t RESERVED10[1];
        __IO uint8_t MRCCR;
        uint8_t RESERVED11[3];
        __I uint8_t OSCSTBSR;
        __IO uint8_t MCO1CFGR;
        __IO uint8_t MCO2CFGR;
        __IO uint8_t TPIUCKCFGR;
        __IO uint8_t XTALSTDCR;
        __IO uint8_t XTALSTDSR;
        uint8_t RESERVED12[30];
        __IO uint16_t MRCTRM;
        __IO uint8_t HRCTRM;
        uint8_t RESERVED13[63];
        __IO uint8_t XTALSTBCR;
        uint8_t RESERVED14[93];
        __IO uint32_t PLLHCFGR;
    } CM_CMU_TypeDef;

    /**
     * @brief CORDIC
     */
    typedef struct
    {
        __IO uint32_t CSR;
        __O uint32_t WDATA;
        __I uint32_t RDATA;
        __IO uint32_t INTEN;
        __IO uint32_t ISR;
        __O uint32_t ICR;
    } CM_CORDIC_TypeDef;

    /**
     * @brief CRC
     */
    typedef struct
    {
        __IO uint32_t CR;
        __IO uint32_t RESLT;
        uint8_t RESERVED0[120];
        __O uint32_t DAT0;
        __O uint32_t DAT1;
        __O uint32_t DAT2;
        __O uint32_t DAT3;
        __O uint32_t DAT4;
        __O uint32_t DAT5;
        __O uint32_t DAT6;
        __O uint32_t DAT7;
        __O uint32_t DAT8;
        __O uint32_t DAT9;
        __O uint32_t DAT10;
        __O uint32_t DAT11;
        __O uint32_t DAT12;
        __O uint32_t DAT13;
        __O uint32_t DAT14;
        __O uint32_t DAT15;
        __O uint32_t DAT16;
        __O uint32_t DAT17;
        __O uint32_t DAT18;
        __O uint32_t DAT19;
        __O uint32_t DAT20;
        __O uint32_t DAT21;
        __O uint32_t DAT22;
        __O uint32_t DAT23;
        __O uint32_t DAT24;
        __O uint32_t DAT25;
        __O uint32_t DAT26;
        __O uint32_t DAT27;
        __O uint32_t DAT28;
        __O uint32_t DAT29;
        __O uint32_t DAT30;
        __O uint32_t DAT31;
    } CM_CRC_TypeDef;

    /**
     * @brief CTC
     */
    typedef struct
    {
        __IO uint32_t CR1;
        __IO uint32_t CR2;
        __I uint32_t STR;
    } CM_CTC_TypeDef;

    /**
     * @brief DAC
     */
    typedef struct
    {
        __IO uint16_t DADR1;
        __IO uint16_t DADR2;
        __IO uint16_t DACR;
        __IO uint16_t DAADPCR;
        uint8_t RESERVED0[21];
        __IO uint8_t DAOCR;
        uint8_t RESERVED1[2];
        __IO uint32_t DACR2;
        __IO uint16_t RAMPLMTR1;
        __IO uint16_t RAMPLMTR2;
        __IO uint16_t RAMPSTEPR1;
        __IO uint16_t RAMPSTEPR2;
        __O uint16_t RAMPSWTRGR;
        uint8_t RESERVED2[2];
        __I uint16_t DADACTR1;
        __I uint16_t DADACTR2;
        __IO uint16_t DACR3;
        uint8_t RESERVED3[2];
        __IO uint16_t DADRDE1;
        __IO uint16_t DADRDE2;
        __IO uint16_t DADROF1;
        __IO uint16_t DADROF2;
        uint8_t RESERVED4[12];
        __IO uint16_t RAMPRSTDLYR1;
        __IO uint16_t RAMPRSTDLYR2;
        __IO uint16_t RAMPLMTACTR1;
        __IO uint16_t RAMPLMTACTR2;
        __IO uint16_t RAMPSTEPACTR1;
        __IO uint16_t RAMPSTEPACTR2;
        __IO uint16_t RAMPRSTDLYACTR1;
        __IO uint16_t RAMPRSTDLYACTR2;
    } CM_DAC_TypeDef;

    /**
     * @brief DBGC
     */
    typedef struct
    {
        __IO uint32_t AUTHID0;
        __IO uint32_t AUTHID1;
        __IO uint32_t AUTHID2;
        __I uint32_t CHIPID;
        __IO uint32_t MCUSTAT;
        uint8_t RESERVED0[4];
        __IO uint32_t FERSCTL;
        __IO uint32_t MCUDBGCSTAT;
        __IO uint32_t MCUSTPCTL;
        __IO uint32_t MCUTRACECTL;
    } CM_DBGC_TypeDef;

    /**
     * @brief DMA
     */
    typedef struct
    {
        __IO uint32_t EN;
        __I uint32_t INTSTAT0;
        __I uint32_t INTSTAT1;
        __IO uint32_t INTMASK0;
        __IO uint32_t INTMASK1;
        __IO uint32_t INTCLR0;
        __IO uint32_t INTCLR1;
        __IO uint32_t CHEN;
        __I uint32_t REQSTAT;
        __I uint32_t CHSTAT;
        uint8_t RESERVED0[4];
        __IO uint32_t RCFGCTL;
        __O uint32_t SWREQ;
        __O uint32_t CHENCLR;
        uint8_t RESERVED1[8];
        __IO uint32_t SAR0;
        __IO uint32_t DAR0;
        __IO uint32_t DTCTL0;
        union
        {
            __IO uint32_t RPT0;
            __IO uint32_t RPTB0;
        };
        union
        {
            __IO uint32_t SNSEQCTL0;
            __IO uint32_t SNSEQCTLB0;
        };
        union
        {
            __IO uint32_t DNSEQCTL0;
            __IO uint32_t DNSEQCTLB0;
        };
        __IO uint32_t LLP0;
        __IO uint32_t CHCTL0;
        __I uint32_t MONSAR0;
        __I uint32_t MONDAR0;
        __I uint32_t MONDTCTL0;
        __I uint32_t MONRPT0;
        __I uint32_t MONSNSEQCTL0;
        __I uint32_t MONDNSEQCTL0;
        uint8_t RESERVED2[8];
        __IO uint32_t SAR1;
        __IO uint32_t DAR1;
        __IO uint32_t DTCTL1;
        union
        {
            __IO uint32_t RPT1;
            __IO uint32_t RPTB1;
        };
        union
        {
            __IO uint32_t SNSEQCTL1;
            __IO uint32_t SNSEQCTLB1;
        };
        union
        {
            __IO uint32_t DNSEQCTL1;
            __IO uint32_t DNSEQCTLB1;
        };
        __IO uint32_t LLP1;
        __IO uint32_t CHCTL1;
        __I uint32_t MONSAR1;
        __I uint32_t MONDAR1;
        __I uint32_t MONDTCTL1;
        __I uint32_t MONRPT1;
        __I uint32_t MONSNSEQCTL1;
        __I uint32_t MONDNSEQCTL1;
        uint8_t RESERVED3[8];
        __IO uint32_t SAR2;
        __IO uint32_t DAR2;
        __IO uint32_t DTCTL2;
        union
        {
            __IO uint32_t RPT2;
            __IO uint32_t RPTB2;
        };
        union
        {
            __IO uint32_t SNSEQCTL2;
            __IO uint32_t SNSEQCTLB2;
        };
        union
        {
            __IO uint32_t DNSEQCTL2;
            __IO uint32_t DNSEQCTLB2;
        };
        __IO uint32_t LLP2;
        __IO uint32_t CHCTL2;
        __I uint32_t MONSAR2;
        __I uint32_t MONDAR2;
        __I uint32_t MONDTCTL2;
        __I uint32_t MONRPT2;
        __I uint32_t MONSNSEQCTL2;
        __I uint32_t MONDNSEQCTL2;
        uint8_t RESERVED4[8];
        __IO uint32_t SAR3;
        __IO uint32_t DAR3;
        __IO uint32_t DTCTL3;
        union
        {
            __IO uint32_t RPT3;
            __IO uint32_t RPTB3;
        };
        union
        {
            __IO uint32_t SNSEQCTL3;
            __IO uint32_t SNSEQCTLB3;
        };
        union
        {
            __IO uint32_t DNSEQCTL3;
            __IO uint32_t DNSEQCTLB3;
        };
        __IO uint32_t LLP3;
        __IO uint32_t CHCTL3;
        __I uint32_t MONSAR3;
        __I uint32_t MONDAR3;
        __I uint32_t MONDTCTL3;
        __I uint32_t MONRPT3;
        __I uint32_t MONSNSEQCTL3;
        __I uint32_t MONDNSEQCTL3;
        uint8_t RESERVED5[8];
        __IO uint32_t SAR4;
        __IO uint32_t DAR4;
        __IO uint32_t DTCTL4;
        union
        {
            __IO uint32_t RPT4;
            __IO uint32_t RPTB4;
        };
        union
        {
            __IO uint32_t SNSEQCTL4;
            __IO uint32_t SNSEQCTLB4;
        };
        union
        {
            __IO uint32_t DNSEQCTL4;
            __IO uint32_t DNSEQCTLB4;
        };
        __IO uint32_t LLP4;
        __IO uint32_t CHCTL4;
        __I uint32_t MONSAR4;
        __I uint32_t MONDAR4;
        __I uint32_t MONDTCTL4;
        __I uint32_t MONRPT4;
        __I uint32_t MONSNSEQCTL4;
        __I uint32_t MONDNSEQCTL4;
        uint8_t RESERVED6[8];
        __IO uint32_t SAR5;
        __IO uint32_t DAR5;
        __IO uint32_t DTCTL5;
        union
        {
            __IO uint32_t RPT5;
            __IO uint32_t RPTB5;
        };
        union
        {
            __IO uint32_t SNSEQCTL5;
            __IO uint32_t SNSEQCTLB5;
        };
        union
        {
            __IO uint32_t DNSEQCTL5;
            __IO uint32_t DNSEQCTLB5;
        };
        __IO uint32_t LLP5;
        __IO uint32_t CHCTL5;
        __I uint32_t MONSAR5;
        __I uint32_t MONDAR5;
        __I uint32_t MONDTCTL5;
        __I uint32_t MONRPT5;
        __I uint32_t MONSNSEQCTL5;
        __I uint32_t MONDNSEQCTL5;
        uint8_t RESERVED7[8];
        __IO uint32_t SAR6;
        __IO uint32_t DAR6;
        __IO uint32_t DTCTL6;
        union
        {
            __IO uint32_t RPT6;
            __IO uint32_t RPTB6;
        };
        union
        {
            __IO uint32_t SNSEQCTL6;
            __IO uint32_t SNSEQCTLB6;
        };
        union
        {
            __IO uint32_t DNSEQCTL6;
            __IO uint32_t DNSEQCTLB6;
        };
        __IO uint32_t LLP6;
        __IO uint32_t CHCTL6;
        __I uint32_t MONSAR6;
        __I uint32_t MONDAR6;
        __I uint32_t MONDTCTL6;
        __I uint32_t MONRPT6;
        __I uint32_t MONSNSEQCTL6;
        __I uint32_t MONDNSEQCTL6;
        uint8_t RESERVED8[8];
        __IO uint32_t SAR7;
        __IO uint32_t DAR7;
        __IO uint32_t DTCTL7;
        union
        {
            __IO uint32_t RPT7;
            __IO uint32_t RPTB7;
        };
        union
        {
            __IO uint32_t SNSEQCTL7;
            __IO uint32_t SNSEQCTLB7;
        };
        union
        {
            __IO uint32_t DNSEQCTL7;
            __IO uint32_t DNSEQCTLB7;
        };
        __IO uint32_t LLP7;
        __IO uint32_t CHCTL7;
        __I uint32_t MONSAR7;
        __I uint32_t MONDAR7;
        __I uint32_t MONDTCTL7;
        __I uint32_t MONRPT7;
        __I uint32_t MONSNSEQCTL7;
        __I uint32_t MONDNSEQCTL7;
    } CM_DMA_TypeDef;

    /**
     * @brief DSOGI_PLL
     */
    typedef struct
    {
        __IO uint32_t CR;
        __IO uint32_t ST;
        __IO uint32_t CLARKK;
        __IO uint32_t CLARKAS;
        __IO uint32_t CLARKBS;
        __IO uint32_t CLARKCS;
        __IO uint32_t CLARKDS;
        __IO uint32_t CLARKQS;
        __IO uint32_t CLARKFLTA;
        __IO uint32_t CLARKFLTB;
        __IO uint32_t CLARKFLTC;
        __IO uint32_t K;
        __IO uint32_t DK;
        __IO uint32_t QK;
        __IO uint32_t TS;
        __IO uint32_t FLLK;
        __IO uint32_t FREBASE;
        __IO uint32_t MAX;
        __IO uint32_t MIN;
        __IO uint32_t DS;
        __IO uint32_t QS;
        __IO uint32_t W;
        __IO uint32_t ALPHADV;
        __IO uint32_t ALPHAQV;
        __IO uint32_t BETADV;
        __IO uint32_t BETAQV;
        __IO uint32_t VGRIDPDS;
        __IO uint32_t VGRIDPQS;
        __IO uint32_t VGRIDNDS;
        __IO uint32_t VGRIDNQS;
        __IO uint32_t PARKDS;
        __IO uint32_t PARKQS;
        __IO uint32_t PARKTHETA;
        __IO uint32_t PARKDE;
        __IO uint32_t PARKQE;
        __IO uint32_t PARKSIN;
        __IO uint32_t PARKCOS;
        __IO uint32_t PLLK;
        __IO uint32_t PLLKP;
        __IO uint32_t PLLKITS;
        __IO uint32_t PLLMAX;
        __IO uint32_t PLLMIN;
        __IO uint32_t PLLFINISHERRTH;
        __IO uint32_t PLLTHETACMP1;
        __IO uint32_t PLLTHETACMP2;
        __IO uint32_t PLLTHETACMP3;
        __IO uint32_t PLLTHETACMP4;
        __IO uint32_t PLLVGCMP;
        __IO uint32_t PLLTHETASTEP;
        __IO uint32_t PLLDIN;
        __IO uint32_t PLLW;
        __IO uint32_t PLLUP;
        __IO uint32_t PLLUI;
        __IO uint32_t PLLPI;
        __IO uint32_t PLLTHETA;
        __IO uint32_t PLLTHETA_PI;
        __IO uint32_t PLLFREQ;
        __IO uint32_t PLLDINFLT;
        __IO uint32_t PLLSIN;
        __IO uint32_t PLLCOS;
    } CM_DSOGI_PLL_TypeDef;

    /**
     * @brief EFM
     */
    typedef struct
    {
        __IO uint32_t FAPRT;
        __IO uint32_t KEY1;
        __IO uint32_t KEY2;
        uint8_t RESERVED0[8];
        __IO uint32_t FSTP;
        __IO uint32_t FRMC;
        __IO uint32_t FWMC;
        __I uint32_t FSR;
        __IO uint32_t FSCLR;
        __IO uint32_t FITE;
        __I uint32_t FSWP;
        __IO uint32_t FRMC2;
        __IO uint32_t FRLTSWP;
        uint8_t RESERVED1[8];
        __I uint32_t CHIPID;
        uint8_t RESERVED2[12];
        __I uint32_t UQID0;
        __I uint32_t UQID1;
        __I uint32_t UQID2;
        uint8_t RESERVED3[164];
        __IO uint32_t MMF_REMPRT;
        __IO uint32_t MMF_REMCR0;
        __IO uint32_t MMF_REMCR1;
        uint8_t RESERVED4[116];
        __IO uint32_t WLOCK;
        uint8_t RESERVED5[12];
        __IO uint32_t F0NWPRT;
        uint8_t RESERVED6[12];
        __IO uint32_t F1NWPRT;
        uint8_t RESERVED7[428];
        __IO uint32_t CKCR;
        __IO uint32_t CKPR;
        __IO uint32_t CKSR;
        __IO uint32_t EIEN;
        uint8_t RESERVED8[16];
        __IO uint32_t F0ECCCR;
        __IO uint32_t F0ECCDR;
        __IO uint32_t F0ERR0;
        __IO uint32_t F0ERR1;
        __IO uint32_t F0EIR0;
        __IO uint32_t F0EIR1;
        __IO uint32_t F0EIR2;
        __IO uint32_t F0EIR3;
        __IO uint32_t F0EIR4;
        uint8_t RESERVED9[28];
        __IO uint32_t F1ECCCR;
        __IO uint32_t F1ECCDR;
        __IO uint32_t F1ERR0;
        __IO uint32_t F1ERR1;
        __IO uint32_t F1EIR0;
        __IO uint32_t F1EIR1;
        __IO uint32_t F1EIR2;
        __IO uint32_t F1EIR3;
        __IO uint32_t F1EIR4;
    } CM_EFM_TypeDef;

    /**
     * @brief EMB
     */
    typedef struct
    {
        __IO uint32_t CTL1;
        __IO uint32_t CTL2;
        __IO uint32_t SOE;
        __I uint32_t STAT1;
        __O uint32_t STATCLR;
        __IO uint32_t INTEN;
        __IO uint32_t RLSSEL;
        __IO uint32_t CTL3;
        __IO uint32_t CTL4;
        uint8_t RESERVED0[4];
        __IO uint32_t STAT2;
        uint8_t RESERVED1[4];
        __IO uint32_t STAT3;
        __IO uint32_t CTL5;
        __IO uint32_t CTL6;
    } CM_EMB_TypeDef;

    /**
     * @brief ERMU
     */
    typedef struct
    {
        __IO uint32_t EO0C;
        __I uint32_t EO0S;
        __I uint32_t EO0CTCNT;
        __IO uint32_t EO0CTCMP;
        __IO uint32_t EO0TTC;
        __I uint32_t EO0TTCNT;
        __IO uint32_t EO0TTCMP;
        uint8_t RESERVED0[36];
        __IO uint32_t EO0OM0;
        __IO uint32_t EO0OM1;
        uint8_t RESERVED1[56];
        __IO uint32_t EO1C;
        __I uint32_t EO1S;
        __I uint32_t EO1CTCNT;
        __IO uint32_t EO1CTCMP;
        __IO uint32_t EO1TTC;
        __I uint32_t EO1TTCNT;
        __IO uint32_t EO1TTCMP;
        uint8_t RESERVED2[36];
        __IO uint32_t EO1OM0;
        __IO uint32_t EO1OM1;
        uint8_t RESERVED3[56];
        __IO uint32_t EO2C;
        __I uint32_t EO2S;
        __I uint32_t EO2CTCNT;
        __IO uint32_t EO2CTCMP;
        __IO uint32_t EO2TTC;
        __I uint32_t EO2TTCNT;
        __IO uint32_t EO2TTCMP;
        uint8_t RESERVED4[36];
        __IO uint32_t EO2OM0;
        __IO uint32_t EO2OM1;
        uint8_t RESERVED5[56];
        __IO uint32_t EO3C;
        __I uint32_t EO3S;
        __I uint32_t EO3CTCNT;
        __IO uint32_t EO3CTCMP;
        __IO uint32_t EO3TTC;
        __I uint32_t EO3TTCNT;
        __IO uint32_t EO3TTCMP;
        uint8_t RESERVED6[36];
        __IO uint32_t EO3OM0;
        __IO uint32_t EO3OM1;
        uint8_t RESERVED7[56];
        __IO uint32_t WT0C;
        __I uint32_t WT0S;
        __I uint32_t WT0CNT;
        __IO uint32_t WT0CMP;
        __IO uint32_t WT0SE;
        uint8_t RESERVED8[12];
        __IO uint32_t WT1C;
        __I uint32_t WT1S;
        __I uint32_t WT1CNT;
        __IO uint32_t WT1CMP;
        __IO uint32_t WT1SE;
        uint8_t RESERVED9[12];
        __IO uint32_t WT2C;
        __I uint32_t WT2S;
        __I uint32_t WT2CNT;
        __IO uint32_t WT2CMP;
        __IO uint32_t WT2SE;
        uint8_t RESERVED10[12];
        __IO uint32_t WT3C;
        __I uint32_t WT3S;
        __I uint32_t WT3CNT;
        __IO uint32_t WT3CMP;
        __IO uint32_t WT3SE;
        uint8_t RESERVED11[140];
        __I uint32_t ESS0;
        __I uint32_t ESS1;
        uint8_t RESERVED12[56];
        __O uint32_t ESSC0;
        __O uint32_t ESSC1;
        uint8_t RESERVED13[56];
        __O uint32_t PET0;
        __O uint32_t PET1;
        uint8_t RESERVED14[56];
        __IO uint32_t RE0;
        __IO uint32_t RE1;
        uint8_t RESERVED15[56];
        __IO uint32_t LPIE0;
        __IO uint32_t LPIE1;
        uint8_t RESERVED16[248];
        __IO uint32_t HPIE0;
        __IO uint32_t HPIE1;
        uint8_t RESERVED17[248];
        __IO uint32_t CCPS;
    } CM_ERMU_TypeDef;

    /**
     * @brief FCM
     */
    typedef struct
    {
        __IO uint32_t LVR;
        __IO uint32_t UVR;
        __I uint32_t CNTR;
        uint8_t RESERVED0[4];
        __IO uint32_t MCCR;
        __IO uint32_t RCCR;
        __IO uint32_t RIER;
        uint8_t RESERVED1[4];
        __O uint32_t CLR;
    } CM_FCM_TypeDef;

    /**
     * @brief FCM_COM
     */
    typedef struct
    {
        uint8_t RESERVED0[12];
        __IO uint32_t STR;
        uint8_t RESERVED1[12];
        __I uint32_t SR;
    } CM_FCM_COM_TypeDef;

    /**
     * @brief FMAC
     */
    typedef struct
    {
        __IO uint32_t FIR_CR;
        __IO uint32_t FIR_XWDATA;
        __IO uint32_t FIR_CWDATA;
        __IO uint32_t FIR_PARM;
        __I uint32_t FIR_YRDATA;
        __IO uint32_t FIR_INT_CR;
        __IO uint32_t FIR_STA;
        __I uint32_t FIR_DATA_NUM;
        __IO uint32_t FIR_AVG_COEF;
        __IO uint32_t FIR_YMAX;
        __IO uint32_t FIR_YMIN;
        __IO uint32_t FIR_SRADDR;
        __I uint32_t FIR_SRDATAX;
        __I uint32_t FIR_SRDATAC;
        __I uint32_t FIR_HADDR;
        uint8_t RESERVED0[36];
        __IO uint32_t IIR_CR1;
        __IO uint32_t IIR_CR2;
        __IO uint32_t IIR_INT_CR;
        __IO uint32_t IIR_STA1;
        __IO uint32_t IIR_STA2;
        __IO uint32_t IIR_BUF_STA;
        uint8_t RESERVED1[8];
        __IO uint32_t IIR_CH1_PARM;
        __IO uint32_t IIR_CH2_PARM;
        __IO uint32_t IIR_CH3_PARM;
        __IO uint32_t IIR_CH4_PARM;
        __IO uint32_t IIR_CH5_PARM;
        __IO uint32_t IIR_CH6_PARM;
        uint8_t RESERVED2[8];
        __I uint32_t IIR_YRDATA1;
        __I uint32_t IIR_YRDATA2;
        __I uint32_t IIR_YRDATA3;
        __I uint32_t IIR_YRDATA4;
        __I uint32_t IIR_YRDATA5;
        __I uint32_t IIR_YRDATA6;
        uint8_t RESERVED3[8];
        __O uint32_t IIR_XWDATA1;
        __O uint32_t IIR_XWDATA2;
        __O uint32_t IIR_XWDATA3;
        __O uint32_t IIR_XWDATA4;
        __O uint32_t IIR_XWDATA5;
        __O uint32_t IIR_XWDATA6;
        uint8_t RESERVED4[8];
        __O uint32_t IIR_CWDATA1;
        __O uint32_t IIR_CWDATA2;
        __O uint32_t IIR_CWDATA3;
        __O uint32_t IIR_CWDATA4;
        __O uint32_t IIR_CWDATA5;
        __O uint32_t IIR_CWDATA6;
        uint8_t RESERVED5[8];
        __O uint32_t IIR_YWDATA1;
        __O uint32_t IIR_YWDATA2;
        __O uint32_t IIR_YWDATA3;
        __O uint32_t IIR_YWDATA4;
        __O uint32_t IIR_YWDATA5;
        __O uint32_t IIR_YWDATA6;
        uint8_t RESERVED6[8];
        __IO uint32_t IIR_YMAX1;
        __IO uint32_t IIR_YMAX2;
        uint8_t RESERVED7[24];
        __IO uint32_t IIR_YMIN1;
        __IO uint32_t IIR_YMIN2;
        uint8_t RESERVED8[24];
        __IO uint32_t IIR_DATA_CR1;
        __IO uint32_t IIR_DATA_CR2;
        __IO uint32_t IIR_DATA_CR3;
        __IO uint32_t IIR_DATA_CR4;
        __IO uint32_t IIR_DATA_CR5;
        __IO uint32_t IIR_DATA_CR6;
        uint8_t RESERVED9[8];
        __IO uint32_t IIR_SRADDR1;
        __IO uint32_t IIR_SRADDR2;
        __IO uint32_t IIR_SRADDR3;
        __IO uint32_t IIR_SRADDR4;
        __IO uint32_t IIR_SRADDR5;
        __IO uint32_t IIR_SRADDR6;
        uint8_t RESERVED10[8];
        __I uint32_t IIR_SRDATAX1;
        __I uint32_t IIR_SRDATAX2;
        __I uint32_t IIR_SRDATAX3;
        __I uint32_t IIR_SRDATAX4;
        __I uint32_t IIR_SRDATAX5;
        __I uint32_t IIR_SRDATAX6;
        uint8_t RESERVED11[8];
        __I uint32_t IIR_SRDATAC1;
        __I uint32_t IIR_SRDATAC2;
        __I uint32_t IIR_SRDATAC3;
        __I uint32_t IIR_SRDATAC4;
        __I uint32_t IIR_SRDATAC5;
        __I uint32_t IIR_SRDATAC6;
        uint8_t RESERVED12[8];
        __I uint32_t IIR_SRDATAY1;
        __I uint32_t IIR_SRDATAY2;
        __I uint32_t IIR_SRDATAY3;
        __I uint32_t IIR_SRDATAY4;
        __I uint32_t IIR_SRDATAY5;
        uint8_t RESERVED13[1];
        __I uint32_t IIR_SRDATAY6;
        uint8_t RESERVED14[7];
        __I uint32_t IIR_HADDR1;
        __I uint32_t IIR_HADDR2;
        __I uint32_t IIR_HADDR3;
        __I uint32_t IIR_HADDR4;
        __I uint32_t IIR_HADDR5;
        __I uint32_t IIR_HADDR6;
    } CM_FMAC_TypeDef;

    /**
     * @brief FMAC_ECC
     */
    typedef struct
    {
        __IO uint32_t RAM0_CKCR;
        __IO uint32_t RAM0_CKSR;
        __IO uint32_t RAM0_EIEN;
        __IO uint32_t RAM0_EIBIT0;
        __IO uint32_t RAM0_EIBIT1;
        __I uint32_t RAM0_ECCERRADDR;
        uint8_t RESERVED0[8];
        __IO uint32_t RAM1_CKCR;
        __IO uint32_t RAM1_CKSR;
        __IO uint32_t RAM1_EIEN;
        __IO uint32_t RAM1_EIBIT0;
        __IO uint32_t RAM1_EIBIT1;
        __I uint32_t RAM1_ECCERRADDR;
    } CM_FMAC_ECC_TypeDef;

