MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    /**
     * @brief GPIO
     */
    typedef struct
    {
        __I uint16_t PIDRA;
        uint8_t RESERVED0[2];
        __IO uint16_t PODRA;
        __IO uint16_t POERA;
        __O uint16_t POSRA;
        __O uint16_t PORRA;
        __O uint16_t POTRA;
        uint8_t RESERVED1[2];
        __I uint16_t PIDRB;
        uint8_t RESERVED2[2];
        __IO uint16_t PODRB;
        __IO uint16_t POERB;
        __O uint16_t POSRB;
        __O uint16_t PORRB;
        __O uint16_t POTRB;
        uint8_t RESERVED3[2];
        __I uint16_t PIDRC;
        uint8_t RESERVED4[2];
        __IO uint16_t PODRC;
        __IO uint16_t POERC;
        __O uint16_t POSRC;
        __O uint16_t PORRC;
        __O uint16_t POTRC;
        uint8_t RESERVED5[2];
        __I uint16_t PIDRD;
        uint8_t RESERVED6[2];
        __IO uint16_t PODRD;
        __IO uint16_t POERD;
        __O uint16_t POSRD;
        __O uint16_t PORRD;
        __O uint16_t POTRD;
        uint8_t RESERVED7[2];
        __I uint16_t PIDRE;
        uint8_t RESERVED8[2];
        __IO uint16_t PODRE;
        __IO uint16_t POERE;
        __O uint16_t POSRE;
        __O uint16_t PORRE;
        __O uint16_t POTRE;
        uint8_t RESERVED9[2];
        __I uint16_t PIDRF;
        uint8_t RESERVED10[2];
        __IO uint16_t PODRF;
        __IO uint16_t POERF;
        __O uint16_t POSRF;
        __O uint16_t PORRF;
        __O uint16_t POTRF;
        uint8_t RESERVED11[2];
        __I uint16_t PIDRG;
        uint8_t RESERVED12[2];
        __IO uint16_t PODRG;
        __IO uint16_t POERG;
        __O uint16_t POSRG;
        __O uint16_t PORRG;
        __O uint16_t POTRG;
        uint8_t RESERVED13[882];
        __IO uint32_t PHRPWMSEL;
        __IO uint32_t PHRPWMEX;
        uint8_t RESERVED14[12];
        __IO uint16_t PSPCR;
        uint8_t RESERVED15[2];
        __IO uint16_t PCCR;
        __IO uint16_t PINAER;
        __IO uint16_t PWPR;
        uint8_t RESERVED16[2];
        __IO uint16_t PCRA0;
        __IO uint16_t PFSRA0;
        __IO uint16_t PCRA1;
        __IO uint16_t PFSRA1;
        __IO uint16_t PCRA2;
        __IO uint16_t PFSRA2;
        __IO uint16_t PCRA3;
        __IO uint16_t PFSRA3;
        __IO uint16_t PCRA4;
        __IO uint16_t PFSRA4;
        __IO uint16_t PCRA5;
        __IO uint16_t PFSRA5;
        __IO uint16_t PCRA6;
        __IO uint16_t PFSRA6;
        __IO uint16_t PCRA7;
        __IO uint16_t PFSRA7;
        __IO uint16_t PCRA8;
        __IO uint16_t PFSRA8;
        __IO uint16_t PCRA9;
        __IO uint16_t PFSRA9;
        __IO uint16_t PCRA10;
        __IO uint16_t PFSRA10;
        __IO uint16_t PCRA11;
        __IO uint16_t PFSRA11;
        __IO uint16_t PCRA12;
        __IO uint16_t PFSRA12;
        __IO uint16_t PCRA13;
        __IO uint16_t PFSRA13;
        __IO uint16_t PCRA14;
        __IO uint16_t PFSRA14;
        __IO uint16_t PCRA15;
        __IO uint16_t PFSRA15;
        __IO uint16_t PCRB0;
        __IO uint16_t PFSRB0;
        __IO uint16_t PCRB1;
        __IO uint16_t PFSRB1;
        __IO uint16_t PCRB2;
        __IO uint16_t PFSRB2;
        __IO uint16_t PCRB3;
        __IO uint16_t PFSRB3;
        __IO uint16_t PCRB4;
        __IO uint16_t PFSRB4;
        __IO uint16_t PCRB5;
        __IO uint16_t PFSRB5;
        __IO uint16_t PCRB6;
        __IO uint16_t PFSRB6;
        __IO uint16_t PCRB7;
        __IO uint16_t PFSRB7;
        __IO uint16_t PCRB8;
        __IO uint16_t PFSRB8;
        __IO uint16_t PCRB9;
        __IO uint16_t PFSRB9;
        __IO uint16_t PCRB10;
        __IO uint16_t PFSRB10;
        __IO uint16_t PCRB11;
        __IO uint16_t PFSRB11;
        __IO uint16_t PCRB12;
        __IO uint16_t PFSRB12;
        __IO uint16_t PCRB13;
        __IO uint16_t PFSRB13;
        __IO uint16_t PCRB14;
        __IO uint16_t PFSRB14;
        __IO uint16_t PCRB15;
        __IO uint16_t PFSRB15;
        __IO uint16_t PCRC0;
        __IO uint16_t PFSRC0;
        __IO uint16_t PCRC1;
        __IO uint16_t PFSRC1;
        __IO uint16_t PCRC2;
        __IO uint16_t PFSRC2;
        __IO uint16_t PCRC3;
        __IO uint16_t PFSRC3;
        __IO uint16_t PCRC4;
        __IO uint16_t PFSRC4;
        __IO uint16_t PCRC5;
        __IO uint16_t PFSRC5;
        __IO uint16_t PCRC6;
        __IO uint16_t PFSRC6;
        __IO uint16_t PCRC7;
        __IO uint16_t PFSRC7;
        __IO uint16_t PCRC8;
        __IO uint16_t PFSRC8;
        __IO uint16_t PCRC9;
        __IO uint16_t PFSRC9;
        __IO uint16_t PCRC10;
        __IO uint16_t PFSRC10;
        __IO uint16_t PCRC11;
        __IO uint16_t PFSRC11;
        __IO uint16_t PCRC12;
        __IO uint16_t PFSRC12;
        __IO uint16_t PCRC13;
        __IO uint16_t PFSRC13;
        __IO uint16_t PCRC14;
        __IO uint16_t PFSRC14;
        __IO uint16_t PCRC15;
        __IO uint16_t PFSRC15;
        __IO uint16_t PCRD0;
        __IO uint16_t PFSRD0;
        __IO uint16_t PCRD1;
        __IO uint16_t PFSRD1;
        __IO uint16_t PCRD2;
        __IO uint16_t PFSRD2;
        __IO uint16_t PCRD3;
        __IO uint16_t PFSRD3;
        __IO uint16_t PCRD4;
        __IO uint16_t PFSRD4;
        __IO uint16_t PCRD5;
        __IO uint16_t PFSRD5;
        __IO uint16_t PCRD6;
        __IO uint16_t PFSRD6;
        __IO uint16_t PCRD7;
        __IO uint16_t PFSRD7;
        __IO uint16_t PCRD8;
        __IO uint16_t PFSRD8;
        __IO uint16_t PCRD9;
        __IO uint16_t PFSRD9;
        __IO uint16_t PCRD10;
        __IO uint16_t PFSRD10;
        __IO uint16_t PCRD11;
        __IO uint16_t PFSRD11;
        __IO uint16_t PCRD12;
        __IO uint16_t PFSRD12;
        __IO uint16_t PCRD13;
        __IO uint16_t PFSRD13;
        __IO uint16_t PCRD14;
        __IO uint16_t PFSRD14;
        __IO uint16_t PCRD15;
        __IO uint16_t PFSRD15;
        __IO uint16_t PCRE0;
        __IO uint16_t PFSRE0;
        __IO uint16_t PCRE1;
        __IO uint16_t PFSRE1;
        __IO uint16_t PCRE2;
        __IO uint16_t PFSRE2;
        __IO uint16_t PCRE3;
        __IO uint16_t PFSRE3;
        __IO uint16_t PCRE4;
        __IO uint16_t PFSRE4;
        __IO uint16_t PCRE5;
        __IO uint16_t PFSRE5;
        __IO uint16_t PCRE6;
        __IO uint16_t PFSRE6;
        __IO uint16_t PCRE7;
        __IO uint16_t PFSRE7;
        __IO uint16_t PCRE8;
        __IO uint16_t PFSRE8;
        __IO uint16_t PCRE9;
        __IO uint16_t PFSRE9;
        __IO uint16_t PCRE10;
        __IO uint16_t PFSRE10;
        __IO uint16_t PCRE11;
        __IO uint16_t PFSRE11;
        __IO uint16_t PCRE12;
        __IO uint16_t PFSRE12;
        __IO uint16_t PCRE13;
        __IO uint16_t PFSRE13;
        __IO uint16_t PCRE14;
        __IO uint16_t PFSRE14;
        __IO uint16_t PCRE15;
        __IO uint16_t PFSRE15;
        __IO uint16_t PCRF0;
        __IO uint16_t PFSRF0;
        __IO uint16_t PCRF1;
        __IO uint16_t PFSRF1;
        __IO uint16_t PCRF2;
        __IO uint16_t PFSRF2;
        __IO uint16_t PCRF3;
        __IO uint16_t PFSRF3;
        __IO uint16_t PCRF4;
        __IO uint16_t PFSRF4;
        __IO uint16_t PCRF5;
        __IO uint16_t PFSRF5;
        __IO uint16_t PCRF6;
        __IO uint16_t PFSRF6;
        __IO uint16_t PCRF7;
        __IO uint16_t PFSRF7;
        __IO uint16_t PCRF8;
        __IO uint16_t PFSRF8;
        __IO uint16_t PCRF9;
        __IO uint16_t PFSRF9;
        __IO uint16_t PCRF10;
        __IO uint16_t PFSRF10;
        __IO uint16_t PCRF11;
        __IO uint16_t PFSRF11;
        __IO uint16_t PCRF12;
        __IO uint16_t PFSRF12;
        __IO uint16_t PCRF13;
        __IO uint16_t PFSRF13;
        __IO uint16_t PCRF14;
        __IO uint16_t PFSRF14;
        __IO uint16_t PCRF15;
        __IO uint16_t PFSRF15;
        __IO uint16_t PCRG0;
        __IO uint16_t PFSRG0;
        __IO uint16_t PCRG1;
        __IO uint16_t PFSRG1;
        __IO uint16_t PCRG2;
        __IO uint16_t PFSRG2;
        __IO uint16_t PCRG3;
        __IO uint16_t PFSRG3;
        __IO uint16_t PCRG4;
        __IO uint16_t PFSRG4;
        __IO uint16_t PCRG5;
        __IO uint16_t PFSRG5;
        __IO uint16_t PCRG6;
        __IO uint16_t PFSRG6;
        __IO uint16_t PCRG7;
        __IO uint16_t PFSRG7;
        __IO uint16_t PCRG8;
        __IO uint16_t PFSRG8;
        __IO uint16_t PCRG9;
        __IO uint16_t PFSRG9;
        __IO uint16_t PCRG10;
        __IO uint16_t PFSRG10;
    } CM_GPIO_TypeDef;

    /**
     * @brief HASH
     */
    typedef struct
    {
        __IO uint32_t CR;
        uint8_t RESERVED0[12];
        __IO uint32_t HR7;
        __IO uint32_t HR6;
        __IO uint32_t HR5;
        __IO uint32_t HR4;
        __IO uint32_t HR3;
        __IO uint32_t HR2;
        __IO uint32_t HR1;
        __IO uint32_t HR0;
        uint8_t RESERVED1[16];
        __IO uint32_t DR15;
        __IO uint32_t DR14;
        __IO uint32_t DR13;
        __IO uint32_t DR12;
        __IO uint32_t DR11;
        __IO uint32_t DR10;
        __IO uint32_t DR9;
        __IO uint32_t DR8;
        __IO uint32_t DR7;
        __IO uint32_t DR6;
        __IO uint32_t DR5;
        __IO uint32_t DR4;
        __IO uint32_t DR3;
        __IO uint32_t DR2;
        __IO uint32_t DR1;
        __IO uint32_t DR0;
    } CM_HASH_TypeDef;

    /**
     * @brief HRPWM
     */
    typedef struct
    {
        __IO uint32_t CNTER;
        __IO uint32_t UPDAR;
        uint8_t RESERVED0[32];
        __IO uint32_t PHSCMP7A;
        __IO uint32_t PHSCMP7B;
        __IO uint32_t PHSCMP6A;
        __IO uint32_t PHSCMP6B;
        __IO uint32_t PHSCMP5A;
        __IO uint32_t PHSCMP5B;
        __IO uint32_t PHSCMP4A;
        __IO uint32_t PHSCMP4B;
        __IO uint32_t PHSCMP3A;
        __IO uint32_t PHSCMP3B;
        __IO uint32_t PHSCMP2A;
        __IO uint32_t PHSCMP2B;
        __IO uint32_t PHSCMP1A;
        __IO uint32_t PHSCMP1B;
        __IO uint32_t HRPERAR;
        __IO uint32_t HRPERBR;
        __IO uint32_t HRGCMAR;
        __IO uint32_t HRGCMCR;
        __IO uint32_t HRGCMBR;
        __IO uint32_t HRGCMDR;
        __IO uint32_t HRGCMER;
        __IO uint32_t HRGCMGR;
        __IO uint32_t HRGCMFR;
        __IO uint32_t HRGCMHR;
        __IO uint32_t SCMAR;
        __IO uint32_t SCMCR;
        __IO uint32_t SCMBR;
        __IO uint32_t SCMDR;
        __IO uint32_t CAPAR;
        __IO uint32_t CAPBR;
        __IO uint32_t HRDTUAR;
        __IO uint32_t HRDTUBR;
        __IO uint32_t HRDTDAR;
        __IO uint32_t HRDTDBR;
        __IO uint32_t EEFOFFSETAR;
        __IO uint32_t EEFOFFSETBR;
        __IO uint32_t EEFWINAR;
        __IO uint32_t EEFWINBR;
        __IO uint32_t VPERR;
        __IO uint32_t BVPERR;
        __IO uint32_t PCNAR1;
        __IO uint32_t BPCNAR1;
        __IO uint32_t PCNAR2;
        __IO uint32_t BPCNAR2;
        __IO uint32_t PCNAR3;
        __IO uint32_t BPCNAR3;
        union
        {
            __IO uint32_t PCNAR14;
            __IO uint32_t PCNAR24;
        };
        union
        {
            __IO uint32_t BPCNAR14;
            __IO uint32_t BPCNAR24;
        };
        union
        {
            __IO uint32_t PCNAR15;
            __IO uint32_t PCNAR25;
        };
        union
        {
            __IO uint32_t BPCNAR15;
            __IO uint32_t BPCNAR25;
        };
        __IO uint32_t PCNBR1;
        __IO uint32_t BPCNBR1;
        __IO uint32_t PCNBR2;
        __IO uint32_t BPCNBR2;
        __IO uint32_t PCNBR3;
        __IO uint32_t BPCNBR3;
        union
        {
            __IO uint32_t PCNBR14;
            __IO uint32_t PCNBR24;
        };
        union
        {
            __IO uint32_t BPCNBR14;
            __IO uint32_t BPCNBR24;
        };
        union
        {
            __IO uint32_t PCNBR15;
            __IO uint32_t PCNBR25;
        };
        union
        {
            __IO uint32_t BPCNBR15;
            __IO uint32_t BPCNBR25;
        };
        __IO uint32_t AOSEOUTSELR;
        __IO uint32_t BAOSEOUTSELR;
        __IO uint32_t ICONR;
        __IO uint32_t BICONR;
        __IO uint32_t DCONR;
        __IO uint32_t BDCONR;
        __IO uint32_t GCONR1;
        __IO uint32_t BGCONR1;
        uint8_t RESERVED1[44];
        __IO uint32_t GCONR;
        __IO uint32_t BCONR1;
        __IO uint32_t BCONR2;
        __IO uint32_t GBCR;
        __IO uint32_t GBCFG;
        __IO uint32_t IDLECR;
        __IO uint32_t CHPCR;
        __IO uint32_t STFLR1;
        __IO uint32_t STFLR2;
        __IO uint32_t HSTAR1;
        __IO uint32_t HSTAR2;
        __IO uint32_t HCLRR1;
        __IO uint32_t HCLRR2;
        __IO uint32_t HCPAR1;
        __IO uint32_t HCPAR2;
        __IO uint32_t HCPBR1;
        __IO uint32_t HCPBR2;
        __IO uint32_t EEFLTCR1;
        __IO uint32_t EEFLTCR2;
        __IO uint32_t EEFLTCR3;
        __IO uint32_t LINKCR1;
        __IO uint32_t CR;
        __IO uint32_t PHSCTL;
        __IO uint32_t LINKCR2;
        __IO uint32_t TRGCALDATR;
        __IO uint32_t UDIRCFG;
        __IO uint32_t DDIRCFG;
        __IO uint32_t TRIPOUTSEL;
        __IO uint32_t DECTL;
        __IO uint32_t DECOMPSEL;
        __IO uint32_t DEACTCTL;
        __IO uint32_t DESTAT;
        __IO uint32_t DEFRC;
        __IO uint32_t DECLR;
        __IO uint32_t DEMONCNT;
        __IO uint32_t DEMONCTL;
        __IO uint32_t DEMONSTEP;
        __IO uint32_t DEMONRHRES;
        __IO uint32_t MINDBCFG;
        __IO uint32_t MINDBDLY;
        __IO uint32_t LUTCTLA;
        __IO uint32_t LUTCTLB;
    } CM_HRPWM_TypeDef;

    /**
     * @brief HRPWM_COMMON
     */
    typedef struct
    {
        __IO uint32_t CALCR;
        uint8_t RESERVED0[108];
        __IO uint32_t GLAOSSELR7;
        __IO uint32_t GLAOSSELR6;
        __IO uint32_t GLAOSSELR5;
        __IO uint32_t GLAOSSELR4;
        __IO uint32_t GLAOSSELR3;
        __IO uint32_t GLAOSSELR2;
        __IO uint32_t GLAOSSELR1;
        __IO uint32_t GLAOSUR1;
        __IO uint32_t GLAOSUR2;
        __IO uint32_t GLAOSPSCR1;
        __IO uint32_t GLAOSPSCR2;
        __O uint32_t SFTSRR;
        __O uint32_t SCAPR;
        __O uint32_t SSTAIDLR;
        __IO uint32_t SSTARUNR1;
        __O uint32_t SSTARUNR2;
        __IO uint32_t SSTADIDLR;
        __IO uint32_t GCTLR;
        __IO uint32_t GBCONR;
        __IO uint32_t GBSFLR;
        __IO uint32_t BMCR;
        __IO uint32_t BMSTRG1;
        __IO uint32_t BMSTRG2;
        __IO uint32_t BMPERAR;
        __IO uint32_t BMPERBR;
        __IO uint32_t BMCMAR;
        __IO uint32_t BMCMBR;
        __IO uint32_t EECR1;
        __IO uint32_t EECR2;
        __IO uint32_t EECR3;
        __IO uint32_t SYNOCR;
        __IO uint32_t FCNTR;
        __IO uint32_t SSTAR;
        __O uint32_t SSTPR;
        __O uint32_t SCLRR;
        __O uint32_t SUPDR;
        __IO uint32_t BDUPR11;
        __IO uint32_t BDUPR12;
        __IO uint32_t BDUPR21;
        __IO uint32_t BDUPR22;
        __IO uint32_t BDUPR31;
        __IO uint32_t BDUPR32;
        __IO uint32_t BDUPR41;
        __IO uint32_t BDUPR42;
        __IO uint32_t BDUPR51;
        __IO uint32_t BDUPR52;
        __IO uint32_t BDUPR61;
        __IO uint32_t BDUPR62;
        __IO uint32_t BDUPR71;
        __IO uint32_t BDUPR72;
        __IO uint32_t BDUPR81;
        __IO uint32_t BDUPR82;
        uint8_t RESERVED1[8];
        __IO uint32_t BDMADR;
    } CM_HRPWM_COMMON_TypeDef;

    /**
     * @brief HRPWM_EMB
     */
    typedef struct
    {
        __IO uint32_t CTL1;
        __IO uint32_t CTL2;
        __IO uint32_t SOE;
        __I uint32_t STAT;
        __O uint32_t STATCLR;
        __IO uint32_t INTEN;
        __IO uint32_t RLSSEL;
        __IO uint32_t CTL3;
        __IO uint32_t CTL4;
        __IO uint32_t CTL5;
        __IO uint32_t CTL6;
    } CM_HRPWM_EMB_TypeDef;

    /**
     * @brief I2C
     */
    typedef struct
    {
        __IO uint32_t CR1;
        __IO uint32_t CR2;
        __IO uint32_t CR3;
        __IO uint32_t CR4;
        __IO uint32_t SLR0;
        __IO uint32_t SLR1;
        __IO uint32_t SLTR;
        __IO uint32_t SR;
        __O uint32_t CLR;
        __IO uint8_t DTR;
        uint8_t RESERVED0[3];
        __I uint8_t DRR;
        uint8_t RESERVED1[3];
        __IO uint32_t CCR;
        __IO uint32_t FLTR;
        __IO uint32_t FSTR;
        __IO uint32_t SLVADDR;
        __IO uint8_t PECDR;
        __IO uint8_t PECCR;
        uint8_t RESERVED2[2];
        __IO uint32_t SLR2;
        __IO uint8_t NBYTER;
        __IO uint8_t NBCR;
    } CM_I2C_TypeDef;

    /**
     * @brief ICG
     */
    typedef struct
    {
        __I uint32_t ICG0;
        __I uint32_t ICG1;
        uint8_t RESERVED0[4];
        __I uint32_t ICG3;
        uint8_t RESERVED1[80];
        __I uint32_t ICG8A;
        __I uint32_t ICG8B;
        __I uint32_t ICG8C;
    } CM_ICG_TypeDef;

    /**
     * @brief INTC
     */
    typedef struct
    {
        uint8_t RESERVED0[4];
        __IO uint32_t NMIER;
        __I uint32_t NMIFR;
        __O uint32_t NMIFCR;
        __IO uint32_t EIRQCR0;
        __IO uint32_t EIRQCR1;
        __IO uint32_t EIRQCR2;
        __IO uint32_t EIRQCR3;
        __IO uint32_t EIRQCR4;
        __IO uint32_t EIRQCR5;
        __IO uint32_t EIRQCR6;
        __IO uint32_t EIRQCR7;
        __IO uint32_t EIRQCR8;
        __IO uint32_t EIRQCR9;
        __IO uint32_t EIRQCR10;
        __IO uint32_t EIRQCR11;
        __IO uint32_t EIRQCR12;
        __IO uint32_t EIRQCR13;
        __IO uint32_t EIRQCR14;
        __IO uint32_t EIRQCR15;
        __IO uint32_t WKEN;
        __I uint32_t EIFR;
        __IO uint32_t EIFCR;
        __IO uint32_t INTSEL0;
        __IO uint32_t INTSEL1;
        __IO uint32_t INTSEL2;
        __IO uint32_t INTSEL3;
        __IO uint32_t INTSEL4;
        __IO uint32_t INTSEL5;
        __IO uint32_t INTSEL6;
        __IO uint32_t INTSEL7;
        __IO uint32_t INTSEL8;
        __IO uint32_t INTSEL9;
        __IO uint32_t INTSEL10;
        __IO uint32_t INTSEL11;
        __IO uint32_t INTSEL12;
        __IO uint32_t INTSEL13;
        __IO uint32_t INTSEL14;
        __IO uint32_t INTSEL15;
        uint8_t RESERVED1[448];
        __IO uint32_t INTEN0;
        __IO uint32_t INTEN1;
        __IO uint32_t INTEN2;
        __IO uint32_t INTEN3;
        __IO uint32_t INTEN4;
        __IO uint32_t INTEN5;
        __IO uint32_t INTEN6;
        __IO uint32_t INTEN7;
        __IO uint32_t INTEN8;
        __IO uint32_t INTEN9;
        __IO uint32_t INTEN10;
        __IO uint32_t INTEN11;
        __IO uint32_t INTEN12;
        __IO uint32_t INTEN13;
        __IO uint32_t INTEN14;
        __IO uint32_t INTEN15;
        __IO uint32_t SWIER;
        __IO uint32_t EVTER;
        __IO uint32_t IER;
        __IO uint32_t FPUIER;
    } CM_INTC_TypeDef;

    /**
     * @brief MCAN
     */
    typedef struct
    {
        uint8_t RESERVED0[4];
        __IO uint32_t ENDN;
        uint8_t RESERVED1[4];
        __IO uint32_t DBTP;
        __IO uint32_t TEST;
        __IO uint32_t RWD;
        __IO uint32_t CCCR;
        __IO uint32_t NBTP;
        __IO uint32_t TSCC;
        __IO uint32_t TSCV;
        __IO uint32_t TOCC;
        __IO uint32_t TOCV;
        uint8_t RESERVED2[16];
        __I uint32_t ECR;
        __I uint32_t PSR;
        __IO uint32_t TDCR;
        uint8_t RESERVED3[4];
        __IO uint32_t IR;
        __IO uint32_t IE;
        __IO uint32_t ILS;
        __IO uint32_t ILE;
        uint8_t RESERVED4[32];
        __IO uint32_t GFC;
        __IO uint32_t SIDFC;
        __IO uint32_t XIDFC;
        uint8_t RESERVED5[4];
        __IO uint32_t XIDAM;
        __I uint32_t HPMS;
        __IO uint32_t NDAT1;
        __IO uint32_t NDAT2;
        __IO uint32_t RXF0C;
        __I uint32_t RXF0S;
        __IO uint32_t RXF0A;
        __IO uint32_t RXBC;
        __IO uint32_t RXF1C;
        __I uint32_t RXF1S;
        __IO uint32_t RXF1A;
        __IO uint32_t RXESC;
        __IO uint32_t TXBC;
        __I uint32_t TXFQS;
        __IO uint32_t TXESC;
        __I uint32_t TXBRP;
        __IO uint32_t TXBAR;
        __IO uint32_t TXBCR;
        __I uint32_t TXBTO;
        __I uint32_t TXBCF;
        __IO uint32_t TXBTIE;
        __IO uint32_t TXBCIE;
        uint8_t RESERVED6[8];
        __IO uint32_t TXEFC;
        __I uint32_t TXEFS;
        __IO uint32_t TXEFA;
    } CM_MCAN_TypeDef;

    /**
     * @brief MCANRAM
     */
    typedef struct
    {
        __IO uint32_t CKCR;
        __IO uint32_t CKSR;
        __IO uint32_t EIEN;
        __IO uint32_t EIBIT0;
        __IO uint32_t EIBIT1;
        __I uint32_t ECCERRADDR;
    } CM_MCANRAM_TypeDef;

    /**
     * @brief MPU
     */
    typedef struct
    {
        __IO uint32_t RGD0;
        __IO uint32_t RGD1;
        __IO uint32_t RGD2;
        __IO uint32_t RGD3;
        __IO uint32_t RGD4;
        __IO uint32_t RGD5;
        __IO uint32_t RGD6;
        __IO uint32_t RGD7;
        __IO uint32_t RGD8;
        __IO uint32_t RGD9;
        __IO uint32_t RGD10;
        __IO uint32_t RGD11;
        __IO uint32_t RGD12;
        __IO uint32_t RGD13;
        __IO uint32_t RGD14;
        __IO uint32_t RGD15;
        __I uint32_t SR;
        __O uint32_t ECLR;
        __IO uint32_t WP;
        __IO uint32_t IPPR;
        __IO uint32_t S1RGE;
        __IO uint32_t S1RGWP;
        __IO uint32_t S1RGRP;
        __IO uint32_t S1CR;
        __IO uint32_t S2RGE;
        __IO uint32_t S2RGWP;
        __IO uint32_t S2RGRP;
        __IO uint32_t S2CR;
    } CM_MPU_TypeDef;

    /**
     * @brief OTS
     */
    typedef struct
    {
        __IO uint16_t CTL;
        uint8_t RESERVED0[6];
        __I uint16_t PDR0;
        uint8_t RESERVED1[2];
        __I uint32_t PDR1;
    } CM_OTS_TypeDef;

    /**
     * @brief PERIC
     */
    typedef struct
    {
        uint8_t RESERVED0[20];
        __IO uint32_t TMR_SYNENR;
        uint8_t RESERVED1[4];
        __IO uint32_t USART1_NFC;
        uint8_t RESERVED2[36];
        __IO uint32_t SPI1_NFC;
    } CM_PERIC_TypeDef;

    /**
     * @brief PID
     */
    typedef struct
    {
        __IO uint32_t CR;
        __IO uint32_t REF;
        __IO uint32_t AVAL;
        __IO uint32_t EMAX;
        __IO uint32_t EMIN;
        __IO uint32_t IMAX;
        __IO uint32_t IMIN;
        __IO uint32_t DMAX;
        __IO uint32_t DMIN;
        __IO uint32_t UMAX;
        __IO uint32_t UMIN;
        __IO uint32_t U1MAX;
        __IO uint32_t U1MIN;
        __IO uint32_t STA;
        __IO uint32_t CR2;
        __IO uint32_t KP1;
        __IO uint32_t KI1;
        __IO uint32_t KD1;
        __IO uint32_t KP2;
        __IO uint32_t KI2;
        __IO uint32_t KD2;
        __IO uint32_t KP3;
        __IO uint32_t KI3;
        __IO uint32_t KD3;
        __IO uint32_t KDF1;
        __IO uint32_t CSTH1;
        __IO uint32_t CSTH2;
        __IO uint32_t DLY1;
        __IO uint32_t DLY2;
        __I uint32_t ERR;
        __I uint32_t PVAL;
        __I uint32_t IVAL;
        __I uint32_t DVAL;
        __I uint32_t U;
        __I uint32_t U1;
        __I uint32_t U2;
        __I uint32_t U3;
        __I uint32_t U4;
        __IO uint32_t U1P1;
        __IO uint32_t U3P1;
        __IO uint32_t U4P1;
        __I uint32_t UF;
        __I uint32_t U1P2;
        __I uint32_t U3P2;
        __IO uint32_t U3P3;
        __I uint32_t U3P4;
        __IO uint32_t U5P1;
        __IO uint32_t U5P2;
        __IO uint32_t U3MAX;
        __IO uint32_t U3MIN;
        __IO uint32_t U5MAX;
        __IO uint32_t U5MIN;
        __IO uint32_t REF_FIN;
        __IO uint32_t REF_STEP;
        __I uint32_t U5;
        __I uint32_t U5F;
        __I uint32_t KF_ACT;
        __I uint32_t KP_ACT;
        __I uint32_t KI_ACT;
        __I uint32_t KD_ACT;
        __IO uint32_t KDF2;
        __IO uint32_t KDF3;
        __I uint32_t KDF_ACT;
    } CM_PID_TypeDef;

    /**
     * @brief PID_CMP
     */
    typedef struct
    {
        __IO uint32_t CR;
        __I uint32_t UC;
        __IO uint32_t CSTA;
        uint8_t RESERVED0[20];
        __IO uint32_t BTH;
        __I uint32_t BMCMP;
        __I uint32_t BMPU;
    } CM_PID_CMP_TypeDef;

