MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    /**
     * @brief PLA
     */
    typedef struct
    {
        __IO uint32_t GCTL;
        uint8_t RESERVED0[8];
        __I uint32_t STAT;
        __IO uint32_t MUXS0;
        __IO uint32_t LUTCTL0;
        __IO uint32_t CTL0;
        __IO uint32_t MUXS1;
        __IO uint32_t LUTCTL1;
        __IO uint32_t CTL1;
        __IO uint32_t MUXS2;
        __IO uint32_t LUTCTL2;
        __IO uint32_t CTL2;
        __IO uint32_t MUXS3;
        __IO uint32_t LUTCTL3;
        __IO uint32_t CTL3;
        __IO uint32_t MUXS4;
        __IO uint32_t LUTCTL4;
        __IO uint32_t CTL4;
        __IO uint32_t MUXS5;
        __IO uint32_t LUTCTL5;
        __IO uint32_t CTL5;
        __IO uint32_t MUXS6;
        __IO uint32_t LUTCTL6;
        __IO uint32_t CTL6;
        __IO uint32_t MUXS7;
        __IO uint32_t LUTCTL7;
        __IO uint32_t CTL7;
        __IO uint32_t MUXS8;
        __IO uint32_t LUTCTL8;
        __IO uint32_t CTL8;
        __IO uint32_t MUXS9;
        __IO uint32_t LUTCTL9;
        __IO uint32_t CTL9;
        __IO uint32_t MUXS10;
        __IO uint32_t LUTCTL10;
        __IO uint32_t CTL10;
        __IO uint32_t MUXS11;
        __IO uint32_t LUTCTL11;
        __IO uint32_t CTL11;
        __IO uint32_t MUXS12;
        __IO uint32_t LUTCTL12;
        __IO uint32_t CTL12;
        __IO uint32_t MUXS13;
        __IO uint32_t LUTCTL13;
        __IO uint32_t CTL13;
        __IO uint32_t MUXS14;
        __IO uint32_t LUTCTL14;
        __IO uint32_t CTL14;
        __IO uint32_t MUXS15;
        __IO uint32_t LUTCTL15;
        __IO uint32_t CTL15;
    } CM_PLA_TypeDef;

    /**
     * @brief PWC
     */
    typedef struct
    {
        __IO uint32_t FCG0;
        __IO uint32_t FCG1;
        __IO uint32_t FCG2;
        __IO uint32_t FCG3;
        __IO uint32_t FCG0PC;
        uint8_t RESERVED0[19440];
        __IO uint8_t PWRC1;
        uint8_t RESERVED1[11];
        __IO uint8_t PWRC4;
        uint8_t RESERVED2[3];
        __IO uint8_t PVDCR0;
        uint8_t RESERVED3[3];
        __IO uint8_t PVDCR1;
        uint8_t RESERVED4[3];
        __IO uint8_t PVDFCR;
        uint8_t RESERVED5[3];
        __IO uint8_t PVDLCR;
        uint8_t RESERVED6[35];
        __IO uint8_t PWRC6;
        uint8_t RESERVED7[155];
        __IO uint32_t RAMPC0;
        uint8_t RESERVED8[4];
        __IO uint32_t PRAMLPC;
        __IO uint16_t LPMCSR;
        __IO uint16_t LPMCSCR;
        __IO uint8_t PVDICR;
        uint8_t RESERVED9[3];
        __IO uint8_t PVDDSR;
        uint8_t RESERVED10[29463];
        __IO uint16_t STPMCR;
        uint8_t RESERVED11[1008];
        __IO uint16_t FPRC;
    } CM_PWC_TypeDef;

    /**
     * @brief RMU
     */
    typedef struct
    {
        uint8_t RESERVED0[192];
        __IO uint32_t FRST0;
        __IO uint32_t FRST1;
        __IO uint32_t FRST2;
        __IO uint32_t FRST3;
        uint8_t RESERVED1[40];
        __IO uint8_t PRSTCR0;
        uint8_t RESERVED2[3];
        __IO uint32_t RSTF0;
    } CM_RMU_TypeDef;

    /**
     * @brief SDFM
     */
    typedef struct
    {
        __IO uint32_t CH0CFGR1;
        __IO uint32_t CH0CFGR2;
        __IO uint32_t CH0AWSCDR;
        __I uint32_t CH0WDATAR;
        __IO uint32_t CH0DATINR;
        __IO uint32_t CH0DLYR;
        __IO uint32_t CH0HLTZ;
        uint8_t RESERVED0[4];
        __IO uint32_t CH1CFGR1;
        __IO uint32_t CH1CFGR2;
        __IO uint32_t CH1AWSCDR;
        __I uint32_t CH1WDATAR;
        __IO uint32_t CH1DATINR;
        __IO uint32_t CH1DLYR;
        __IO uint32_t CH1HLTZ;
        uint8_t RESERVED1[4];
        __IO uint32_t CH2CFGR1;
        __IO uint32_t CH2CFGR2;
        __IO uint32_t CH2AWSCDR;
        __I uint32_t CH2WDATAR;
        __IO uint32_t CH2DATINR;
        __IO uint32_t CH2DLYR;
        __IO uint32_t CH2HLTZ;
        uint8_t RESERVED2[4];
        __IO uint32_t CH3CFGR1;
        __IO uint32_t CH3CFGR2;
        __IO uint32_t CH3AWSCDR;
        __I uint32_t CH3WDATAR;
        __IO uint32_t CH3DATINR;
        __IO uint32_t CH3DLYR;
        __IO uint32_t CH3HLTZ;
        uint8_t RESERVED3[4];
        __IO uint32_t CH4CFGR1;
        __IO uint32_t CH4CFGR2;
        __IO uint32_t CH4AWSCDR;
        __I uint32_t CH4WDATAR;
        __IO uint32_t CH4DATINR;
        __IO uint32_t CH4DLYR;
        __IO uint32_t CH4HLTZ;
        uint8_t RESERVED4[4];
        __IO uint32_t CH5CFGR1;
        __IO uint32_t CH5CFGR2;
        __IO uint32_t CH5AWSCDR;
        __I uint32_t CH5WDATAR;
        __IO uint32_t CH5DATINR;
        __IO uint32_t CH5DLYR;
        __IO uint32_t CH5HLTZ;
        uint8_t RESERVED5[4];
        __IO uint32_t CH6CFGR1;
        __IO uint32_t CH6CFGR2;
        __IO uint32_t CH6AWSCDR;
        __I uint32_t CH6WDATAR;
        __IO uint32_t CH6DATINR;
        __IO uint32_t CH6DLYR;
        __IO uint32_t CH6HLTZ;
        uint8_t RESERVED6[4];
        __IO uint32_t CH7CFGR1;
        __IO uint32_t CH7CFGR2;
        __IO uint32_t CH7AWSCDR;
        __I uint32_t CH7WDATAR;
        __IO uint32_t CH7DATINR;
        __IO uint32_t CH7DLYR;
        __IO uint32_t CH7HLTZ;
        uint8_t RESERVED7[4];
        __IO uint32_t FLT0CR1;
        __IO uint32_t FLT0CR2;
        __I uint32_t FLT0ISR;
        __O uint32_t FLT0ICR;
        __IO uint32_t FLT0JCHGR;
        __IO uint32_t FLT0FCR;
        __I uint32_t FLT0JDATAR;
        __I uint32_t FLT0RDATAR;
        __IO uint32_t FLT0AWHTR;
        __IO uint32_t FLT0AWLTR;
        __I uint32_t FLT0AWSR;
        __O uint32_t FLT0AWCFR;
        __I uint32_t FLT0EXMAX;
        __I uint32_t FLT0EXMIN;
        __I uint32_t FLT0CNVTIMR;
        __IO uint32_t FLT0CNVTHRE;
        __IO uint32_t FLT0FIFOCTL;
        __I uint32_t FLT0DATFIFO;
        __IO uint32_t FLT0AWHT2;
        __IO uint32_t FLT0AWLT2;
        __IO uint32_t FLT0CPARM;
        __IO uint32_t FLT0EVTFITCTL;
        uint8_t RESERVED8[40];
        __IO uint32_t FLT1CR1;
        __IO uint32_t FLT1CR2;
        __I uint32_t FLT1ISR;
        __O uint32_t FLT1ICR;
        __IO uint32_t FLT1JCHGR;
        __IO uint32_t FLT1FCR;
        __I uint32_t FLT1JDATAR;
        __I uint32_t FLT1RDATAR;
        __IO uint32_t FLT1AWHTR;
        __IO uint32_t FLT1AWLTR;
        __I uint32_t FLT1AWSR;
        __O uint32_t FLT1AWCFR;
        __I uint32_t FLT1EXMAX;
        __I uint32_t FLT1EXMIN;
        __I uint32_t FLT1CNVTIMR;
        __IO uint32_t FLT1CNVTHRE;
        __IO uint32_t FLT1FIFOCTL;
        __I uint32_t FLT1DATFIFO;
        __IO uint32_t FLT1AWHT2;
        __IO uint32_t FLT1AWLT2;
        __IO uint32_t FLT1CPARM;
        __IO uint32_t FLT1EVTFITCTL;
        uint8_t RESERVED9[40];
        __IO uint32_t FLT2CR1;
        __IO uint32_t FLT2CR2;
        __I uint32_t FLT2ISR;
        __O uint32_t FLT2ICR;
        __IO uint32_t FLT2JCHGR;
        __IO uint32_t FLT2FCR;
        __I uint32_t FLT2JDATAR;
        __I uint32_t FLT2RDATAR;
        __IO uint32_t FLT2AWHTR;
        __IO uint32_t FLT2AWLTR;
        __I uint32_t FLT2AWSR;
        __O uint32_t FLT2AWCFR;
        __I uint32_t FLT2EXMAX;
        __I uint32_t FLT2EXMIN;
        __I uint32_t FLT2CNVTIMR;
        __IO uint32_t FLT2CNVTHRE;
        __IO uint32_t FLT2FIFOCTL;
        __I uint32_t FLT2DATFIFO;
        __IO uint32_t FLT2AWHT2;
        __IO uint32_t FLT2AWLT2;
        __IO uint32_t FLT2CPARM;
        __IO uint32_t FLT2EVTFITCTL;
        uint8_t RESERVED10[40];
        __IO uint32_t FLT3CR1;
        __IO uint32_t FLT3CR2;
        __I uint32_t FLT3ISR;
        __O uint32_t FLT3ICR;
        __IO uint32_t FLT3JCHGR;
        __IO uint32_t FLT3FCR;
        __I uint32_t FLT3JDATAR;
        __I uint32_t FLT3RDATAR;
        __IO uint32_t FLT3AWHTR;
        __IO uint32_t FLT3AWLTR;
        __I uint32_t FLT3AWSR;
        __O uint32_t FLT3AWCFR;
        __I uint32_t FLT3EXMAX;
        __I uint32_t FLT3EXMIN;
        __I uint32_t FLT3CNVTIMR;
        __IO uint32_t FLT3CNVTHRE;
        __IO uint32_t FLT3FIFOCTL;
        __I uint32_t FLT3DATFIFO;
        __IO uint32_t FLT3AWHT2;
        __IO uint32_t FLT3AWLT2;
        __IO uint32_t FLT3CPARM;
        __IO uint32_t FLT3EVTFITCTL;
    } CM_SDFM_TypeDef;

    /**
     * @brief SKE
     */
    typedef struct
    {
        __IO uint32_t CTRL;
        __IO uint32_t CFG;
        __IO uint32_t SR1;
        __IO uint32_t SR2;
        __O uint32_t KEY1;
        __O uint32_t KEY2;
        __O uint32_t KEY3;
        __O uint32_t KEY4;
        __O uint32_t KEY5;
        __O uint32_t KEY6;
        __O uint32_t KEY7;
        __O uint32_t KEY8;
        uint8_t RESERVED0[48];
        __IO uint32_t AAD1;
        __IO uint32_t AAD2;
        __IO uint32_t CLEN1;
        __IO uint32_t CLEN2;
        __IO uint32_t IV1;
        __IO uint32_t IV2;
        __IO uint32_t IV3;
        __IO uint32_t IV4;
        __IO uint32_t DIN_CR;
        uint8_t RESERVED1[12];
        __O uint32_t DIN1;
        __O uint32_t DIN2;
        __O uint32_t DIN3;
        __O uint32_t DIN4;
        uint8_t RESERVED2[16];
        __I uint32_t DOUT1;
        __I uint32_t DOUT2;
        __I uint32_t DOUT3;
        __I uint32_t DOUT4;
        uint8_t RESERVED3[60];
        __I uint32_t VERSION;
        uint8_t RESERVED4[160];
        __IO uint32_t MID_IV1;
        __IO uint32_t MID_IV2;
        __IO uint32_t MID_IV3;
        __IO uint32_t MID_IV4;
        __IO uint32_t MID_MAC1;
        __IO uint32_t MID_MAC2;
        __IO uint32_t MID_MAC3;
        __IO uint32_t MID_MAC4;
        __IO uint32_t TOTAL_AAD1;
        __IO uint32_t TOTAL_AAD2;
        __IO uint32_t TOTAL_CLEN1;
        __IO uint32_t TOTAL_CLEN2;
    } CM_SKE_TypeDef;

    /**
     * @brief SPI
     */
    typedef struct
    {
        __IO uint32_t DR;
        __IO uint32_t CR;
        uint8_t RESERVED0[4];
        __IO uint32_t CFG1;
        uint8_t RESERVED1[4];
        __IO uint32_t SR;
        __IO uint32_t CFG2;
    } CM_SPI_TypeDef;

    /**
     * @brief SRAMC
     */
    typedef struct
    {
        __IO uint32_t WTCR;
        __IO uint32_t WTPR;
        __IO uint32_t CKCR;
        __IO uint32_t CKPR;
        __IO uint32_t CKSR;
        __IO uint32_t SRAM1_EIEN;
        __IO uint32_t SRAM1_EIBIT0;
        __IO uint32_t SRAM1_EIBIT1;
        __IO uint32_t SRAM1_ECCERRADDR;
        uint8_t RESERVED0[16];
        __IO uint32_t SRAMH_EIEN;
        __IO uint32_t SRAMH_EIBIT0;
        __IO uint32_t SRAMH_EIBIT1;
        __IO uint32_t SRAMH_ECCERRADDR;
        __IO uint32_t CACHE_EIEN;
        __IO uint32_t CACHE_EIBIT0;
        __IO uint32_t CACHE_EIBIT1;
        __IO uint32_t CACHE_EIBIT2;
        __IO uint32_t CACHE_EIBIT3;
        __IO uint32_t CACHE_EIBIT4;
        __IO uint32_t CACHE_ECCERRADDR;
    } CM_SRAMC_TypeDef;

    /**
     * @brief SWDT
     */
    typedef struct
    {
        __IO uint32_t CR;
        __IO uint32_t SR;
        __IO uint32_t RR;
    } CM_SWDT_TypeDef;

    /**
     * @brief TMR0
     */
    typedef struct
    {
        __IO uint32_t CNTAR;
        __IO uint32_t CNTBR;
        __IO uint32_t CMPAR;
        __IO uint32_t CMPBR;
        __IO uint32_t BCONR;
        __IO uint32_t STFLR;
    } CM_TMR0_TypeDef;

    /**
     * @brief TMR6
     */
    typedef struct
    {
        __IO uint32_t CNTER;
        __IO uint32_t UPDAR;
        uint8_t RESERVED0[56];
        __IO uint32_t PERAR;
        __IO uint32_t PERBR;
        __IO uint32_t PERCR;
        uint8_t RESERVED1[52];
        __IO uint32_t GCMAR;
        __IO uint32_t GCMBR;
        __IO uint32_t GCMCR;
        __IO uint32_t GCMDR;
        __IO uint32_t GCMER;
        __IO uint32_t GCMFR;
        uint8_t RESERVED2[40];
        __IO uint32_t SCMAR;
        __IO uint32_t SCMBR;
        __IO uint32_t SCMCR;
        __IO uint32_t SCMDR;
        __IO uint32_t SCMER;
        __IO uint32_t SCMFR;
        uint8_t RESERVED3[40];
        __IO uint32_t DTUAR;
        __IO uint32_t DTDAR;
        __IO uint32_t DTUBR;
        __IO uint32_t DTDBR;
        uint8_t RESERVED4[48];
        __IO uint32_t GCONR;
        __IO uint32_t ICONR;
        __IO uint32_t BCONR;
        __IO uint32_t DCONR;
        uint8_t RESERVED5[4];
        __IO uint32_t PCNAR;
        __IO uint32_t PCNBR;
        __IO uint32_t FCNGR;
        __IO uint32_t VPERR;
        __IO uint32_t STFLR;
        uint8_t RESERVED6[24];
        __IO uint32_t HSTAR;
        __IO uint32_t HSTPR;
        __IO uint32_t HCLRR;
        __IO uint32_t HUPDR;
        __IO uint32_t HCPAR;
        __IO uint32_t HCPBR;
        __IO uint32_t HCUPR;
        __IO uint32_t HCDOR;
    } CM_TMR6_TypeDef;

    /**
     * @brief TMR6_COMMON
     */
    typedef struct
    {
        uint8_t RESERVED0[236];
        __IO uint32_t FCNTR;
        __IO uint32_t SSTAR;
        __IO uint32_t SSTPR;
        __IO uint32_t SCLRR;
        __IO uint32_t SUPDR;
    } CM_TMR6_COMMON_TypeDef;

    /**
     * @brief TRLPWM
     */
    typedef struct
    {
        __IO uint32_t CR;
        __I uint32_t BRAKESR;
        __I uint32_t ISR;
        __IO uint32_t ICR;
        __IO uint32_t IER;
        uint8_t RESERVED0[12];
        __IO uint32_t CTLLEG0;
        __IO uint32_t DLYLEG0;
        __IO uint32_t SRLEG0;
        __IO uint32_t MISCCTRL0;
        uint8_t RESERVED1[16];
        __IO uint32_t CTLLEG1;
        __IO uint32_t DLYLEG1;
        __IO uint32_t SRLEG1;
        __IO uint32_t MISCCTRL1;
        uint8_t RESERVED2[16];
        __IO uint32_t CTLLEG2;
        __IO uint32_t DLYLEG2;
        __IO uint32_t SRLEG2;
        __IO uint32_t MISCCTRL2;
        uint8_t RESERVED3[908];
        __IO uint32_t REVIDR;
    } CM_TRLPWM_TypeDef;

    /**
     * @brief TRNG
     */
    typedef struct
    {
        __IO uint32_t CR;
        __IO uint32_t MR;
        uint8_t RESERVED0[4];
        __I uint32_t DR0;
        __I uint32_t DR1;
    } CM_TRNG_TypeDef;

    /**
     * @brief USART
     */
    typedef struct
    {
        __I uint32_t SR;
        __IO uint16_t TDR;
        __I uint16_t RDR;
        __IO uint32_t BRR;
        __IO uint32_t CR1;
        __IO uint32_t CR2;
        __IO uint32_t CR3;
        __IO uint32_t PR;
        __I uint32_t LBMC;
    } CM_USART_TypeDef;

    /**
     * @brief VREF
     */
    typedef struct
    {
        __IO uint32_t BGRCR;
        __IO uint32_t CSCR;
        __IO uint32_t CR;
        uint8_t RESERVED0[500];
        __IO uint32_t SELV;
    } CM_VREF_TypeDef;

    /**
     * @brief WDT
     */
    typedef struct
    {
        __IO uint32_t CR;
        __IO uint32_t SR;
        __IO uint32_t RR;
    } CM_WDT_TypeDef;

    /**
     * @brief XBAR
     */
    typedef struct
    {
        __IO uint32_t HECR1;
        __IO uint32_t HECR2;
        __IO uint32_t HECR3;
        __IO uint32_t HECR4;
        __IO uint32_t HECR5;
        __IO uint32_t HECR6;
        __IO uint32_t HECR7;
        __IO uint32_t HECR8;
        __IO uint32_t HECR9;
        __IO uint32_t HECR10;
        uint8_t RESERVED0[8];
        __IO uint32_t MICR1;
        __IO uint32_t MICR2;
        __IO uint32_t MICR3;
        __IO uint32_t MICR4;
        __IO uint32_t MICR5;
        __IO uint32_t MICR6;
        __IO uint32_t MICR7;
        __IO uint32_t MICR8;
        __IO uint32_t MICR9;
        __IO uint32_t MICR10;
        __IO uint32_t MICR11;
        __IO uint32_t MICR12;
        __IO uint32_t MICR13;
        __IO uint32_t MICR14;
        __IO uint32_t MICR15;
        __IO uint32_t MICR16;
        __IO uint32_t HEBCR1;
        __IO uint32_t HEBCR2;
        __IO uint32_t HEBCR3;
        __IO uint32_t HEBCR4;
        __IO uint32_t HEBCR5;
        __IO uint32_t HEBCR6;
        __IO uint32_t HEBCR7;
        __IO uint32_t HEBCR8;
        uint8_t RESERVED1[16];
        __IO uint32_t TECR1;
        __IO uint32_t TECR2;
        __IO uint32_t TECR3;
        __IO uint32_t TECR4;
        __IO uint32_t TECR5;
        __IO uint32_t TECR6;
        uint8_t RESERVED2[8];
        __IO uint32_t TRLCR1;
        __IO uint32_t TRLCR2;
    } CM_XBAR_TypeDef;

/***************************************************************************** */
/* Memory Base Address */
/***************************************************************************** */
#define EFM_BASE  (0x00000000UL) /*!< EFM base address */
#define SRAM_BASE (0x1FFF8000UL) /*!< SRAM base address */

/***************************************************************************** */
/* Device Specific Peripheral Base Address */
/***************************************************************************** */
#define CM_ADC1_BASE         (0x40040000UL)
#define CM_ADC2_BASE         (0x40040400UL)
#define CM_ADC3_BASE         (0x40040800UL)
#define CM_ADC4_BASE         (0x40040C00UL)
#define CM_AOS_BASE          (0x40010800UL)
#define CM_CMP1_BASE         (0x4003B000UL)
#define CM_CMP2_BASE         (0x4003B100UL)
#define CM_CMP3_BASE         (0x4003B200UL)
#define CM_CMP4_BASE         (0x4003B300UL)
#define CM_CMP5_BASE         (0x4003B400UL)
#define CM_CMP6_BASE         (0x4003B500UL)
#define CM_CMP7_BASE         (0x4003B600UL)
#define CM_CMP8_BASE         (0x4003B700UL)
#define CM_CMU_BASE          (0x40048000UL)
#define CM_CORDIC_BASE       (0x40055000UL)
#define CM_CRC_BASE          (0x40008C00UL)
#define CM_CTC_BASE          (0x40049C00UL)
#define CM_DAC1_BASE         (0x40041000UL)
#define CM_DAC2_BASE         (0x40041400UL)
#define CM_DAC3_BASE         (0x40041800UL)
#define CM_DAC4_BASE         (0x40041C00UL)
#define CM_DBGC_BASE         (0xE0042000UL)
#define CM_DMA1_BASE         (0x40053000UL)
#define CM_DMA2_BASE         (0x40053400UL)
#define CM_DSOGI_PLL_BASE    (0x40020C00UL)
#define CM_EFM_BASE          (0x40010400UL)
#define CM_EMB0_BASE         (0x40038800UL)
#define CM_EMB1_BASE         (0x40038840UL)
#define CM_EMB2_BASE         (0x40038880UL)
#define CM_EMB3_BASE         (0x400388C0UL)
#define CM_EMB4_BASE         (0x40038900UL)
#define CM_EMB5_BASE         (0x40038940UL)
#define CM_ERMU_BASE         (0x40048800UL)
#define CM_FCM1_BASE         (0x40048400UL)
#define CM_FCM2_BASE         (0x40048440UL)
#define CM_FCM3_BASE         (0x40048480UL)
#define CM_FCM4_BASE         (0x400484C0UL)
#define CM_FCM_COM_BASE      (0x40048400UL)
#define CM_FMAC_BASE         (0x40058000UL)
#define CM_FMAC_ECC_BASE     (0x40058800UL)
#define CM_GPIO_BASE         (0x40053800UL)
#define CM_HASH_BASE         (0x40008400UL)
#define CM_HRPWM1_BASE       (0x40034000UL)
#define CM_HRPWM2_BASE       (0x40034400UL)
#define CM_HRPWM3_BASE       (0x40034800UL)
#define CM_HRPWM4_BASE       (0x40034C00UL)
#define CM_HRPWM5_BASE       (0x40035000UL)
#define CM_HRPWM6_BASE       (0x40035400UL)
#define CM_HRPWM7_BASE       (0x40035800UL)
#define CM_HRPWM8_BASE       (0x40035C00UL)
#define CM_HRPWM_COMMON_BASE (0x40036800UL)
#define CM_HRPWM_EMB1_BASE   (0x40036400UL)
#define CM_HRPWM_EMB2_BASE   (0x40036440UL)
#define CM_HRPWM_EMB3_BASE   (0x40036480UL)
#define CM_HRPWM_EMB4_BASE   (0x400364C0UL)
#define CM_HRPWM_EMB5_BASE   (0x40036500UL)
#define CM_HRPWM_EMB6_BASE   (0x40036540UL)
#define CM_HRPWM_EMB7_BASE   (0x40036580UL)
#define CM_HRPWM_EMB8_BASE   (0x400365C0UL)
#define CM_I2C1_BASE         (0x4004E000UL)
#define CM_I2C2_BASE         (0x4004E400UL)
#define CM_I2C3_BASE         (0x4004E800UL)
#define CM_ICG_BASE          (0x0300E000UL)
#define CM_INTC_BASE         (0x40051000UL)
#define CM_MCAN1_BASE        (0x4002B000UL)
#define CM_MCAN2_BASE        (0x4002B400UL)
#define CM_MCAN3_BASE        (0x4002B800UL)
#define CM_MCANRAM_BASE      (0x4002D800UL)
#define CM_MPU_BASE          (0x40050000UL)
#define CM_OTS_BASE          (0x4004A800UL)
#define CM_PERIC_BASE        (0x40055400UL)
#define CM_PID1_BASE         (0x40057000UL)
#define CM_PID2_BASE         (0x40057100UL)
#define CM_PID_CMP_BASE      (0x40057400UL)
#define CM_PLA_BASE          (0x4004FC00UL)
#define CM_PWC_BASE          (0x40048000UL)
#define CM_RMU_BASE          (0x4004CC00UL)
#define CM_SDFM_BASE         (0x4003A800UL)
#define CM_SKE_BASE          (0x4000E000UL)
#define CM_SPI1_BASE         (0x4001C000UL)
#define CM_SPI2_BASE         (0x4001C400UL)
#define CM_SPI3_BASE         (0x4001C800UL)
#define CM_SRAMC_BASE        (0x40050800UL)
#define CM_SWDT_BASE         (0x40049400UL)
#define CM_TMR0_1_BASE       (0x40024000UL)
#define CM_TMR0_2_BASE       (0x40024400UL)
#define CM_TMR6_1_BASE       (0x40018000UL)
#define CM_TMR6_2_BASE       (0x40018400UL)
#define CM_TMR6_3_BASE       (0x40018800UL)
#define CM_TMR6_4_BASE       (0x40018C00UL)
#define CM_TMR6_5_BASE       (0x40019000UL)
#define CM_TMR6_6_BASE       (0x40019400UL)
#define CM_TMR6_COMMON_BASE  (0x40018300UL)
#define CM_TRLPWM1_BASE      (0x4003A400UL)
#define CM_TRLPWM2_BASE      (0x4003AC00UL)
#define CM_TRNG_BASE         (0x40042000UL)
#define CM_USART1_BASE       (0x4001CC00UL)
#define CM_USART2_BASE       (0x4001D000UL)
#define CM_USART3_BASE       (0x4001D400UL)
#define CM_USART4_BASE       (0x4001D800UL)
#define CM_VREF_BASE         (0x4004F800UL)
#define CM_WDT_BASE          (0x40049000UL)
#define CM_XBAR_BASE         (0x40021000UL)

