MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/***************************************************************************** */
/* Device Specific Peripheral declaration & memory map */
/***************************************************************************** */
#define CM_ADC1         ((CM_ADC_TypeDef *)CM_ADC1_BASE)
#define CM_ADC2         ((CM_ADC_TypeDef *)CM_ADC2_BASE)
#define CM_ADC3         ((CM_ADC_TypeDef *)CM_ADC3_BASE)
#define CM_ADC4         ((CM_ADC_TypeDef *)CM_ADC4_BASE)
#define CM_AOS          ((CM_AOS_TypeDef *)CM_AOS_BASE)
#define CM_CMP1         ((CM_CMP_TypeDef *)CM_CMP1_BASE)
#define CM_CMP2         ((CM_CMP_TypeDef *)CM_CMP2_BASE)
#define CM_CMP3         ((CM_CMP_TypeDef *)CM_CMP3_BASE)
#define CM_CMP4         ((CM_CMP_TypeDef *)CM_CMP4_BASE)
#define CM_CMP5         ((CM_CMP_TypeDef *)CM_CMP5_BASE)
#define CM_CMP6         ((CM_CMP_TypeDef *)CM_CMP6_BASE)
#define CM_CMP7         ((CM_CMP_TypeDef *)CM_CMP7_BASE)
#define CM_CMP8         ((CM_CMP_TypeDef *)CM_CMP8_BASE)
#define CM_CMU          ((CM_CMU_TypeDef *)CM_CMU_BASE)
#define CM_CORDIC       ((CM_CORDIC_TypeDef *)CM_CORDIC_BASE)
#define CM_CRC          ((CM_CRC_TypeDef *)CM_CRC_BASE)
#define CM_CTC          ((CM_CTC_TypeDef *)CM_CTC_BASE)
#define CM_DAC1         ((CM_DAC_TypeDef *)CM_DAC1_BASE)
#define CM_DAC2         ((CM_DAC_TypeDef *)CM_DAC2_BASE)
#define CM_DAC3         ((CM_DAC_TypeDef *)CM_DAC3_BASE)
#define CM_DAC4         ((CM_DAC_TypeDef *)CM_DAC4_BASE)
#define CM_DBGC         ((CM_DBGC_TypeDef *)CM_DBGC_BASE)
#define CM_DMA1         ((CM_DMA_TypeDef *)CM_DMA1_BASE)
#define CM_DMA2         ((CM_DMA_TypeDef *)CM_DMA2_BASE)
#define CM_DSOGI_PLL    ((CM_DSOGI_PLL_TypeDef *)CM_DSOGI_PLL_BASE)
#define CM_EFM          ((CM_EFM_TypeDef *)CM_EFM_BASE)
#define CM_EMB0         ((CM_EMB_TypeDef *)CM_EMB0_BASE)
#define CM_EMB1         ((CM_EMB_TypeDef *)CM_EMB1_BASE)
#define CM_EMB2         ((CM_EMB_TypeDef *)CM_EMB2_BASE)
#define CM_EMB3         ((CM_EMB_TypeDef *)CM_EMB3_BASE)
#define CM_EMB4         ((CM_EMB_TypeDef *)CM_EMB4_BASE)
#define CM_EMB5         ((CM_EMB_TypeDef *)CM_EMB5_BASE)
#define CM_ERMU         ((CM_ERMU_TypeDef *)CM_ERMU_BASE)
#define CM_FCM1         ((CM_FCM_TypeDef *)CM_FCM1_BASE)
#define CM_FCM2         ((CM_FCM_TypeDef *)CM_FCM2_BASE)
#define CM_FCM3         ((CM_FCM_TypeDef *)CM_FCM3_BASE)
#define CM_FCM4         ((CM_FCM_TypeDef *)CM_FCM4_BASE)
#define CM_FCM_COM      ((CM_FCM_COM_TypeDef *)CM_FCM_COM_BASE)
#define CM_FMAC         ((CM_FMAC_TypeDef *)CM_FMAC_BASE)
#define CM_FMAC_ECC     ((CM_FMAC_ECC_TypeDef *)CM_FMAC_ECC_BASE)
#define CM_GPIO         ((CM_GPIO_TypeDef *)CM_GPIO_BASE)
#define CM_HASH         ((CM_HASH_TypeDef *)CM_HASH_BASE)
#define CM_HRPWM1       ((CM_HRPWM_TypeDef *)CM_HRPWM1_BASE)
#define CM_HRPWM2       ((CM_HRPWM_TypeDef *)CM_HRPWM2_BASE)
#define CM_HRPWM3       ((CM_HRPWM_TypeDef *)CM_HRPWM3_BASE)
#define CM_HRPWM4       ((CM_HRPWM_TypeDef *)CM_HRPWM4_BASE)
#define CM_HRPWM5       ((CM_HRPWM_TypeDef *)CM_HRPWM5_BASE)
#define CM_HRPWM6       ((CM_HRPWM_TypeDef *)CM_HRPWM6_BASE)
#define CM_HRPWM7       ((CM_HRPWM_TypeDef *)CM_HRPWM7_BASE)
#define CM_HRPWM8       ((CM_HRPWM_TypeDef *)CM_HRPWM8_BASE)
#define CM_HRPWM_COMMON ((CM_HRPWM_COMMON_TypeDef *)CM_HRPWM_COMMON_BASE)
#define CM_HRPWM_EMB1   ((CM_HRPWM_EMB_TypeDef *)CM_HRPWM_EMB1_BASE)
#define CM_HRPWM_EMB2   ((CM_HRPWM_EMB_TypeDef *)CM_HRPWM_EMB2_BASE)
#define CM_HRPWM_EMB3   ((CM_HRPWM_EMB_TypeDef *)CM_HRPWM_EMB3_BASE)
#define CM_HRPWM_EMB4   ((CM_HRPWM_EMB_TypeDef *)CM_HRPWM_EMB4_BASE)
#define CM_HRPWM_EMB5   ((CM_HRPWM_EMB_TypeDef *)CM_HRPWM_EMB5_BASE)
#define CM_HRPWM_EMB6   ((CM_HRPWM_EMB_TypeDef *)CM_HRPWM_EMB6_BASE)
#define CM_HRPWM_EMB7   ((CM_HRPWM_EMB_TypeDef *)CM_HRPWM_EMB7_BASE)
#define CM_HRPWM_EMB8   ((CM_HRPWM_EMB_TypeDef *)CM_HRPWM_EMB8_BASE)
#define CM_I2C1         ((CM_I2C_TypeDef *)CM_I2C1_BASE)
#define CM_I2C2         ((CM_I2C_TypeDef *)CM_I2C2_BASE)
#define CM_I2C3         ((CM_I2C_TypeDef *)CM_I2C3_BASE)
#define CM_ICG          ((CM_ICG_TypeDef *)CM_ICG_BASE)
#define CM_INTC         ((CM_INTC_TypeDef *)CM_INTC_BASE)
#define CM_MCAN1        ((CM_MCAN_TypeDef *)CM_MCAN1_BASE)
#define CM_MCAN2        ((CM_MCAN_TypeDef *)CM_MCAN2_BASE)
#define CM_MCAN3        ((CM_MCAN_TypeDef *)CM_MCAN3_BASE)
#define CM_MCANRAM      ((CM_MCANRAM_TypeDef *)CM_MCANRAM_BASE)
#define CM_MPU          ((CM_MPU_TypeDef *)CM_MPU_BASE)
#define CM_OTS          ((CM_OTS_TypeDef *)CM_OTS_BASE)
#define CM_PERIC        ((CM_PERIC_TypeDef *)CM_PERIC_BASE)
#define CM_PID1         ((CM_PID_TypeDef *)CM_PID1_BASE)
#define CM_PID2         ((CM_PID_TypeDef *)CM_PID2_BASE)
#define CM_PID_CMP      ((CM_PID_CMP_TypeDef *)CM_PID_CMP_BASE)
#define CM_PLA          ((CM_PLA_TypeDef *)CM_PLA_BASE)
#define CM_PWC          ((CM_PWC_TypeDef *)CM_PWC_BASE)
#define CM_RMU          ((CM_RMU_TypeDef *)CM_RMU_BASE)
#define CM_SDFM         ((CM_SDFM_TypeDef *)CM_SDFM_BASE)
#define CM_SKE          ((CM_SKE_TypeDef *)CM_SKE_BASE)
#define CM_SPI1         ((CM_SPI_TypeDef *)CM_SPI1_BASE)
#define CM_SPI2         ((CM_SPI_TypeDef *)CM_SPI2_BASE)
#define CM_SPI3         ((CM_SPI_TypeDef *)CM_SPI3_BASE)
#define CM_SRAMC        ((CM_SRAMC_TypeDef *)CM_SRAMC_BASE)
#define CM_SWDT         ((CM_SWDT_TypeDef *)CM_SWDT_BASE)
#define CM_TMR0_1       ((CM_TMR0_TypeDef *)CM_TMR0_1_BASE)
#define CM_TMR0_2       ((CM_TMR0_TypeDef *)CM_TMR0_2_BASE)
#define CM_TMR6_1       ((CM_TMR6_TypeDef *)CM_TMR6_1_BASE)
#define CM_TMR6_2       ((CM_TMR6_TypeDef *)CM_TMR6_2_BASE)
#define CM_TMR6_3       ((CM_TMR6_TypeDef *)CM_TMR6_3_BASE)
#define CM_TMR6_4       ((CM_TMR6_TypeDef *)CM_TMR6_4_BASE)
#define CM_TMR6_5       ((CM_TMR6_TypeDef *)CM_TMR6_5_BASE)
#define CM_TMR6_6       ((CM_TMR6_TypeDef *)CM_TMR6_6_BASE)
#define CM_TMR6_COMMON  ((CM_TMR6_COMMON_TypeDef *)CM_TMR6_COMMON_BASE)
#define CM_TRLPWM1      ((CM_TRLPWM_TypeDef *)CM_TRLPWM1_BASE)
#define CM_TRLPWM2      ((CM_TRLPWM_TypeDef *)CM_TRLPWM2_BASE)
#define CM_TRNG         ((CM_TRNG_TypeDef *)CM_TRNG_BASE)
#define CM_USART1       ((CM_USART_TypeDef *)CM_USART1_BASE)
#define CM_USART2       ((CM_USART_TypeDef *)CM_USART2_BASE)
#define CM_USART3       ((CM_USART_TypeDef *)CM_USART3_BASE)
#define CM_USART4       ((CM_USART_TypeDef *)CM_USART4_BASE)
#define CM_VREF         ((CM_VREF_TypeDef *)CM_VREF_BASE)
#define CM_WDT          ((CM_WDT_TypeDef *)CM_WDT_BASE)
#define CM_XBAR         ((CM_XBAR_TypeDef *)CM_XBAR_BASE)

/***************************************************************************** */
/* Peripheral Registers Bits Definition */
/***************************************************************************** */

