MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral ADC
 *******************************************************************************/
/* Bit definition for ADC_STR register */
#define ADC_STR_STRT (0x01U)

/* Bit definition for ADC_CR0 register */
#define ADC_CR0_MS_POS     (0U)
#define ADC_CR0_MS         (0x000FU)
#define ADC_CR0_ACCSEL_POS (4U)
#define ADC_CR0_ACCSEL     (0x0030U)
#define ADC_CR0_ACCSEL_0   (0x0010U)
#define ADC_CR0_ACCSEL_1   (0x0020U)
#define ADC_CR0_CLREN_POS  (6U)
#define ADC_CR0_CLREN      (0x0040U)
#define ADC_CR0_DFMT_POS   (7U)
#define ADC_CR0_DFMT       (0x0080U)
#define ADC_CR0_AVCNT_POS  (8U)
#define ADC_CR0_AVCNT      (0x0700U)

/* Bit definition for ADC_CR1 register */
#define ADC_CR1_RSCHSEL_POS (2U)
#define ADC_CR1_RSCHSEL     (0x0004U)

/* Bit definition for ADC_CR2 register */
#define ADC_CR2_ADDIS_POS  (0U)
#define ADC_CR2_ADDIS      (0x001FU)
#define ADC_CR2_OVSS_POS   (8U)
#define ADC_CR2_OVSS       (0x0F00U)
#define ADC_CR2_OVSMOD_POS (12U)
#define ADC_CR2_OVSMOD     (0x1000U)

/* Bit definition for ADC_CHSELRA register */
#define ADC_CHSELRA_CHSELA (0x3FFFFFFFUL)

/* Bit definition for ADC_CHSELRB register */
#define ADC_CHSELRB_CHSELB (0x3FFFFFFFUL)

/* Bit definition for ADC_AVCHSELR register */
#define ADC_AVCHSELR_AVCHSEL (0x3FFFFFFFUL)

/* Bit definition for ADC_TRGSR register */
#define ADC_TRGSR_TRGSELA_POS (0U)
#define ADC_TRGSR_TRGSELA     (0x00000007UL)
#define ADC_TRGSR_TRGENA_POS  (7U)
#define ADC_TRGSR_TRGENA      (0x00000080UL)
#define ADC_TRGSR_TRGSELB_POS (8U)
#define ADC_TRGSR_TRGSELB     (0x00000700UL)
#define ADC_TRGSR_TRGENB_POS  (15U)
#define ADC_TRGSR_TRGENB      (0x00008000UL)
#define ADC_TRGSR_TRGSELC_POS (16U)
#define ADC_TRGSR_TRGSELC     (0x00070000UL)
#define ADC_TRGSR_TRGENC_POS  (23U)
#define ADC_TRGSR_TRGENC      (0x00800000UL)

/* Bit definition for ADC_SSTR0 register */
#define ADC_SSTR0 (0xFFU)

/* Bit definition for ADC_SSTR1 register */
#define ADC_SSTR1 (0xFFU)

/* Bit definition for ADC_SSTR2 register */
#define ADC_SSTR2 (0xFFU)

/* Bit definition for ADC_SSTR3 register */
#define ADC_SSTR3 (0xFFU)

/* Bit definition for ADC_SSTR4 register */
#define ADC_SSTR4 (0xFFU)

/* Bit definition for ADC_SSTR5 register */
#define ADC_SSTR5 (0xFFU)

/* Bit definition for ADC_SSTR6 register */
#define ADC_SSTR6 (0xFFU)

/* Bit definition for ADC_SSTR7 register */
#define ADC_SSTR7 (0xFFU)

/* Bit definition for ADC_SSTR8 register */
#define ADC_SSTR8 (0xFFU)

/* Bit definition for ADC_SSTR9 register */
#define ADC_SSTR9 (0xFFU)

/* Bit definition for ADC_SSTR10 register */
#define ADC_SSTR10 (0xFFU)

/* Bit definition for ADC_SSTR11 register */
#define ADC_SSTR11 (0xFFU)

/* Bit definition for ADC_SSTR12 register */
#define ADC_SSTR12 (0xFFU)

/* Bit definition for ADC_SSTR13 register */
#define ADC_SSTR13 (0xFFU)

/* Bit definition for ADC_SSTR14 register */
#define ADC_SSTR14 (0xFFU)

/* Bit definition for ADC_SSTR15 register */
#define ADC_SSTR15 (0xFFU)

/* Bit definition for ADC_SSTRL register */
#define ADC_SSTRL (0xFFU)

/* Bit definition for ADC_DIFCHSELR register */
#define ADC_DIFCHSELR_DIFCHSEL   (0x0000001FUL)
#define ADC_DIFCHSELR_DIFCHSEL_0 (0x00000001UL)
#define ADC_DIFCHSELR_DIFCHSEL_1 (0x00000002UL)
#define ADC_DIFCHSELR_DIFCHSEL_2 (0x00000004UL)
#define ADC_DIFCHSELR_DIFCHSEL_3 (0x00000008UL)
#define ADC_DIFCHSELR_DIFCHSEL_4 (0x00000010UL)

/* Bit definition for ADC_CHMUXR0 register */
#define ADC_CHMUXR0_CH00MUX_POS (0U)
#define ADC_CHMUXR0_CH00MUX     (0x000FU)
#define ADC_CHMUXR0_CH01MUX_POS (4U)
#define ADC_CHMUXR0_CH01MUX     (0x00F0U)
#define ADC_CHMUXR0_CH02MUX_POS (8U)
#define ADC_CHMUXR0_CH02MUX     (0x0F00U)
#define ADC_CHMUXR0_CH03MUX_POS (12U)
#define ADC_CHMUXR0_CH03MUX     (0xF000U)

/* Bit definition for ADC_CHMUXR1 register */
#define ADC_CHMUXR1_CH04MUX_POS (0U)
#define ADC_CHMUXR1_CH04MUX     (0x000FU)
#define ADC_CHMUXR1_CH05MUX_POS (4U)
#define ADC_CHMUXR1_CH05MUX     (0x00F0U)
#define ADC_CHMUXR1_CH06MUX_POS (8U)
#define ADC_CHMUXR1_CH06MUX     (0x0F00U)
#define ADC_CHMUXR1_CH07MUX_POS (12U)
#define ADC_CHMUXR1_CH07MUX     (0xF000U)

/* Bit definition for ADC_CHMUXR2 register */
#define ADC_CHMUXR2_CH08MUX_POS (0U)
#define ADC_CHMUXR2_CH08MUX     (0x000FU)
#define ADC_CHMUXR2_CH09MUX_POS (4U)
#define ADC_CHMUXR2_CH09MUX     (0x00F0U)
#define ADC_CHMUXR2_CH10MUX_POS (8U)
#define ADC_CHMUXR2_CH10MUX     (0x0F00U)
#define ADC_CHMUXR2_CH11MUX_POS (12U)
#define ADC_CHMUXR2_CH11MUX     (0xF000U)

/* Bit definition for ADC_CHMUXR3 register */
#define ADC_CHMUXR3_CH12MUX_POS (0U)
#define ADC_CHMUXR3_CH12MUX     (0x000FU)
#define ADC_CHMUXR3_CH13MUX_POS (4U)
#define ADC_CHMUXR3_CH13MUX     (0x00F0U)
#define ADC_CHMUXR3_CH14MUX_POS (8U)
#define ADC_CHMUXR3_CH14MUX     (0x0F00U)
#define ADC_CHMUXR3_CH15MUX_POS (12U)
#define ADC_CHMUXR3_CH15MUX     (0xF000U)

/* Bit definition for ADC_CHSELRC register */
#define ADC_CHSELRC_CHSELC (0x3FFFFFFFUL)

/* Bit definition for ADC_ISR register */
#define ADC_ISR_EOCAF_POS   (0U)
#define ADC_ISR_EOCAF       (0x01U)
#define ADC_ISR_EOCBF_POS   (1U)
#define ADC_ISR_EOCBF       (0x02U)
#define ADC_ISR_EOCCF_POS   (2U)
#define ADC_ISR_EOCCF       (0x04U)
#define ADC_ISR_SASTPDF_POS (4U)
#define ADC_ISR_SASTPDF     (0x10U)
#define ADC_ISR_SBSTPDF_POS (5U)
#define ADC_ISR_SBSTPDF     (0x20U)

/* Bit definition for ADC_ICR register */
#define ADC_ICR_EOCAIEN_POS (0U)
#define ADC_ICR_EOCAIEN     (0x01U)
#define ADC_ICR_EOCBIEN_POS (1U)
#define ADC_ICR_EOCBIEN     (0x02U)
#define ADC_ICR_EOCCIEN_POS (2U)
#define ADC_ICR_EOCCIEN     (0x04U)

/* Bit definition for ADC_ISCLRR register */
#define ADC_ISCLRR_CLREOCAF_POS   (0U)
#define ADC_ISCLRR_CLREOCAF       (0x01U)
#define ADC_ISCLRR_CLREOCBF_POS   (1U)
#define ADC_ISCLRR_CLREOCBF       (0x02U)
#define ADC_ISCLRR_CLREOCCF_POS   (2U)
#define ADC_ISCLRR_CLREOCCF       (0x04U)
#define ADC_ISCLRR_CLRSASTPDF_POS (4U)
#define ADC_ISCLRR_CLRSASTPDF     (0x10U)
#define ADC_ISCLRR_CLRSBSTPDF_POS (5U)
#define ADC_ISCLRR_CLRSBSTPDF     (0x20U)

/* Bit definition for ADC_SYNCCR register */
#define ADC_SYNCCR_SYNCEN_POS  (0U)
#define ADC_SYNCCR_SYNCEN      (0x0001U)
#define ADC_SYNCCR_SYNCMD_POS  (4U)
#define ADC_SYNCCR_SYNCMD      (0x00F0U)
#define ADC_SYNCCR_SYNCDLY_POS (8U)
#define ADC_SYNCCR_SYNCDLY     (0xFF00U)

/* Bit definition for ADC_DR0 register */
#define ADC_DR0 (0xFFFFU)

