MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for ADC_DR1 register */
#define ADC_DR1 (0xFFFFU)

/* Bit definition for ADC_DR2 register */
#define ADC_DR2 (0xFFFFU)

/* Bit definition for ADC_DR3 register */
#define ADC_DR3 (0xFFFFU)

/* Bit definition for ADC_DR4 register */
#define ADC_DR4 (0xFFFFU)

/* Bit definition for ADC_DR5 register */
#define ADC_DR5 (0xFFFFU)

/* Bit definition for ADC_DR6 register */
#define ADC_DR6 (0xFFFFU)

/* Bit definition for ADC_DR7 register */
#define ADC_DR7 (0xFFFFU)

/* Bit definition for ADC_DR8 register */
#define ADC_DR8 (0xFFFFU)

/* Bit definition for ADC_DR9 register */
#define ADC_DR9 (0xFFFFU)

/* Bit definition for ADC_DR10 register */
#define ADC_DR10 (0xFFFFU)

/* Bit definition for ADC_DR11 register */
#define ADC_DR11 (0xFFFFU)

/* Bit definition for ADC_DR12 register */
#define ADC_DR12 (0xFFFFU)

/* Bit definition for ADC_DR13 register */
#define ADC_DR13 (0xFFFFU)

/* Bit definition for ADC_DR14 register */
#define ADC_DR14 (0xFFFFU)

/* Bit definition for ADC_DR15 register */
#define ADC_DR15 (0xFFFFU)

/* Bit definition for ADC_DR16 register */
#define ADC_DR16 (0xFFFFU)

/* Bit definition for ADC_DR17 register */
#define ADC_DR17 (0xFFFFU)

/* Bit definition for ADC_DR18 register */
#define ADC_DR18 (0xFFFFU)

/* Bit definition for ADC_DR19 register */
#define ADC_DR19 (0xFFFFU)

/* Bit definition for ADC_DR20 register */
#define ADC_DR20 (0xFFFFU)

/* Bit definition for ADC_DR21 register */
#define ADC_DR21 (0xFFFFU)

/* Bit definition for ADC_DR22 register */
#define ADC_DR22 (0xFFFFU)

/* Bit definition for ADC_DR23 register */
#define ADC_DR23 (0xFFFFU)

/* Bit definition for ADC_DR25 register */
#define ADC_DR25 (0xFFFFU)

/* Bit definition for ADC_DR26 register */
#define ADC_DR26 (0xFFFFU)

/* Bit definition for ADC_DR27 register */
#define ADC_DR27 (0xFFFFU)

/* Bit definition for ADC_DR28 register */
#define ADC_DR28 (0xFFFFU)

/* Bit definition for ADC_DR29 register */
#define ADC_DR29 (0xFFFFU)

/* Bit definition for ADC_AWDCR register */
#define ADC_AWDCR_AWD0EN_POS  (0U)
#define ADC_AWDCR_AWD0EN      (0x0001U)
#define ADC_AWDCR_AWD0IEN_POS (1U)
#define ADC_AWDCR_AWD0IEN     (0x0002U)
#define ADC_AWDCR_AWD0MD_POS  (2U)
#define ADC_AWDCR_AWD0MD      (0x0004U)
#define ADC_AWDCR_AWD1EN_POS  (4U)
#define ADC_AWDCR_AWD1EN      (0x0010U)
#define ADC_AWDCR_AWD1IEN_POS (5U)
#define ADC_AWDCR_AWD1IEN     (0x0020U)
#define ADC_AWDCR_AWD1MD_POS  (6U)
#define ADC_AWDCR_AWD1MD      (0x0040U)
#define ADC_AWDCR_AWDCM_POS   (8U)
#define ADC_AWDCR_AWDCM       (0x0300U)
#define ADC_AWDCR_AWDCM_0     (0x0100U)
#define ADC_AWDCR_AWDCM_1     (0x0200U)
#define ADC_AWDCR_AWDFLT_POS  (12U)
#define ADC_AWDCR_AWDFLT      (0x7000U)

/* Bit definition for ADC_AWDSR register */
#define ADC_AWDSR_AWD0F_POS  (0U)
#define ADC_AWDSR_AWD0F      (0x01U)
#define ADC_AWDSR_AWD1F_POS  (1U)
#define ADC_AWDSR_AWD1F      (0x02U)
#define ADC_AWDSR_AWDCMF_POS (4U)
#define ADC_AWDSR_AWDCMF     (0x10U)

/* Bit definition for ADC_AWDSCLRR register */
#define ADC_AWDSCLRR_CLRAWD0F_POS  (0U)
#define ADC_AWDSCLRR_CLRAWD0F      (0x01U)
#define ADC_AWDSCLRR_CLRAWD1F_POS  (1U)
#define ADC_AWDSCLRR_CLRAWD1F      (0x02U)
#define ADC_AWDSCLRR_CLRAWDCMF_POS (4U)
#define ADC_AWDSCLRR_CLRAWDCMF     (0x10U)

/* Bit definition for ADC_AWD0DR0 register */
#define ADC_AWD0DR0 (0xFFFFU)

/* Bit definition for ADC_AWD0DR1 register */
#define ADC_AWD0DR1 (0xFFFFU)

/* Bit definition for ADC_AWD0CHSR register */
#define ADC_AWD0CHSR_AWDCH (0x1FU)

/* Bit definition for ADC_AWD1DR0 register */
#define ADC_AWD1DR0 (0xFFFFU)

/* Bit definition for ADC_AWD1DR1 register */
#define ADC_AWD1DR1 (0xFFFFU)

/* Bit definition for ADC_AWD1CHSR register */
#define ADC_AWD1CHSR_AWDCH (0x1FU)

/* Bit definition for ADC_OFR register */
#define ADC_OFR_OFFSET_POS    (0U)
#define ADC_OFR_OFFSET        (0x00000FFFUL)
#define ADC_OFR_OFFSETCH_POS  (16U)
#define ADC_OFR_OFFSETCH      (0x001F0000UL)
#define ADC_OFR_OFFSETPOS_POS (24U)
#define ADC_OFR_OFFSETPOS     (0x01000000UL)
#define ADC_OFR_SATEN_POS     (25U)
#define ADC_OFR_SATEN         (0x02000000UL)
#define ADC_OFR_OFFSETEN_POS  (31U)
#define ADC_OFR_OFFSETEN      (0x80000000UL)

/* Bit definition for ADC_FDR0 register */
#define ADC_FDR0 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR1 register */
#define ADC_FDR1 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR2 register */
#define ADC_FDR2 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR3 register */
#define ADC_FDR3 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR4 register */
#define ADC_FDR4 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR5 register */
#define ADC_FDR5 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR6 register */
#define ADC_FDR6 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR7 register */
#define ADC_FDR7 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR8 register */
#define ADC_FDR8 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR9 register */
#define ADC_FDR9 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR10 register */
#define ADC_FDR10 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR11 register */
#define ADC_FDR11 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR12 register */
#define ADC_FDR12 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR13 register */
#define ADC_FDR13 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR14 register */
#define ADC_FDR14 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR15 register */
#define ADC_FDR15 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR16 register */
#define ADC_FDR16 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR17 register */
#define ADC_FDR17 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR18 register */
#define ADC_FDR18 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR19 register */
#define ADC_FDR19 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR20 register */
#define ADC_FDR20 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR21 register */
#define ADC_FDR21 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR22 register */
#define ADC_FDR22 (0xFFFFFFFFUL)

/* Bit definition for ADC_FDR23 register */
#define ADC_FDR23 (0xFFFFFFFFUL)

