MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral AOS
 *******************************************************************************/
/* Bit definition for AOS_INTSFTTRG register */
#define AOS_INTSFTTRG_STRG (0x00000001UL)

/* Bit definition for AOS_DMA1_TRGSEL register */
#define AOS_DMA1_TRGSEL_TRGSEL_POS (0U)
#define AOS_DMA1_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_DMA1_TRGSEL_COMEN_POS  (30U)
#define AOS_DMA1_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_DMA1_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_DMA1_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_DMA2_TRGSEL register */
#define AOS_DMA2_TRGSEL_TRGSEL_POS (0U)
#define AOS_DMA2_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_DMA2_TRGSEL_COMEN_POS  (30U)
#define AOS_DMA2_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_DMA2_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_DMA2_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_DMA_RC_TRGSEL register */
#define AOS_DMA_RC_TRGSEL_TRGSEL_POS (0U)
#define AOS_DMA_RC_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_DMA_RC_TRGSEL_COMEN_POS  (30U)
#define AOS_DMA_RC_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_DMA_RC_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_DMA_RC_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_TMR6_TRGSEL register */
#define AOS_TMR6_TRGSEL_TRGSEL_POS (0U)
#define AOS_TMR6_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_TMR6_TRGSEL_COMEN_POS  (30U)
#define AOS_TMR6_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_TMR6_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_TMR6_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_TRLPWM_TRGSEL register */
#define AOS_TRLPWM_TRGSEL_TRGSEL_POS (0U)
#define AOS_TRLPWM_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_TRLPWM_TRGSEL_COMEN_POS  (30U)
#define AOS_TRLPWM_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_TRLPWM_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_TRLPWM_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_HRPWM_TRGSEL register */
#define AOS_HRPWM_TRGSEL_TRGSEL_POS (0U)
#define AOS_HRPWM_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_HRPWM_TRGSEL_COMEN_POS  (30U)
#define AOS_HRPWM_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_HRPWM_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_HRPWM_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_PEVNT_TRGSEL12 register */
#define AOS_PEVNT_TRGSEL12_TRGSEL_POS (0U)
#define AOS_PEVNT_TRGSEL12_TRGSEL     (0x000001FFUL)
#define AOS_PEVNT_TRGSEL12_COMEN_POS  (30U)
#define AOS_PEVNT_TRGSEL12_COMEN      (0xC0000000UL)
#define AOS_PEVNT_TRGSEL12_COMEN_0    (0x40000000UL)
#define AOS_PEVNT_TRGSEL12_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_PEVNT_TRGSEL34 register */
#define AOS_PEVNT_TRGSEL34_TRGSEL_POS (0U)
#define AOS_PEVNT_TRGSEL34_TRGSEL     (0x000001FFUL)
#define AOS_PEVNT_TRGSEL34_COMEN_POS  (30U)
#define AOS_PEVNT_TRGSEL34_COMEN      (0xC0000000UL)
#define AOS_PEVNT_TRGSEL34_COMEN_0    (0x40000000UL)
#define AOS_PEVNT_TRGSEL34_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_TMR0_TRGSEL register */
#define AOS_TMR0_TRGSEL_TRGSEL_POS (0U)
#define AOS_TMR0_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_TMR0_TRGSEL_COMEN_POS  (30U)
#define AOS_TMR0_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_TMR0_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_TMR0_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_HASH_TRGSELB register */
#define AOS_HASH_TRGSELB_TRGSEL_POS (0U)
#define AOS_HASH_TRGSELB_TRGSEL     (0x000001FFUL)
#define AOS_HASH_TRGSELB_COMEN_POS  (30U)
#define AOS_HASH_TRGSELB_COMEN      (0xC0000000UL)
#define AOS_HASH_TRGSELB_COMEN_0    (0x40000000UL)
#define AOS_HASH_TRGSELB_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_HASH_TRGSELA register */
#define AOS_HASH_TRGSELA_TRGSEL_POS (0U)
#define AOS_HASH_TRGSELA_TRGSEL     (0x000001FFUL)
#define AOS_HASH_TRGSELA_COMEN_POS  (30U)
#define AOS_HASH_TRGSELA_COMEN      (0xC0000000UL)
#define AOS_HASH_TRGSELA_COMEN_0    (0x40000000UL)
#define AOS_HASH_TRGSELA_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_SOGI_TRGSEL register */
#define AOS_SOGI_TRGSEL_TRGSEL_POS (0U)
#define AOS_SOGI_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_SOGI_TRGSEL_COMEN_POS  (30U)
#define AOS_SOGI_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_SOGI_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_SOGI_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_ADC1_TRGSEL register */
#define AOS_ADC1_TRGSEL_TRGSEL_POS (0U)
#define AOS_ADC1_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_ADC1_TRGSEL_COMEN_POS  (30U)
#define AOS_ADC1_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_ADC1_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_ADC1_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_ADC2_TRGSEL register */
#define AOS_ADC2_TRGSEL_TRGSEL_POS (0U)
#define AOS_ADC2_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_ADC2_TRGSEL_COMEN_POS  (30U)
#define AOS_ADC2_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_ADC2_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_ADC2_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_ADC3_TRGSEL register */
#define AOS_ADC3_TRGSEL_TRGSEL_POS (0U)
#define AOS_ADC3_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_ADC3_TRGSEL_COMEN_POS  (30U)
#define AOS_ADC3_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_ADC3_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_ADC3_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_ADC4_TRGSEL register */
#define AOS_ADC4_TRGSEL_TRGSEL_POS (0U)
#define AOS_ADC4_TRGSEL_TRGSEL     (0x000001FFUL)
#define AOS_ADC4_TRGSEL_COMEN_POS  (30U)
#define AOS_ADC4_TRGSEL_COMEN      (0xC0000000UL)
#define AOS_ADC4_TRGSEL_COMEN_0    (0x40000000UL)
#define AOS_ADC4_TRGSEL_COMEN_1    (0x80000000UL)

/* Bit definition for AOS_COMTRGSEL1 register */
#define AOS_COMTRGSEL1_COMTRG (0x000001FFUL)

/* Bit definition for AOS_COMTRGSEL2 register */
#define AOS_COMTRGSEL2_COMTRG (0x000001FFUL)

/* Bit definition for AOS_PEVNTDIRR register */
#define AOS_PEVNTDIRR_PDIR (0x0000FFFFUL)

/* Bit definition for AOS_PEVNTIDR register */
#define AOS_PEVNTIDR_PIN (0x0000FFFFUL)

/* Bit definition for AOS_PEVNTODR register */
#define AOS_PEVNTODR_POUT (0x0000FFFFUL)

/* Bit definition for AOS_PEVNTORR register */
#define AOS_PEVNTORR_POR (0x0000FFFFUL)

/* Bit definition for AOS_PEVNTOSR register */
#define AOS_PEVNTOSR_POS (0x0000FFFFUL)

/* Bit definition for AOS_PEVNTRISR register */
#define AOS_PEVNTRISR_RIS (0x0000FFFFUL)

/* Bit definition for AOS_PEVNTFALR register */
#define AOS_PEVNTFALR_FAL (0x0000FFFFUL)

