MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for AOS_PEVNTNFCR register */
#define AOS_PEVNTNFCR_NFEN1_POS (0U)
#define AOS_PEVNTNFCR_NFEN1     (0x00000001UL)
#define AOS_PEVNTNFCR_DIVS1_POS (1U)
#define AOS_PEVNTNFCR_DIVS1     (0x00000006UL)
#define AOS_PEVNTNFCR_DIVS1_0   (0x00000002UL)
#define AOS_PEVNTNFCR_DIVS1_1   (0x00000004UL)
#define AOS_PEVNTNFCR_NFEN2_POS (8U)
#define AOS_PEVNTNFCR_NFEN2     (0x00000100UL)
#define AOS_PEVNTNFCR_DIVS2_POS (9U)
#define AOS_PEVNTNFCR_DIVS2     (0x00000600UL)
#define AOS_PEVNTNFCR_DIVS2_0   (0x00000200UL)
#define AOS_PEVNTNFCR_DIVS2_1   (0x00000400UL)
#define AOS_PEVNTNFCR_NFEN3_POS (16U)
#define AOS_PEVNTNFCR_NFEN3     (0x00010000UL)
#define AOS_PEVNTNFCR_DIVS3_POS (17U)
#define AOS_PEVNTNFCR_DIVS3     (0x00060000UL)
#define AOS_PEVNTNFCR_DIVS3_0   (0x00020000UL)
#define AOS_PEVNTNFCR_DIVS3_1   (0x00040000UL)
#define AOS_PEVNTNFCR_NFEN4_POS (24U)
#define AOS_PEVNTNFCR_NFEN4     (0x01000000UL)
#define AOS_PEVNTNFCR_DIVS4_POS (25U)
#define AOS_PEVNTNFCR_DIVS4     (0x06000000UL)
#define AOS_PEVNTNFCR_DIVS4_0   (0x02000000UL)
#define AOS_PEVNTNFCR_DIVS4_1   (0x04000000UL)

/*******************************************************************************
                Bit definition for Peripheral CMP
 *******************************************************************************/
/* Bit definition for CMP_MDR register */
#define CMP_MDR_CENA_POS (0U)
#define CMP_MDR_CENA     (0x01U)
#define CMP_MDR_HYST_POS (1U)
#define CMP_MDR_HYST     (0x0EU)
#define CMP_MDR_WDEN_POS (4U)
#define CMP_MDR_WDEN     (0x10U)
#define CMP_MDR_CSMD_POS (5U)
#define CMP_MDR_CSMD     (0x60U)
#define CMP_MDR_CSMD_0   (0x20U)
#define CMP_MDR_CSMD_1   (0x40U)
#define CMP_MDR_CSST_POS (7U)
#define CMP_MDR_CSST     (0x80U)

/* Bit definition for CMP_FIR register */
#define CMP_FIR_FCKS_POS (0U)
#define CMP_FIR_FCKS     (0x07U)
#define CMP_FIR_CIEN_POS (3U)
#define CMP_FIR_CIEN     (0x08U)
#define CMP_FIR_EDGS_POS (4U)
#define CMP_FIR_EDGS     (0x30U)
#define CMP_FIR_EDGS_0   (0x10U)
#define CMP_FIR_EDGS_1   (0x20U)
#define CMP_FIR_CFF_POS  (6U)
#define CMP_FIR_CFF      (0x40U)
#define CMP_FIR_CRF_POS  (7U)
#define CMP_FIR_CRF      (0x80U)

/* Bit definition for CMP_OCR register */
#define CMP_OCR_COEN_POS (0U)
#define CMP_OCR_COEN     (0x01U)
#define CMP_OCR_COPS_POS (1U)
#define CMP_OCR_COPS     (0x02U)
#define CMP_OCR_CPOE_POS (2U)
#define CMP_OCR_CPOE     (0x04U)
#define CMP_OCR_BWEN_POS (4U)
#define CMP_OCR_BWEN     (0x10U)
#define CMP_OCR_BWMD_POS (5U)
#define CMP_OCR_BWMD     (0x20U)
#define CMP_OCR_BWOL_POS (6U)
#define CMP_OCR_BWOL     (0xC0U)
#define CMP_OCR_BWOL_0   (0x40U)
#define CMP_OCR_BWOL_1   (0x80U)

/* Bit definition for CMP_OMR register */
#define CMP_OMR_CMON (0x01U)

/* Bit definition for CMP_PMSR register */
#define CMP_PMSR_RVSL_POS (0U)
#define CMP_PMSR_RVSL     (0x000000FFUL)
#define CMP_PMSR_RVSL_0   (0x00000001UL)
#define CMP_PMSR_RVSL_1   (0x00000002UL)
#define CMP_PMSR_RVSL_2   (0x00000004UL)
#define CMP_PMSR_RVSL_3   (0x00000008UL)
#define CMP_PMSR_RVSL_4   (0x00000010UL)
#define CMP_PMSR_RVSL_5   (0x00000020UL)
#define CMP_PMSR_RVSL_6   (0x00000040UL)
#define CMP_PMSR_RVSL_7   (0x00000080UL)
#define CMP_PMSR_CVSL_POS (16U)
#define CMP_PMSR_CVSL     (0x00070000UL)
#define CMP_PMSR_CVSL_0   (0x00010000UL)
#define CMP_PMSR_CVSL_1   (0x00020000UL)
#define CMP_PMSR_CVSL_2   (0x00040000UL)

/* Bit definition for CMP_BWSR1 register */
#define CMP_BWSR1_CTWS0_POS  (0U)
#define CMP_BWSR1_CTWS0      (0x00000001UL)
#define CMP_BWSR1_CTWS1_POS  (1U)
#define CMP_BWSR1_CTWS1      (0x00000002UL)
#define CMP_BWSR1_CTWS2_POS  (2U)
#define CMP_BWSR1_CTWS2      (0x00000004UL)
#define CMP_BWSR1_CTWS3_POS  (3U)
#define CMP_BWSR1_CTWS3      (0x00000008UL)
#define CMP_BWSR1_CTWS4_POS  (4U)
#define CMP_BWSR1_CTWS4      (0x00000010UL)
#define CMP_BWSR1_CTWS5_POS  (5U)
#define CMP_BWSR1_CTWS5      (0x00000020UL)
#define CMP_BWSR1_CTWS6_POS  (6U)
#define CMP_BWSR1_CTWS6      (0x00000040UL)
#define CMP_BWSR1_CTWS7_POS  (7U)
#define CMP_BWSR1_CTWS7      (0x00000080UL)
#define CMP_BWSR1_CTWS8_POS  (8U)
#define CMP_BWSR1_CTWS8      (0x00000100UL)
#define CMP_BWSR1_CTWS9_POS  (9U)
#define CMP_BWSR1_CTWS9      (0x00000200UL)
#define CMP_BWSR1_CTWS10_POS (10U)
#define CMP_BWSR1_CTWS10     (0x00000400UL)
#define CMP_BWSR1_CTWS11_POS (11U)
#define CMP_BWSR1_CTWS11     (0x00000800UL)
#define CMP_BWSR1_CTWS12_POS (12U)
#define CMP_BWSR1_CTWS12     (0x00001000UL)
#define CMP_BWSR1_CTWS13_POS (13U)
#define CMP_BWSR1_CTWS13     (0x00002000UL)
#define CMP_BWSR1_CTWP0_POS  (16U)
#define CMP_BWSR1_CTWP0      (0x00010000UL)
#define CMP_BWSR1_CTWP1_POS  (17U)
#define CMP_BWSR1_CTWP1      (0x00020000UL)
#define CMP_BWSR1_CTWP2_POS  (18U)
#define CMP_BWSR1_CTWP2      (0x00040000UL)
#define CMP_BWSR1_CTWP3_POS  (19U)
#define CMP_BWSR1_CTWP3      (0x00080000UL)
#define CMP_BWSR1_CTWP4_POS  (20U)
#define CMP_BWSR1_CTWP4      (0x00100000UL)
#define CMP_BWSR1_CTWP5_POS  (21U)
#define CMP_BWSR1_CTWP5      (0x00200000UL)
#define CMP_BWSR1_CTWP6_POS  (22U)
#define CMP_BWSR1_CTWP6      (0x00400000UL)
#define CMP_BWSR1_CTWP7_POS  (23U)
#define CMP_BWSR1_CTWP7      (0x00800000UL)
#define CMP_BWSR1_CTWP8_POS  (24U)
#define CMP_BWSR1_CTWP8      (0x01000000UL)
#define CMP_BWSR1_CTWP9_POS  (25U)
#define CMP_BWSR1_CTWP9      (0x02000000UL)
#define CMP_BWSR1_CTWP10_POS (26U)
#define CMP_BWSR1_CTWP10     (0x04000000UL)
#define CMP_BWSR1_CTWP11_POS (27U)
#define CMP_BWSR1_CTWP11     (0x08000000UL)
#define CMP_BWSR1_CTWP12_POS (28U)
#define CMP_BWSR1_CTWP12     (0x10000000UL)
#define CMP_BWSR1_CTWP13_POS (29U)
#define CMP_BWSR1_CTWP13     (0x20000000UL)

/* Bit definition for CMP_BWSR2 register */
#define CMP_BWSR2_MSKW_POS (0U)
#define CMP_BWSR2_MSKW     (0x00FFU)
#define CMP_BWSR2_TWEG_POS (8U)
#define CMP_BWSR2_TWEG     (0x0300U)
#define CMP_BWSR2_TWEG_0   (0x0100U)
#define CMP_BWSR2_TWEG_1   (0x0200U)

/* Bit definition for CMP_SCCR register */
#define CMP_SCCR_SISL_POS (0U)
#define CMP_SCCR_SISL     (0x000000FFUL)
#define CMP_SCCR_SPRD_POS (16U)
#define CMP_SCCR_SPRD     (0x00FF0000UL)
#define CMP_SCCR_SSTB_POS (24U)
#define CMP_SCCR_SSTB     (0x3F000000UL)

/* Bit definition for CMP_SCMR register */
#define CMP_SCMR_RVST_POS (0U)
#define CMP_SCMR_RVST     (0x000000FFUL)
#define CMP_SCMR_CVST_POS (16U)
#define CMP_SCMR_CVST     (0x00070000UL)

