MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral CMU
 *******************************************************************************/
/* Bit definition for CMU_LRCCR register */
#define CMU_LRCCR_LRCSTP (0x01U)

/* Bit definition for CMU_LRCTRM register */
#define CMU_LRCTRM (0xFFU)

/* Bit definition for CMU_XTALCFGR register */
#define CMU_XTALCFGR_XTALMS_POS  (3U)
#define CMU_XTALCFGR_XTALMS      (0x08U)
#define CMU_XTALCFGR_XTALDRV_POS (4U)
#define CMU_XTALCFGR_XTALDRV     (0x30U)
#define CMU_XTALCFGR_XTALDRV_0   (0x10U)
#define CMU_XTALCFGR_XTALDRV_1   (0x20U)

/* Bit definition for CMU_PERICKSEL register */
#define CMU_PERICKSEL_PERICKSEL (0x000FU)

/* Bit definition for CMU_CANCKCFGR register */
#define CMU_CANCKCFGR_MCAN1CKS_POS (0U)
#define CMU_CANCKCFGR_MCAN1CKS     (0x000FU)
#define CMU_CANCKCFGR_MCAN2CKS_POS (4U)
#define CMU_CANCKCFGR_MCAN2CKS     (0x00F0U)
#define CMU_CANCKCFGR_MCAN3CKS_POS (8U)
#define CMU_CANCKCFGR_MCAN3CKS     (0x0F00U)

/* Bit definition for CMU_SCFGR register */
#define CMU_SCFGR_PCLK0S_POS (0U)
#define CMU_SCFGR_PCLK0S     (0x00000007UL)
#define CMU_SCFGR_PCLK1S_POS (4U)
#define CMU_SCFGR_PCLK1S     (0x00000070UL)
#define CMU_SCFGR_PCLK2S_POS (8U)
#define CMU_SCFGR_PCLK2S     (0x00000700UL)
#define CMU_SCFGR_PCLK3S_POS (12U)
#define CMU_SCFGR_PCLK3S     (0x00007000UL)
#define CMU_SCFGR_PCLK4S_POS (16U)
#define CMU_SCFGR_PCLK4S     (0x00070000UL)
#define CMU_SCFGR_HCLKS_POS  (24U)
#define CMU_SCFGR_HCLKS      (0x07000000UL)

/* Bit definition for CMU_CKSWR register */
#define CMU_CKSWR_CKSW (0x07U)

/* Bit definition for CMU_PLLHCR register */
#define CMU_PLLHCR_PLLHOFF (0x01U)

/* Bit definition for CMU_XTALCR register */
#define CMU_XTALCR_XTALSTP (0x01U)

/* Bit definition for CMU_HRCCR register */
#define CMU_HRCCR_HRCSTP (0x01U)

/* Bit definition for CMU_MRCCR register */
#define CMU_MRCCR_MRCSTP (0x01U)

/* Bit definition for CMU_OSCSTBSR register */
#define CMU_OSCSTBSR_HRCSTBF_POS  (0U)
#define CMU_OSCSTBSR_HRCSTBF      (0x01U)
#define CMU_OSCSTBSR_XTALSTBF_POS (3U)
#define CMU_OSCSTBSR_XTALSTBF     (0x08U)
#define CMU_OSCSTBSR_PLLHSTBF_POS (5U)
#define CMU_OSCSTBSR_PLLHSTBF     (0x20U)

/* Bit definition for CMU_MCOCFGR register */
#define CMU_MCOCFGR_MCOSEL_POS (0U)
#define CMU_MCOCFGR_MCOSEL     (0x0FU)
#define CMU_MCOCFGR_MCODIV_POS (4U)
#define CMU_MCOCFGR_MCODIV     (0x70U)
#define CMU_MCOCFGR_MCOEN_POS  (7U)
#define CMU_MCOCFGR_MCOEN      (0x80U)

/* Bit definition for CMU_TPIUCKCFGR register */
#define CMU_TPIUCKCFGR_TPIUCKS_POS  (0U)
#define CMU_TPIUCKCFGR_TPIUCKS      (0x03U)
#define CMU_TPIUCKCFGR_TPIUCKS_0    (0x01U)
#define CMU_TPIUCKCFGR_TPIUCKS_1    (0x02U)
#define CMU_TPIUCKCFGR_TPIUCKOE_POS (7U)
#define CMU_TPIUCKCFGR_TPIUCKOE     (0x80U)

/* Bit definition for CMU_XTALSTDCR register */
#define CMU_XTALSTDCR_XTALSTDIE_POS  (0U)
#define CMU_XTALSTDCR_XTALSTDIE      (0x01U)
#define CMU_XTALSTDCR_XTALSTDRE_POS  (1U)
#define CMU_XTALSTDCR_XTALSTDRE      (0x02U)
#define CMU_XTALSTDCR_XTALSTDRIS_POS (2U)
#define CMU_XTALSTDCR_XTALSTDRIS     (0x04U)
#define CMU_XTALSTDCR_XTALSTDE_POS   (7U)
#define CMU_XTALSTDCR_XTALSTDE       (0x80U)

/* Bit definition for CMU_XTALSTDSR register */
#define CMU_XTALSTDSR_XTALSTDF (0x01U)

/* Bit definition for CMU_MRCTRM register */
#define CMU_MRCTRM (0xFFFFU)

/* Bit definition for CMU_HRCTRM register */
#define CMU_HRCTRM (0xFFU)

/* Bit definition for CMU_XTALSTBCR register */
#define CMU_XTALSTBCR_XTALSTB (0x0FU)

/* Bit definition for CMU_PLLHCFGR register */
#define CMU_PLLHCFGR_PLLHM_POS  (0U)
#define CMU_PLLHCFGR_PLLHM      (0x00000003UL)
#define CMU_PLLHCFGR_PLLHM_0    (0x00000001UL)
#define CMU_PLLHCFGR_PLLHM_1    (0x00000002UL)
#define CMU_PLLHCFGR_PLLSRC_POS (7U)
#define CMU_PLLHCFGR_PLLSRC     (0x00000080UL)
#define CMU_PLLHCFGR_PLLHN_POS  (8U)
#define CMU_PLLHCFGR_PLLHN      (0x0000FF00UL)
#define CMU_PLLHCFGR_PLLHR_POS  (20U)
#define CMU_PLLHCFGR_PLLHR      (0x00F00000UL)
#define CMU_PLLHCFGR_PLLHQ_POS  (24U)
#define CMU_PLLHCFGR_PLLHQ      (0x0F000000UL)
#define CMU_PLLHCFGR_PLLHP_POS  (28U)
#define CMU_PLLHCFGR_PLLHP      (0xF0000000UL)

/*******************************************************************************
                Bit definition for Peripheral CORDIC
 *******************************************************************************/
/* Bit definition for CORDIC_CSR register */
#define CORDIC_CSR_FUNC_POS      (0U)
#define CORDIC_CSR_FUNC          (0x0000000FUL)
#define CORDIC_CSR_PRECISION_POS (4U)
#define CORDIC_CSR_PRECISION     (0x000000F0UL)
#define CORDIC_CSR_SCALE_POS     (8U)
#define CORDIC_CSR_SCALE         (0x00000700UL)
#define CORDIC_CSR_IEN_POS       (16U)
#define CORDIC_CSR_IEN           (0x00010000UL)
#define CORDIC_CSR_DMAREN_POS    (17U)
#define CORDIC_CSR_DMAREN        (0x00020000UL)
#define CORDIC_CSR_DMAWEN_POS    (18U)
#define CORDIC_CSR_DMAWEN        (0x00040000UL)
#define CORDIC_CSR_NRES_POS      (19U)
#define CORDIC_CSR_NRES          (0x00080000UL)
#define CORDIC_CSR_NARGS_POS     (20U)
#define CORDIC_CSR_NARGS         (0x00100000UL)
#define CORDIC_CSR_RESSIZE_POS   (21U)
#define CORDIC_CSR_RESSIZE       (0x00200000UL)
#define CORDIC_CSR_ARGSIZE_POS   (22U)
#define CORDIC_CSR_ARGSIZE       (0x00400000UL)
#define CORDIC_CSR_FLOAT_POS     (23U)
#define CORDIC_CSR_FLOAT         (0x00800000UL)
#define CORDIC_CSR_EXTMOD_POS    (24U)
#define CORDIC_CSR_EXTMOD        (0x01000000UL)
#define CORDIC_CSR_BUSY_POS      (30U)
#define CORDIC_CSR_BUSY          (0x40000000UL)
#define CORDIC_CSR_RRDY_POS      (31U)
#define CORDIC_CSR_RRDY          (0x80000000UL)

/* Bit definition for CORDIC_WDATA register */
#define CORDIC_WDATA (0xFFFFFFFFUL)

/* Bit definition for CORDIC_RDATA register */
#define CORDIC_RDATA (0xFFFFFFFFUL)

/* Bit definition for CORDIC_INTEN register */
#define CORDIC_INTEN_ARG1_UP_OV_IEN_POS (0U)
#define CORDIC_INTEN_ARG1_UP_OV_IEN     (0x00000001UL)
#define CORDIC_INTEN_RES1_UP_OV_IEN_POS (4U)
#define CORDIC_INTEN_RES1_UP_OV_IEN     (0x00000010UL)
#define CORDIC_INTEN_RES1_DW_OV_IEN_POS (5U)
#define CORDIC_INTEN_RES1_DW_OV_IEN     (0x00000020UL)
#define CORDIC_INTEN_RES2_UP_OV_IEN_POS (6U)
#define CORDIC_INTEN_RES2_UP_OV_IEN     (0x00000040UL)
#define CORDIC_INTEN_RES2_DW_OV_IEN_POS (7U)
#define CORDIC_INTEN_RES2_DW_OV_IEN     (0x00000080UL)
#define CORDIC_INTEN_WDATA_LOSS_IEN_POS (8U)
#define CORDIC_INTEN_WDATA_LOSS_IEN     (0x00000100UL)

