MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for CORDIC_ISR register */
#define CORDIC_ISR_ARG1_UP_OV_ISR_POS (0U)
#define CORDIC_ISR_ARG1_UP_OV_ISR     (0x00000001UL)
#define CORDIC_ISR_RES1_UP_OV_ISR_POS (4U)
#define CORDIC_ISR_RES1_UP_OV_ISR     (0x00000010UL)
#define CORDIC_ISR_RES1_DW_OV_ISR_POS (5U)
#define CORDIC_ISR_RES1_DW_OV_ISR     (0x00000020UL)
#define CORDIC_ISR_RES2_UP_OV_ISR_POS (6U)
#define CORDIC_ISR_RES2_UP_OV_ISR     (0x00000040UL)
#define CORDIC_ISR_RES2_DW_OV_ISR_POS (7U)
#define CORDIC_ISR_RES2_DW_OV_ISR     (0x00000080UL)
#define CORDIC_ISR_WDATA_LOSS_ISR_POS (8U)
#define CORDIC_ISR_WDATA_LOSS_ISR     (0x00000100UL)

/* Bit definition for CORDIC_ICR register */
#define CORDIC_ICR_ARG1_UP_OV_ICR_POS (0U)
#define CORDIC_ICR_ARG1_UP_OV_ICR     (0x00000001UL)
#define CORDIC_ICR_RES1_UP_OV_ICR_POS (4U)
#define CORDIC_ICR_RES1_UP_OV_ICR     (0x00000010UL)
#define CORDIC_ICR_RES1_DW_OV_ICR_POS (5U)
#define CORDIC_ICR_RES1_DW_OV_ICR     (0x00000020UL)
#define CORDIC_ICR_RES2_UP_OV_ICR_POS (6U)
#define CORDIC_ICR_RES2_UP_OV_ICR     (0x00000040UL)
#define CORDIC_ICR_RES2_DW_OV_ICR_POS (7U)
#define CORDIC_ICR_RES2_DW_OV_ICR     (0x00000080UL)
#define CORDIC_ICR_WDATA_LOSS_ICR_POS (8U)
#define CORDIC_ICR_WDATA_LOSS_ICR     (0x00000100UL)

/*******************************************************************************
                Bit definition for Peripheral CRC
 *******************************************************************************/
/* Bit definition for CRC_CR register */
#define CRC_CR_FLAG_POS   (1U)
#define CRC_CR_FLAG       (0x00000002UL)
#define CRC_CR_SELECT_POS (2U)
#define CRC_CR_SELECT     (0x0000003CUL)

/* Bit definition for CRC_RESLT register */
#define CRC_RESLT (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT0 register */
#define CRC_DAT0 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT1 register */
#define CRC_DAT1 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT2 register */
#define CRC_DAT2 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT3 register */
#define CRC_DAT3 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT4 register */
#define CRC_DAT4 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT5 register */
#define CRC_DAT5 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT6 register */
#define CRC_DAT6 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT7 register */
#define CRC_DAT7 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT8 register */
#define CRC_DAT8 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT9 register */
#define CRC_DAT9 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT10 register */
#define CRC_DAT10 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT11 register */
#define CRC_DAT11 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT12 register */
#define CRC_DAT12 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT13 register */
#define CRC_DAT13 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT14 register */
#define CRC_DAT14 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT15 register */
#define CRC_DAT15 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT16 register */
#define CRC_DAT16 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT17 register */
#define CRC_DAT17 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT18 register */
#define CRC_DAT18 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT19 register */
#define CRC_DAT19 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT20 register */
#define CRC_DAT20 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT21 register */
#define CRC_DAT21 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT22 register */
#define CRC_DAT22 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT23 register */
#define CRC_DAT23 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT24 register */
#define CRC_DAT24 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT25 register */
#define CRC_DAT25 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT26 register */
#define CRC_DAT26 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT27 register */
#define CRC_DAT27 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT28 register */
#define CRC_DAT28 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT29 register */
#define CRC_DAT29 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT30 register */
#define CRC_DAT30 (0xFFFFFFFFUL)

/* Bit definition for CRC_DAT31 register */
#define CRC_DAT31 (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral CTC
 *******************************************************************************/
/* Bit definition for CTC_CR1 register */
#define CTC_CR1_REFPSC_POS (0U)
#define CTC_CR1_REFPSC     (0x00000007UL)
#define CTC_CR1_REFCKS_POS (4U)
#define CTC_CR1_REFCKS     (0x00000030UL)
#define CTC_CR1_REFCKS_0   (0x00000010UL)
#define CTC_CR1_REFCKS_1   (0x00000020UL)
#define CTC_CR1_ERRIE_POS  (6U)
#define CTC_CR1_ERRIE      (0x00000040UL)
#define CTC_CR1_CTCEN_POS  (7U)
#define CTC_CR1_CTCEN      (0x00000080UL)
#define CTC_CR1_TRMVAL_POS (16U)
#define CTC_CR1_TRMVAL     (0x003F0000UL)

/* Bit definition for CTC_CR2 register */
#define CTC_CR2_OFSVAL_POS (0U)
#define CTC_CR2_OFSVAL     (0x000000FFUL)
#define CTC_CR2_RLDVAL_POS (16U)
#define CTC_CR2_RLDVAL     (0xFFFF0000UL)

/* Bit definition for CTC_STR register */
#define CTC_STR_TRIMOK_POS (0U)
#define CTC_STR_TRIMOK     (0x00000001UL)
#define CTC_STR_TRMOVF_POS (1U)
#define CTC_STR_TRMOVF     (0x00000002UL)
#define CTC_STR_TRMUDF_POS (2U)
#define CTC_STR_TRMUDF     (0x00000004UL)
#define CTC_STR_CTCBSY_POS (3U)
#define CTC_STR_CTCBSY     (0x00000008UL)

/*******************************************************************************
                Bit definition for Peripheral DAC
 *******************************************************************************/
/* Bit definition for DAC_DADR1 register */
#define DAC_DADR1 (0xFFFFU)

/* Bit definition for DAC_DADR2 register */
#define DAC_DADR2 (0xFFFFU)

/* Bit definition for DAC_DACR register */
#define DAC_DACR_DAE_POS      (0U)
#define DAC_DACR_DAE          (0x0001U)
#define DAC_DACR_DA1E_POS     (1U)
#define DAC_DACR_DA1E         (0x0002U)
#define DAC_DACR_DA2E_POS     (2U)
#define DAC_DACR_DA2E         (0x0004U)
#define DAC_DACR_DPSEL_POS    (8U)
#define DAC_DACR_DPSEL        (0x0100U)
#define DAC_DACR_DAAMP1_POS   (9U)
#define DAC_DACR_DAAMP1       (0x0200U)
#define DAC_DACR_DAAMP2_POS   (10U)
#define DAC_DACR_DAAMP2       (0x0400U)
#define DAC_DACR_RAMPDIR1_POS (14U)
#define DAC_DACR_RAMPDIR1     (0x4000U)
#define DAC_DACR_RAMPDIR2_POS (15U)
#define DAC_DACR_RAMPDIR2     (0x8000U)

