MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for DAC_DAADPCR register */
#define DAC_DAADPCR_ADCSL1_POS (0U)
#define DAC_DAADPCR_ADCSL1     (0x0001U)
#define DAC_DAADPCR_ADCSL2_POS (1U)
#define DAC_DAADPCR_ADCSL2     (0x0002U)
#define DAC_DAADPCR_ADCSL3_POS (2U)
#define DAC_DAADPCR_ADCSL3     (0x0004U)
#define DAC_DAADPCR_ADCSL4_POS (3U)
#define DAC_DAADPCR_ADCSL4     (0x0008U)
#define DAC_DAADPCR_DA1SF_POS  (8U)
#define DAC_DAADPCR_DA1SF      (0x0100U)
#define DAC_DAADPCR_DA2SF_POS  (9U)
#define DAC_DAADPCR_DA2SF      (0x0200U)
#define DAC_DAADPCR_ADPEN_POS  (15U)
#define DAC_DAADPCR_ADPEN      (0x8000U)

/* Bit definition for DAC_DAOCR register */
#define DAC_DAOCR_DAODIS1_POS (6U)
#define DAC_DAOCR_DAODIS1     (0x40U)
#define DAC_DAOCR_DAODIS2_POS (7U)
#define DAC_DAOCR_DAODIS2     (0x80U)

/* Bit definition for DAC_DACR2 register */
#define DAC_DACR2_RAMPRSTSEL1_POS  (0U)
#define DAC_DACR2_RAMPRSTSEL1      (0x0000000FUL)
#define DAC_DACR2_RAMPSTEPSEL1_POS (4U)
#define DAC_DACR2_RAMPSTEPSEL1     (0x000000F0UL)
#define DAC_DACR2_DEACTIVESEL1_POS (8U)
#define DAC_DACR2_DEACTIVESEL1     (0x00000F00UL)
#define DAC_DACR2_DEMD1_POS        (13U)
#define DAC_DACR2_DEMD1            (0x00002000UL)
#define DAC_DACR2_RAMPMD1_POS      (14U)
#define DAC_DACR2_RAMPMD1          (0x00004000UL)
#define DAC_DACR2_LDMD1_POS        (15U)
#define DAC_DACR2_LDMD1            (0x00008000UL)
#define DAC_DACR2_RAMPRSTSEL2_POS  (16U)
#define DAC_DACR2_RAMPRSTSEL2      (0x000F0000UL)
#define DAC_DACR2_RAMPSTEPSEL2_POS (20U)
#define DAC_DACR2_RAMPSTEPSEL2     (0x00F00000UL)
#define DAC_DACR2_DEACTIVESEL2_POS (24U)
#define DAC_DACR2_DEACTIVESEL2     (0x0F000000UL)
#define DAC_DACR2_DEMD2_POS        (29U)
#define DAC_DACR2_DEMD2            (0x20000000UL)
#define DAC_DACR2_RAMPMD2_POS      (30U)
#define DAC_DACR2_RAMPMD2          (0x40000000UL)
#define DAC_DACR2_LDMD2_POS        (31U)
#define DAC_DACR2_LDMD2            (0x80000000UL)

/* Bit definition for DAC_RAMPLMTR1 register */
#define DAC_RAMPLMTR1_RAMPLMT (0x0FFFU)

/* Bit definition for DAC_RAMPLMTR2 register */
#define DAC_RAMPLMTR2_RAMPLMT (0x0FFFU)

/* Bit definition for DAC_RAMPSTEPR1 register */
#define DAC_RAMPSTEPR1_RAMPSTEP (0x0FFFU)

/* Bit definition for DAC_RAMPSTEPR2 register */
#define DAC_RAMPSTEPR2_RAMPSTEP (0x0FFFU)

/* Bit definition for DAC_RAMPSWTRGR register */
#define DAC_RAMPSWTRGR_RSTSWTRG1_POS  (0U)
#define DAC_RAMPSWTRGR_RSTSWTRG1      (0x0001U)
#define DAC_RAMPSWTRGR_STEPSWTRG1_POS (1U)
#define DAC_RAMPSWTRGR_STEPSWTRG1     (0x0002U)
#define DAC_RAMPSWTRGR_RSTSWTRG2_POS  (2U)
#define DAC_RAMPSWTRGR_RSTSWTRG2      (0x0004U)
#define DAC_RAMPSWTRGR_STEPSWTRG2_POS (3U)
#define DAC_RAMPSWTRGR_STEPSWTRG2     (0x0008U)

/* Bit definition for DAC_DADACTR register */
#define DAC_DADACTR_DATAACT (0x0FFFU)

/* Bit definition for DAC_DACR3 register */
#define DAC_DACR3_RAMPLOADSEL1_POS (4U)
#define DAC_DACR3_RAMPLOADSEL1     (0x0010U)
#define DAC_DACR3_CMPSCTL1_POS     (5U)
#define DAC_DACR3_CMPSCTL1         (0x0020U)
#define DAC_DACR3_OFSTDIR1_POS     (6U)
#define DAC_DACR3_OFSTDIR1         (0x0040U)
#define DAC_DACR3_OFSTMD1_POS      (7U)
#define DAC_DACR3_OFSTMD1          (0x0080U)
#define DAC_DACR3_RAMPLOADSEL2_POS (12U)
#define DAC_DACR3_RAMPLOADSEL2     (0x1000U)
#define DAC_DACR3_CMPSCTL2_POS     (13U)
#define DAC_DACR3_CMPSCTL2         (0x2000U)
#define DAC_DACR3_OFSTDIR2_POS     (14U)
#define DAC_DACR3_OFSTDIR2         (0x4000U)
#define DAC_DACR3_OFSTMD2_POS      (15U)
#define DAC_DACR3_OFSTMD2          (0x8000U)

/* Bit definition for DAC_DADRDE1 register */
#define DAC_DADRDE1 (0xFFFFU)

/* Bit definition for DAC_DADRDE2 register */
#define DAC_DADRDE2 (0xFFFFU)

/* Bit definition for DAC_DADROF1 register */
#define DAC_DADROF1 (0xFFFFU)

/* Bit definition for DAC_DADROF2 register */
#define DAC_DADROF2 (0xFFFFU)

/* Bit definition for DAC_RAMPRSTDLYR register */
#define DAC_RAMPRSTDLYR_DARAMPRSTDLY (0x0FFFU)

/* Bit definition for DAC_RAMPLMTACTR register */
#define DAC_RAMPLMTACTR_RAMPLMTACT (0x0FFFU)

/* Bit definition for DAC_RAMPSTEPACTR register */
#define DAC_RAMPSTEPACTR_RAMPSTEPACT (0x0FFFU)

/* Bit definition for DAC_RAMPRSTDLYACTR register */
#define DAC_RAMPRSTDLYACTR_DARAMPRSTDLYACT (0x0FFFU)

/*******************************************************************************
                Bit definition for Peripheral DBGC
 *******************************************************************************/
/* Bit definition for DBGC_AUTHID0 register */
#define DBGC_AUTHID0 (0xFFFFFFFFUL)

/* Bit definition for DBGC_AUTHID1 register */
#define DBGC_AUTHID1 (0xFFFFFFFFUL)

/* Bit definition for DBGC_AUTHID2 register */
#define DBGC_AUTHID2 (0xFFFFFFFFUL)

/* Bit definition for DBGC_CHIPID register */
#define DBGC_CHIPID (0xFFFFFFFFUL)

/* Bit definition for DBGC_MCUSTAT register */
#define DBGC_MCUSTAT_AUTHFG_POS (0U)
#define DBGC_MCUSTAT_AUTHFG     (0x00000001UL)
#define DBGC_MCUSTAT_PRTLV1_POS (2U)
#define DBGC_MCUSTAT_PRTLV1     (0x00000004UL)
#define DBGC_MCUSTAT_PRTLV2_POS (3U)
#define DBGC_MCUSTAT_PRTLV2     (0x00000008UL)
#define DBGC_MCUSTAT_PRTLV3_POS (4U)
#define DBGC_MCUSTAT_PRTLV3     (0x00000010UL)

/* Bit definition for DBGC_FERSCTL register */
#define DBGC_FERSCTL_ERASEREQ_POS (0U)
#define DBGC_FERSCTL_ERASEREQ     (0x00000001UL)
#define DBGC_FERSCTL_ERASEACK_POS (1U)
#define DBGC_FERSCTL_ERASEACK     (0x00000002UL)
#define DBGC_FERSCTL_ERASEERR_POS (2U)
#define DBGC_FERSCTL_ERASEERR     (0x00000004UL)

/* Bit definition for DBGC_MCUDBGCSTAT register */
#define DBGC_MCUDBGCSTAT_CDBGPWRUPREQ_POS (0U)
#define DBGC_MCUDBGCSTAT_CDBGPWRUPREQ     (0x00000001UL)
#define DBGC_MCUDBGCSTAT_CDBGPWRUPACK_POS (1U)
#define DBGC_MCUDBGCSTAT_CDBGPWRUPACK     (0x00000002UL)

/* Bit definition for DBGC_MCUSTPCTL register */
#define DBGC_MCUSTPCTL_SWDTSTP_POS (0U)
#define DBGC_MCUSTPCTL_SWDTSTP     (0x00000001UL)
#define DBGC_MCUSTPCTL_WDTSTP_POS  (1U)
#define DBGC_MCUSTPCTL_WDTSTP      (0x00000002UL)
#define DBGC_MCUSTPCTL_RTCSTP_POS  (2U)
#define DBGC_MCUSTPCTL_RTCSTP      (0x00000004UL)
#define DBGC_MCUSTPCTL_PVD0STP_POS (3U)
#define DBGC_MCUSTPCTL_PVD0STP     (0x00000008UL)
#define DBGC_MCUSTPCTL_PVD1STP_POS (4U)
#define DBGC_MCUSTPCTL_PVD1STP     (0x00000010UL)
#define DBGC_MCUSTPCTL_PVD2STP_POS (5U)
#define DBGC_MCUSTPCTL_PVD2STP     (0x00000020UL)
#define DBGC_MCUSTPCTL_M06STP_POS  (6U)
#define DBGC_MCUSTPCTL_M06STP      (0x00000040UL)
#define DBGC_MCUSTPCTL_M07STP_POS  (7U)
#define DBGC_MCUSTPCTL_M07STP      (0x00000080UL)
#define DBGC_MCUSTPCTL_M15STP_POS  (15U)
#define DBGC_MCUSTPCTL_M15STP      (0x00008000UL)
#define DBGC_MCUSTPCTL_M16STP_POS  (16U)
#define DBGC_MCUSTPCTL_M16STP      (0x00010000UL)
#define DBGC_MCUSTPCTL_M17STP_POS  (17U)
#define DBGC_MCUSTPCTL_M17STP      (0x00020000UL)
#define DBGC_MCUSTPCTL_M18STP_POS  (18U)
#define DBGC_MCUSTPCTL_M18STP      (0x00040000UL)
#define DBGC_MCUSTPCTL_M19STP_POS  (19U)
#define DBGC_MCUSTPCTL_M19STP      (0x00080000UL)
#define DBGC_MCUSTPCTL_M20STP_POS  (20U)
#define DBGC_MCUSTPCTL_M20STP      (0x00100000UL)
#define DBGC_MCUSTPCTL_M24STP_POS  (24U)
#define DBGC_MCUSTPCTL_M24STP      (0x01000000UL)
#define DBGC_MCUSTPCTL_M25STP_POS  (25U)
#define DBGC_MCUSTPCTL_M25STP      (0x02000000UL)
#define DBGC_MCUSTPCTL_M26STP_POS  (26U)
#define DBGC_MCUSTPCTL_M26STP      (0x04000000UL)
#define DBGC_MCUSTPCTL_M27STP_POS  (27U)
#define DBGC_MCUSTPCTL_M27STP      (0x08000000UL)
#define DBGC_MCUSTPCTL_M28STP_POS  (28U)
#define DBGC_MCUSTPCTL_M28STP      (0x10000000UL)
#define DBGC_MCUSTPCTL_M29STP_POS  (29U)
#define DBGC_MCUSTPCTL_M29STP      (0x20000000UL)
#define DBGC_MCUSTPCTL_M30STP_POS  (30U)
#define DBGC_MCUSTPCTL_M30STP      (0x40000000UL)
#define DBGC_MCUSTPCTL_M31STP_POS  (31U)
#define DBGC_MCUSTPCTL_M31STP      (0x80000000UL)

