MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for DBGC_MCUTRACECTL register */
#define DBGC_MCUTRACECTL_TRACEMODE_POS (0U)
#define DBGC_MCUTRACECTL_TRACEMODE     (0x00000003UL)
#define DBGC_MCUTRACECTL_TRACEMODE_0   (0x00000001UL)
#define DBGC_MCUTRACECTL_TRACEMODE_1   (0x00000002UL)
#define DBGC_MCUTRACECTL_TRACEIOEN_POS (2U)
#define DBGC_MCUTRACECTL_TRACEIOEN     (0x00000004UL)

/*******************************************************************************
                Bit definition for Peripheral DMA
 *******************************************************************************/
/* Bit definition for DMA_EN register */
#define DMA_EN_EN (0x00000001UL)

/* Bit definition for DMA_INTSTAT0 register */
#define DMA_INTSTAT0_TRNERR_POS (0U)
#define DMA_INTSTAT0_TRNERR     (0x000000FFUL)
#define DMA_INTSTAT0_TRNERR_0   (0x00000001UL)
#define DMA_INTSTAT0_TRNERR_1   (0x00000002UL)
#define DMA_INTSTAT0_TRNERR_2   (0x00000004UL)
#define DMA_INTSTAT0_TRNERR_3   (0x00000008UL)
#define DMA_INTSTAT0_TRNERR_4   (0x00000010UL)
#define DMA_INTSTAT0_TRNERR_5   (0x00000020UL)
#define DMA_INTSTAT0_TRNERR_6   (0x00000040UL)
#define DMA_INTSTAT0_TRNERR_7   (0x00000080UL)
#define DMA_INTSTAT0_REQERR_POS (16U)
#define DMA_INTSTAT0_REQERR     (0x00FF0000UL)
#define DMA_INTSTAT0_REQERR_0   (0x00010000UL)
#define DMA_INTSTAT0_REQERR_1   (0x00020000UL)
#define DMA_INTSTAT0_REQERR_2   (0x00040000UL)
#define DMA_INTSTAT0_REQERR_3   (0x00080000UL)
#define DMA_INTSTAT0_REQERR_4   (0x00100000UL)
#define DMA_INTSTAT0_REQERR_5   (0x00200000UL)
#define DMA_INTSTAT0_REQERR_6   (0x00400000UL)
#define DMA_INTSTAT0_REQERR_7   (0x00800000UL)

/* Bit definition for DMA_INTSTAT1 register */
#define DMA_INTSTAT1_TC_POS  (0U)
#define DMA_INTSTAT1_TC      (0x000000FFUL)
#define DMA_INTSTAT1_TC_0    (0x00000001UL)
#define DMA_INTSTAT1_TC_1    (0x00000002UL)
#define DMA_INTSTAT1_TC_2    (0x00000004UL)
#define DMA_INTSTAT1_TC_3    (0x00000008UL)
#define DMA_INTSTAT1_TC_4    (0x00000010UL)
#define DMA_INTSTAT1_TC_5    (0x00000020UL)
#define DMA_INTSTAT1_TC_6    (0x00000040UL)
#define DMA_INTSTAT1_TC_7    (0x00000080UL)
#define DMA_INTSTAT1_BTC_POS (16U)
#define DMA_INTSTAT1_BTC     (0x00FF0000UL)
#define DMA_INTSTAT1_BTC_0   (0x00010000UL)
#define DMA_INTSTAT1_BTC_1   (0x00020000UL)
#define DMA_INTSTAT1_BTC_2   (0x00040000UL)
#define DMA_INTSTAT1_BTC_3   (0x00080000UL)
#define DMA_INTSTAT1_BTC_4   (0x00100000UL)
#define DMA_INTSTAT1_BTC_5   (0x00200000UL)
#define DMA_INTSTAT1_BTC_6   (0x00400000UL)
#define DMA_INTSTAT1_BTC_7   (0x00800000UL)

/* Bit definition for DMA_INTMASK0 register */
#define DMA_INTMASK0_MSKTRNERR_POS (0U)
#define DMA_INTMASK0_MSKTRNERR     (0x000000FFUL)
#define DMA_INTMASK0_MSKTRNERR_0   (0x00000001UL)
#define DMA_INTMASK0_MSKTRNERR_1   (0x00000002UL)
#define DMA_INTMASK0_MSKTRNERR_2   (0x00000004UL)
#define DMA_INTMASK0_MSKTRNERR_3   (0x00000008UL)
#define DMA_INTMASK0_MSKTRNERR_4   (0x00000010UL)
#define DMA_INTMASK0_MSKTRNERR_5   (0x00000020UL)
#define DMA_INTMASK0_MSKTRNERR_6   (0x00000040UL)
#define DMA_INTMASK0_MSKTRNERR_7   (0x00000080UL)
#define DMA_INTMASK0_MSKREQERR_POS (16U)
#define DMA_INTMASK0_MSKREQERR     (0x00FF0000UL)
#define DMA_INTMASK0_MSKREQERR_0   (0x00010000UL)
#define DMA_INTMASK0_MSKREQERR_1   (0x00020000UL)
#define DMA_INTMASK0_MSKREQERR_2   (0x00040000UL)
#define DMA_INTMASK0_MSKREQERR_3   (0x00080000UL)
#define DMA_INTMASK0_MSKREQERR_4   (0x00100000UL)
#define DMA_INTMASK0_MSKREQERR_5   (0x00200000UL)
#define DMA_INTMASK0_MSKREQERR_6   (0x00400000UL)
#define DMA_INTMASK0_MSKREQERR_7   (0x00800000UL)

/* Bit definition for DMA_INTMASK1 register */
#define DMA_INTMASK1_MSKTC_POS  (0U)
#define DMA_INTMASK1_MSKTC      (0x000000FFUL)
#define DMA_INTMASK1_MSKTC_0    (0x00000001UL)
#define DMA_INTMASK1_MSKTC_1    (0x00000002UL)
#define DMA_INTMASK1_MSKTC_2    (0x00000004UL)
#define DMA_INTMASK1_MSKTC_3    (0x00000008UL)
#define DMA_INTMASK1_MSKTC_4    (0x00000010UL)
#define DMA_INTMASK1_MSKTC_5    (0x00000020UL)
#define DMA_INTMASK1_MSKTC_6    (0x00000040UL)
#define DMA_INTMASK1_MSKTC_7    (0x00000080UL)
#define DMA_INTMASK1_MSKBTC_POS (16U)
#define DMA_INTMASK1_MSKBTC     (0x00FF0000UL)
#define DMA_INTMASK1_MSKBTC_0   (0x00010000UL)
#define DMA_INTMASK1_MSKBTC_1   (0x00020000UL)
#define DMA_INTMASK1_MSKBTC_2   (0x00040000UL)
#define DMA_INTMASK1_MSKBTC_3   (0x00080000UL)
#define DMA_INTMASK1_MSKBTC_4   (0x00100000UL)
#define DMA_INTMASK1_MSKBTC_5   (0x00200000UL)
#define DMA_INTMASK1_MSKBTC_6   (0x00400000UL)
#define DMA_INTMASK1_MSKBTC_7   (0x00800000UL)

/* Bit definition for DMA_INTCLR0 register */
#define DMA_INTCLR0_CLRTRNERR_POS (0U)
#define DMA_INTCLR0_CLRTRNERR     (0x000000FFUL)
#define DMA_INTCLR0_CLRTRNERR_0   (0x00000001UL)
#define DMA_INTCLR0_CLRTRNERR_1   (0x00000002UL)
#define DMA_INTCLR0_CLRTRNERR_2   (0x00000004UL)
#define DMA_INTCLR0_CLRTRNERR_3   (0x00000008UL)
#define DMA_INTCLR0_CLRTRNERR_4   (0x00000010UL)
#define DMA_INTCLR0_CLRTRNERR_5   (0x00000020UL)
#define DMA_INTCLR0_CLRTRNERR_6   (0x00000040UL)
#define DMA_INTCLR0_CLRTRNERR_7   (0x00000080UL)
#define DMA_INTCLR0_CLRREQERR_POS (16U)
#define DMA_INTCLR0_CLRREQERR     (0x00FF0000UL)
#define DMA_INTCLR0_CLRREQERR_0   (0x00010000UL)
#define DMA_INTCLR0_CLRREQERR_1   (0x00020000UL)
#define DMA_INTCLR0_CLRREQERR_2   (0x00040000UL)
#define DMA_INTCLR0_CLRREQERR_3   (0x00080000UL)
#define DMA_INTCLR0_CLRREQERR_4   (0x00100000UL)
#define DMA_INTCLR0_CLRREQERR_5   (0x00200000UL)
#define DMA_INTCLR0_CLRREQERR_6   (0x00400000UL)
#define DMA_INTCLR0_CLRREQERR_7   (0x00800000UL)

/* Bit definition for DMA_INTCLR1 register */
#define DMA_INTCLR1_CLRTC_POS  (0U)
#define DMA_INTCLR1_CLRTC      (0x000000FFUL)
#define DMA_INTCLR1_CLRTC_0    (0x00000001UL)
#define DMA_INTCLR1_CLRTC_1    (0x00000002UL)
#define DMA_INTCLR1_CLRTC_2    (0x00000004UL)
#define DMA_INTCLR1_CLRTC_3    (0x00000008UL)
#define DMA_INTCLR1_CLRTC_4    (0x00000010UL)
#define DMA_INTCLR1_CLRTC_5    (0x00000020UL)
#define DMA_INTCLR1_CLRTC_6    (0x00000040UL)
#define DMA_INTCLR1_CLRTC_7    (0x00000080UL)
#define DMA_INTCLR1_CLRBTC_POS (16U)
#define DMA_INTCLR1_CLRBTC     (0x00FF0000UL)
#define DMA_INTCLR1_CLRBTC_0   (0x00010000UL)
#define DMA_INTCLR1_CLRBTC_1   (0x00020000UL)
#define DMA_INTCLR1_CLRBTC_2   (0x00040000UL)
#define DMA_INTCLR1_CLRBTC_3   (0x00080000UL)
#define DMA_INTCLR1_CLRBTC_4   (0x00100000UL)
#define DMA_INTCLR1_CLRBTC_5   (0x00200000UL)
#define DMA_INTCLR1_CLRBTC_6   (0x00400000UL)
#define DMA_INTCLR1_CLRBTC_7   (0x00800000UL)

/* Bit definition for DMA_CHEN register */
#define DMA_CHEN_CHEN   (0x000000FFUL)
#define DMA_CHEN_CHEN_0 (0x00000001UL)
#define DMA_CHEN_CHEN_1 (0x00000002UL)
#define DMA_CHEN_CHEN_2 (0x00000004UL)
#define DMA_CHEN_CHEN_3 (0x00000008UL)
#define DMA_CHEN_CHEN_4 (0x00000010UL)
#define DMA_CHEN_CHEN_5 (0x00000020UL)
#define DMA_CHEN_CHEN_6 (0x00000040UL)
#define DMA_CHEN_CHEN_7 (0x00000080UL)

/* Bit definition for DMA_REQSTAT register */
#define DMA_REQSTAT_CHREQ_POS   (0U)
#define DMA_REQSTAT_CHREQ       (0x000000FFUL)
#define DMA_REQSTAT_CHREQ_0     (0x00000001UL)
#define DMA_REQSTAT_CHREQ_1     (0x00000002UL)
#define DMA_REQSTAT_CHREQ_2     (0x00000004UL)
#define DMA_REQSTAT_CHREQ_3     (0x00000008UL)
#define DMA_REQSTAT_CHREQ_4     (0x00000010UL)
#define DMA_REQSTAT_CHREQ_5     (0x00000020UL)
#define DMA_REQSTAT_CHREQ_6     (0x00000040UL)
#define DMA_REQSTAT_CHREQ_7     (0x00000080UL)
#define DMA_REQSTAT_RCFGREQ_POS (15U)
#define DMA_REQSTAT_RCFGREQ     (0x00008000UL)

/* Bit definition for DMA_CHSTAT register */
#define DMA_CHSTAT_DMAACT_POS  (0U)
#define DMA_CHSTAT_DMAACT      (0x00000001UL)
#define DMA_CHSTAT_RCFGACT_POS (1U)
#define DMA_CHSTAT_RCFGACT     (0x00000002UL)
#define DMA_CHSTAT_CHACT_POS   (16U)
#define DMA_CHSTAT_CHACT       (0x00FF0000UL)
#define DMA_CHSTAT_CHACT_0     (0x00010000UL)
#define DMA_CHSTAT_CHACT_1     (0x00020000UL)
#define DMA_CHSTAT_CHACT_2     (0x00040000UL)
#define DMA_CHSTAT_CHACT_3     (0x00080000UL)
#define DMA_CHSTAT_CHACT_4     (0x00100000UL)
#define DMA_CHSTAT_CHACT_5     (0x00200000UL)
#define DMA_CHSTAT_CHACT_6     (0x00400000UL)
#define DMA_CHSTAT_CHACT_7     (0x00800000UL)

/* Bit definition for DMA_RCFGCTL register */
#define DMA_RCFGCTL_RCFGEN_POS  (0U)
#define DMA_RCFGCTL_RCFGEN      (0x00000001UL)
#define DMA_RCFGCTL_RCFGLLP_POS (1U)
#define DMA_RCFGCTL_RCFGLLP     (0x00000002UL)
#define DMA_RCFGCTL_RCFGCHS_POS (8U)
#define DMA_RCFGCTL_RCFGCHS     (0x00000F00UL)
#define DMA_RCFGCTL_SARMD_POS   (16U)
#define DMA_RCFGCTL_SARMD       (0x00030000UL)
#define DMA_RCFGCTL_SARMD_0     (0x00010000UL)
#define DMA_RCFGCTL_SARMD_1     (0x00020000UL)
#define DMA_RCFGCTL_DARMD_POS   (18U)
#define DMA_RCFGCTL_DARMD       (0x000C0000UL)
#define DMA_RCFGCTL_DARMD_0     (0x00040000UL)
#define DMA_RCFGCTL_DARMD_1     (0x00080000UL)
#define DMA_RCFGCTL_CNTMD_POS   (20U)
#define DMA_RCFGCTL_CNTMD       (0x00300000UL)
#define DMA_RCFGCTL_CNTMD_0     (0x00100000UL)
#define DMA_RCFGCTL_CNTMD_1     (0x00200000UL)

/* Bit definition for DMA_SWREQ register */
#define DMA_SWREQ_SWREQ_POS     (0U)
#define DMA_SWREQ_SWREQ         (0x000000FFUL)
#define DMA_SWREQ_SWREQ_0       (0x00000001UL)
#define DMA_SWREQ_SWREQ_1       (0x00000002UL)
#define DMA_SWREQ_SWREQ_2       (0x00000004UL)
#define DMA_SWREQ_SWREQ_3       (0x00000008UL)
#define DMA_SWREQ_SWREQ_4       (0x00000010UL)
#define DMA_SWREQ_SWREQ_5       (0x00000020UL)
#define DMA_SWREQ_SWREQ_6       (0x00000040UL)
#define DMA_SWREQ_SWREQ_7       (0x00000080UL)
#define DMA_SWREQ_SWRCFGREQ_POS (15U)
#define DMA_SWREQ_SWRCFGREQ     (0x00008000UL)
#define DMA_SWREQ_SWREQWP_POS   (16U)
#define DMA_SWREQ_SWREQWP       (0x00FF0000UL)
#define DMA_SWREQ_SWRCFGWP_POS  (24U)
#define DMA_SWREQ_SWRCFGWP      (0xFF000000UL)

