MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for DMA_CHENCLR register */
#define DMA_CHENCLR_CHENCLR   (0x000000FFUL)
#define DMA_CHENCLR_CHENCLR_0 (0x00000001UL)
#define DMA_CHENCLR_CHENCLR_1 (0x00000002UL)
#define DMA_CHENCLR_CHENCLR_2 (0x00000004UL)
#define DMA_CHENCLR_CHENCLR_3 (0x00000008UL)
#define DMA_CHENCLR_CHENCLR_4 (0x00000010UL)
#define DMA_CHENCLR_CHENCLR_5 (0x00000020UL)
#define DMA_CHENCLR_CHENCLR_6 (0x00000040UL)
#define DMA_CHENCLR_CHENCLR_7 (0x00000080UL)

/* Bit definition for DMA_SAR register */
#define DMA_SAR (0xFFFFFFFFUL)

/* Bit definition for DMA_DAR register */
#define DMA_DAR (0xFFFFFFFFUL)

/* Bit definition for DMA_DTCTL register */
#define DMA_DTCTL_BLKSIZE_POS (0U)
#define DMA_DTCTL_BLKSIZE     (0x000003FFUL)
#define DMA_DTCTL_CNT_POS     (16U)
#define DMA_DTCTL_CNT         (0xFFFF0000UL)

/* Bit definition for DMA_RPT register */
#define DMA_RPT_SRPT_POS (0U)
#define DMA_RPT_SRPT     (0x000003FFUL)
#define DMA_RPT_DRPT_POS (16U)
#define DMA_RPT_DRPT     (0x03FF0000UL)

/* Bit definition for DMA_RPTB register */
#define DMA_RPTB_SRPTB_POS (0U)
#define DMA_RPTB_SRPTB     (0x000003FFUL)
#define DMA_RPTB_DRPTB_POS (16U)
#define DMA_RPTB_DRPTB     (0x03FF0000UL)

/* Bit definition for DMA_SNSEQCTL register */
#define DMA_SNSEQCTL_SOFFSET_POS (0U)
#define DMA_SNSEQCTL_SOFFSET     (0x000FFFFFUL)
#define DMA_SNSEQCTL_SNSCNT_POS  (20U)
#define DMA_SNSEQCTL_SNSCNT      (0xFFF00000UL)

/* Bit definition for DMA_SNSEQCTLB register */
#define DMA_SNSEQCTLB_SNSDIST_POS (0U)
#define DMA_SNSEQCTLB_SNSDIST     (0x000FFFFFUL)
#define DMA_SNSEQCTLB_SNSCNTB_POS (20U)
#define DMA_SNSEQCTLB_SNSCNTB     (0xFFF00000UL)

/* Bit definition for DMA_DNSEQCTL register */
#define DMA_DNSEQCTL_DOFFSET_POS (0U)
#define DMA_DNSEQCTL_DOFFSET     (0x000FFFFFUL)
#define DMA_DNSEQCTL_DNSCNT_POS  (20U)
#define DMA_DNSEQCTL_DNSCNT      (0xFFF00000UL)

/* Bit definition for DMA_DNSEQCTLB register */
#define DMA_DNSEQCTLB_DNSDIST_POS (0U)
#define DMA_DNSEQCTLB_DNSDIST     (0x000FFFFFUL)
#define DMA_DNSEQCTLB_DNSCNTB_POS (20U)
#define DMA_DNSEQCTLB_DNSCNTB     (0xFFF00000UL)

/* Bit definition for DMA_LLP register */
#define DMA_LLP_LLP_POS (2U)
#define DMA_LLP_LLP     (0xFFFFFFFCUL)

/* Bit definition for DMA_CHCTL register */
#define DMA_CHCTL_SINC_POS    (0U)
#define DMA_CHCTL_SINC        (0x00000003UL)
#define DMA_CHCTL_SINC_0      (0x00000001UL)
#define DMA_CHCTL_SINC_1      (0x00000002UL)
#define DMA_CHCTL_DINC_POS    (2U)
#define DMA_CHCTL_DINC        (0x0000000CUL)
#define DMA_CHCTL_DINC_0      (0x00000004UL)
#define DMA_CHCTL_DINC_1      (0x00000008UL)
#define DMA_CHCTL_SRPTEN_POS  (4U)
#define DMA_CHCTL_SRPTEN      (0x00000010UL)
#define DMA_CHCTL_DRPTEN_POS  (5U)
#define DMA_CHCTL_DRPTEN      (0x00000020UL)
#define DMA_CHCTL_SNSEQEN_POS (6U)
#define DMA_CHCTL_SNSEQEN     (0x00000040UL)
#define DMA_CHCTL_DNSEQEN_POS (7U)
#define DMA_CHCTL_DNSEQEN     (0x00000080UL)
#define DMA_CHCTL_HSIZE_POS   (8U)
#define DMA_CHCTL_HSIZE       (0x00000300UL)
#define DMA_CHCTL_HSIZE_0     (0x00000100UL)
#define DMA_CHCTL_HSIZE_1     (0x00000200UL)
#define DMA_CHCTL_LLPEN_POS   (10U)
#define DMA_CHCTL_LLPEN       (0x00000400UL)
#define DMA_CHCTL_LLPRUN_POS  (11U)
#define DMA_CHCTL_LLPRUN      (0x00000800UL)
#define DMA_CHCTL_IE_POS      (12U)
#define DMA_CHCTL_IE          (0x00001000UL)

/* Bit definition for DMA_MONSAR register */
#define DMA_MONSAR (0xFFFFFFFFUL)

/* Bit definition for DMA_MONDAR register */
#define DMA_MONDAR (0xFFFFFFFFUL)

/* Bit definition for DMA_MONDTCTL register */
#define DMA_MONDTCTL_BLKSIZE_POS (0U)
#define DMA_MONDTCTL_BLKSIZE     (0x000003FFUL)
#define DMA_MONDTCTL_CNT_POS     (16U)
#define DMA_MONDTCTL_CNT         (0xFFFF0000UL)

/* Bit definition for DMA_MONRPT register */
#define DMA_MONRPT_SRPT_POS (0U)
#define DMA_MONRPT_SRPT     (0x000003FFUL)
#define DMA_MONRPT_DRPT_POS (16U)
#define DMA_MONRPT_DRPT     (0x03FF0000UL)

/* Bit definition for DMA_MONSNSEQCTL register */
#define DMA_MONSNSEQCTL_SOFFSET_POS (0U)
#define DMA_MONSNSEQCTL_SOFFSET     (0x000FFFFFUL)
#define DMA_MONSNSEQCTL_SNSCNT_POS  (20U)
#define DMA_MONSNSEQCTL_SNSCNT      (0xFFF00000UL)

/* Bit definition for DMA_MONDNSEQCTL register */
#define DMA_MONDNSEQCTL_DOFFSET_POS (0U)
#define DMA_MONDNSEQCTL_DOFFSET     (0x000FFFFFUL)
#define DMA_MONDNSEQCTL_DNSCNT_POS  (20U)
#define DMA_MONDNSEQCTL_DNSCNT      (0xFFF00000UL)

/*******************************************************************************
                Bit definition for Peripheral DSOGI_PLL
 *******************************************************************************/
/* Bit definition for DSOGI_PLL_CR register */
#define DSOGI_PLL_CR_START_POS      (0U)
#define DSOGI_PLL_CR_START          (0x00000001UL)
#define DSOGI_PLL_CR_MODE_POS       (8U)
#define DSOGI_PLL_CR_MODE           (0x00000100UL)
#define DSOGI_PLL_CR_FUNC_POS       (9U)
#define DSOGI_PLL_CR_FUNC           (0x00000600UL)
#define DSOGI_PLL_CR_FUNC_0         (0x00000200UL)
#define DSOGI_PLL_CR_FUNC_1         (0x00000400UL)
#define DSOGI_PLL_CR_PLL_EN_POS     (11U)
#define DSOGI_PLL_CR_PLL_EN         (0x00000800UL)
#define DSOGI_PLL_CR_PI_EN_POS      (12U)
#define DSOGI_PLL_CR_PI_EN          (0x00001000UL)
#define DSOGI_PLL_CR_FLL_EN_POS     (13U)
#define DSOGI_PLL_CR_FLL_EN         (0x00002000UL)
#define DSOGI_PLL_CR_JUDGE_EN_POS   (14U)
#define DSOGI_PLL_CR_JUDGE_EN       (0x00004000UL)
#define DSOGI_PLL_CR_SOGI_SC_POS    (15U)
#define DSOGI_PLL_CR_SOGI_SC        (0x00008000UL)
#define DSOGI_PLL_CR_THETA_SEL_POS  (16U)
#define DSOGI_PLL_CR_THETA_SEL      (0x00010000UL)
#define DSOGI_PLL_CR_ADC_SEL_POS    (17U)
#define DSOGI_PLL_CR_ADC_SEL        (0x00020000UL)
#define DSOGI_PLL_CR_DIN_SEL_POS    (18U)
#define DSOGI_PLL_CR_DIN_SEL        (0x00040000UL)
#define DSOGI_PLL_CR_DELAY_TIME_POS (19U)
#define DSOGI_PLL_CR_DELAY_TIME     (0x00F80000UL)
#define DSOGI_PLL_CR_INTC1_EN_POS   (24U)
#define DSOGI_PLL_CR_INTC1_EN       (0x01000000UL)
#define DSOGI_PLL_CR_INTC2_EN_POS   (25U)
#define DSOGI_PLL_CR_INTC2_EN       (0x02000000UL)
#define DSOGI_PLL_CR_LVOL_EN_POS    (26U)
#define DSOGI_PLL_CR_LVOL_EN        (0x04000000UL)
#define DSOGI_PLL_CR_SRST_POS       (27U)
#define DSOGI_PLL_CR_SRST           (0x08000000UL)
#define DSOGI_PLL_CR_VOL_SEL_POS    (28U)
#define DSOGI_PLL_CR_VOL_SEL        (0x30000000UL)
#define DSOGI_PLL_CR_VOL_SEL_0      (0x10000000UL)
#define DSOGI_PLL_CR_VOL_SEL_1      (0x20000000UL)
#define DSOGI_PLL_CR_ADC_GN_POS     (30U)
#define DSOGI_PLL_CR_ADC_GN         (0xC0000000UL)
#define DSOGI_PLL_CR_ADC_GN_0       (0x40000000UL)
#define DSOGI_PLL_CR_ADC_GN_1       (0x80000000UL)

/* Bit definition for DSOGI_PLL_ST register */
#define DSOGI_PLL_ST_RES_POS        (0U)
#define DSOGI_PLL_ST_RES            (0x00000001UL)
#define DSOGI_PLL_ST_PLL_FAIL_POS   (1U)
#define DSOGI_PLL_ST_PLL_FAIL       (0x00000002UL)
#define DSOGI_PLL_ST_INTC1_FLAG_POS (2U)
#define DSOGI_PLL_ST_INTC1_FLAG     (0x00000004UL)
#define DSOGI_PLL_ST_INTC2_FLAG_POS (3U)
#define DSOGI_PLL_ST_INTC2_FLAG     (0x00000008UL)
#define DSOGI_PLL_ST_FP_FLAG_POS    (4U)
#define DSOGI_PLL_ST_FP_FLAG        (0x00000010UL)
#define DSOGI_PLL_ST_HRPWM_ENTA_POS (5U)
#define DSOGI_PLL_ST_HRPWM_ENTA     (0x00000020UL)
#define DSOGI_PLL_ST_HRPWM_ENTB_POS (6U)
#define DSOGI_PLL_ST_HRPWM_ENTB     (0x00000040UL)
#define DSOGI_PLL_ST_SC_FLAG_POS    (7U)
#define DSOGI_PLL_ST_SC_FLAG        (0x00000080UL)

/* Bit definition for DSOGI_PLL_CLARKK register */
#define DSOGI_PLL_CLARKK (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_CLARKAS register */
#define DSOGI_PLL_CLARKAS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_CLARKBS register */
#define DSOGI_PLL_CLARKBS (0xFFFFFFFFUL)

