MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for DSOGI_PLL_CLARKCS register */
#define DSOGI_PLL_CLARKCS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_CLARKDS register */
#define DSOGI_PLL_CLARKDS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_CLARKQS register */
#define DSOGI_PLL_CLARKQS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_CLARKFLTA register */
#define DSOGI_PLL_CLARKFLTA (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_CLARKFLTB register */
#define DSOGI_PLL_CLARKFLTB (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_CLARKFLTC register */
#define DSOGI_PLL_CLARKFLTC (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_K register */
#define DSOGI_PLL_K (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_DK register */
#define DSOGI_PLL_DK (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_QK register */
#define DSOGI_PLL_QK (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_TS register */
#define DSOGI_PLL_TS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_FLLK register */
#define DSOGI_PLL_FLLK (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_FREBASE register */
#define DSOGI_PLL_FREBASE (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_MAX register */
#define DSOGI_PLL_MAX (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_MIN register */
#define DSOGI_PLL_MIN (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_DS register */
#define DSOGI_PLL_DS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_QS register */
#define DSOGI_PLL_QS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_W register */
#define DSOGI_PLL_W (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_ALPHADV register */
#define DSOGI_PLL_ALPHADV (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_ALPHAQV register */
#define DSOGI_PLL_ALPHAQV (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_BETADV register */
#define DSOGI_PLL_BETADV (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_BETAQV register */
#define DSOGI_PLL_BETAQV (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_VGRIDPDS register */
#define DSOGI_PLL_VGRIDPDS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_VGRIDPQS register */
#define DSOGI_PLL_VGRIDPQS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_VGRIDNDS register */
#define DSOGI_PLL_VGRIDNDS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_VGRIDNQS register */
#define DSOGI_PLL_VGRIDNQS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PARKDS register */
#define DSOGI_PLL_PARKDS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PARKQS register */
#define DSOGI_PLL_PARKQS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PARKTHETA register */
#define DSOGI_PLL_PARKTHETA (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PARKDE register */
#define DSOGI_PLL_PARKDE (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PARKQE register */
#define DSOGI_PLL_PARKQE (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PARKSIN register */
#define DSOGI_PLL_PARKSIN (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PARKCOS register */
#define DSOGI_PLL_PARKCOS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLK register */
#define DSOGI_PLL_PLLK (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLKP register */
#define DSOGI_PLL_PLLKP (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLKITS register */
#define DSOGI_PLL_PLLKITS (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLMAX register */
#define DSOGI_PLL_PLLMAX (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLMIN register */
#define DSOGI_PLL_PLLMIN (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLFINISHERRTH register */
#define DSOGI_PLL_PLLFINISHERRTH (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLTHETACMP1 register */
#define DSOGI_PLL_PLLTHETACMP1 (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLTHETACMP2 register */
#define DSOGI_PLL_PLLTHETACMP2 (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLTHETACMP3 register */
#define DSOGI_PLL_PLLTHETACMP3 (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLTHETACMP4 register */
#define DSOGI_PLL_PLLTHETACMP4 (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLVGCMP register */
#define DSOGI_PLL_PLLVGCMP (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLTHETASTEP register */
#define DSOGI_PLL_PLLTHETASTEP (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLDIN register */
#define DSOGI_PLL_PLLDIN (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLW register */
#define DSOGI_PLL_PLLW (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLUP register */
#define DSOGI_PLL_PLLUP (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLUI register */
#define DSOGI_PLL_PLLUI (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLPI register */
#define DSOGI_PLL_PLLPI (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLTHETA register */
#define DSOGI_PLL_PLLTHETA (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLTHETA_PI register */
#define DSOGI_PLL_PLLTHETA_PI (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLFREQ register */
#define DSOGI_PLL_PLLFREQ (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLDINFLT register */
#define DSOGI_PLL_PLLDINFLT (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLSIN register */
#define DSOGI_PLL_PLLSIN (0xFFFFFFFFUL)

/* Bit definition for DSOGI_PLL_PLLCOS register */
#define DSOGI_PLL_PLLCOS (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral EFM
 *******************************************************************************/
/* Bit definition for EFM_FAPRT register */
#define EFM_FAPRT_FAPRT (0x0000FFFFUL)

/* Bit definition for EFM_KEY1 register */
#define EFM_KEY1 (0xFFFFFFFFUL)

/* Bit definition for EFM_KEY2 register */
#define EFM_KEY2 (0xFFFFFFFFUL)

/* Bit definition for EFM_FSTP register */
#define EFM_FSTP_F0STP_POS (0U)
#define EFM_FSTP_F0STP     (0x00000001UL)
#define EFM_FSTP_F1STP_POS (1U)
#define EFM_FSTP_F1STP     (0x00000002UL)

/* Bit definition for EFM_FRMC register */
#define EFM_FRMC_FLWT_POS    (0U)
#define EFM_FRMC_FLWT        (0x0000000FUL)
#define EFM_FRMC_ICACHE_POS  (16U)
#define EFM_FRMC_ICACHE      (0x00010000UL)
#define EFM_FRMC_DCACHE_POS  (17U)
#define EFM_FRMC_DCACHE      (0x00020000UL)
#define EFM_FRMC_PREFETE_POS (18U)
#define EFM_FRMC_PREFETE     (0x00040000UL)
#define EFM_FRMC_CRST_POS    (19U)
#define EFM_FRMC_CRST        (0x00080000UL)

/* Bit definition for EFM_FWMC register */
#define EFM_FWMC_PEMOD_POS      (0U)
#define EFM_FWMC_PEMOD          (0x0000000FUL)
#define EFM_FWMC_BUSHLDCTL_POS  (8U)
#define EFM_FWMC_BUSHLDCTL      (0x00000100UL)
#define EFM_FWMC_BLKECCWSEL_POS (9U)
#define EFM_FWMC_BLKECCWSEL     (0x00000200UL)
#define EFM_FWMC_BLKECCRSEL_POS (10U)
#define EFM_FWMC_BLKECCRSEL     (0x00000400UL)
#define EFM_FWMC_KEY1LOCK_POS   (16U)
#define EFM_FWMC_KEY1LOCK       (0x00010000UL)
#define EFM_FWMC_KEY2LOCK_POS   (17U)
#define EFM_FWMC_KEY2LOCK       (0x00020000UL)

