MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for EFM_FSR register */
#define EFM_FSR_OTPWERR0_POS (0U)
#define EFM_FSR_OTPWERR0     (0x00000001UL)
#define EFM_FSR_PRTWERR0_POS (1U)
#define EFM_FSR_PRTWERR0     (0x00000002UL)
#define EFM_FSR_PGSZERR0_POS (2U)
#define EFM_FSR_PGSZERR0     (0x00000004UL)
#define EFM_FSR_SPSEND0_POS  (3U)
#define EFM_FSR_SPSEND0      (0x00000008UL)
#define EFM_FSR_OPTEND0_POS  (4U)
#define EFM_FSR_OPTEND0      (0x00000010UL)
#define EFM_FSR_COLERR0_POS  (5U)
#define EFM_FSR_COLERR0      (0x00000020UL)
#define EFM_FSR_ECEROF0_POS  (6U)
#define EFM_FSR_ECEROF0      (0x00000040UL)
#define EFM_FSR_BRMER0_POS   (7U)
#define EFM_FSR_BRMER0       (0x00000080UL)
#define EFM_FSR_RDY0_POS     (8U)
#define EFM_FSR_RDY0         (0x00000100UL)
#define EFM_FSR_SWERR0_POS   (9U)
#define EFM_FSR_SWERR0       (0x00000200UL)
#define EFM_FSR_ROWERR0_POS  (10U)
#define EFM_FSR_ROWERR0      (0x00000400UL)
#define EFM_FSR_OTPWERR1_POS (16U)
#define EFM_FSR_OTPWERR1     (0x00010000UL)
#define EFM_FSR_PRTWERR1_POS (17U)
#define EFM_FSR_PRTWERR1     (0x00020000UL)
#define EFM_FSR_PGSZERR1_POS (18U)
#define EFM_FSR_PGSZERR1     (0x00040000UL)
#define EFM_FSR_SPSEND1_POS  (19U)
#define EFM_FSR_SPSEND1      (0x00080000UL)
#define EFM_FSR_OPTEND1_POS  (20U)
#define EFM_FSR_OPTEND1      (0x00100000UL)
#define EFM_FSR_COLERR1_POS  (21U)
#define EFM_FSR_COLERR1      (0x00200000UL)
#define EFM_FSR_ECEROF1_POS  (22U)
#define EFM_FSR_ECEROF1      (0x00400000UL)
#define EFM_FSR_BRMER1_POS   (23U)
#define EFM_FSR_BRMER1       (0x00800000UL)
#define EFM_FSR_RDY1_POS     (24U)
#define EFM_FSR_RDY1         (0x01000000UL)
#define EFM_FSR_SWERR1_POS   (25U)
#define EFM_FSR_SWERR1       (0x02000000UL)
#define EFM_FSR_ROWERR1_POS  (26U)
#define EFM_FSR_ROWERR1      (0x04000000UL)

/* Bit definition for EFM_FSCLR register */
#define EFM_FSCLR_OTPWERRCLR0_POS (0U)
#define EFM_FSCLR_OTPWERRCLR0     (0x00000001UL)
#define EFM_FSCLR_PRTWERRCLR0_POS (1U)
#define EFM_FSCLR_PRTWERRCLR0     (0x00000002UL)
#define EFM_FSCLR_PGSZERRCLR0_POS (2U)
#define EFM_FSCLR_PGSZERRCLR0     (0x00000004UL)
#define EFM_FSCLR_OPTENDCLR0_POS  (4U)
#define EFM_FSCLR_OPTENDCLR0      (0x00000010UL)
#define EFM_FSCLR_COLERRCLR0_POS  (5U)
#define EFM_FSCLR_COLERRCLR0      (0x00000020UL)
#define EFM_FSCLR_ECEROFCLR0_POS  (6U)
#define EFM_FSCLR_ECEROFCLR0      (0x00000040UL)
#define EFM_FSCLR_BRMERCLR0_POS   (7U)
#define EFM_FSCLR_BRMERCLR0       (0x00000080UL)
#define EFM_FSCLR_SWERRCLR0_POS   (9U)
#define EFM_FSCLR_SWERRCLR0       (0x00000200UL)
#define EFM_FSCLR_ROWERRCLR0_POS  (10U)
#define EFM_FSCLR_ROWERRCLR0      (0x00000400UL)
#define EFM_FSCLR_OTPWERRCLR1_POS (16U)
#define EFM_FSCLR_OTPWERRCLR1     (0x00010000UL)
#define EFM_FSCLR_PRTWERRCLR1_POS (17U)
#define EFM_FSCLR_PRTWERRCLR1     (0x00020000UL)
#define EFM_FSCLR_PGSZERRCLR1_POS (18U)
#define EFM_FSCLR_PGSZERRCLR1     (0x00040000UL)
#define EFM_FSCLR_OPTENDCLR1_POS  (20U)
#define EFM_FSCLR_OPTENDCLR1      (0x00100000UL)
#define EFM_FSCLR_COLERRCLR1_POS  (21U)
#define EFM_FSCLR_COLERRCLR1      (0x00200000UL)
#define EFM_FSCLR_ECEROFCLR1_POS  (22U)
#define EFM_FSCLR_ECEROFCLR1      (0x00400000UL)
#define EFM_FSCLR_BRMERCLR1_POS   (23U)
#define EFM_FSCLR_BRMERCLR1       (0x00800000UL)
#define EFM_FSCLR_SWERRCLR1_POS   (25U)
#define EFM_FSCLR_SWERRCLR1       (0x02000000UL)
#define EFM_FSCLR_ROWERRCLR1_POS  (26U)
#define EFM_FSCLR_ROWERRCLR1      (0x04000000UL)

/* Bit definition for EFM_FITE register */
#define EFM_FITE_PEERRITE_POS  (0U)
#define EFM_FITE_PEERRITE      (0x00000001UL)
#define EFM_FITE_OPTENDITE_POS (1U)
#define EFM_FITE_OPTENDITE     (0x00000002UL)
#define EFM_FITE_COLERRITE_POS (2U)
#define EFM_FITE_COLERRITE     (0x00000004UL)

/* Bit definition for EFM_FSWP register */
#define EFM_FSWP_FSWP (0x00000001UL)

/* Bit definition for EFM_FRMC2 register */
#define EFM_FRMC2_BRM0_POS (0U)
#define EFM_FRMC2_BRM0     (0x00000001UL)
#define EFM_FRMC2_BRM1_POS (16U)
#define EFM_FRMC2_BRM1     (0x00010000UL)

/* Bit definition for EFM_FRLTSWP register */
#define EFM_FRLTSWP_RLTSWPC_POS  (0U)
#define EFM_FRLTSWP_RLTSWPC      (0x00000001UL)
#define EFM_FRLTSWP_RLTSWPKW_POS (1U)
#define EFM_FRLTSWP_RLTSWPKW     (0x000000FEUL)

/* Bit definition for EFM_CHIPID register */
#define EFM_CHIPID (0xFFFFFFFFUL)

/* Bit definition for EFM_UQID0 register */
#define EFM_UQID0_Y_LOCATION_POS (0U)
#define EFM_UQID0_Y_LOCATION     (0x000000FFUL)
#define EFM_UQID0_X_LOCATION_POS (8U)
#define EFM_UQID0_X_LOCATION     (0x0000FF00UL)
#define EFM_UQID0_WAFER_ID_POS   (16U)
#define EFM_UQID0_WAFER_ID       (0x00FF0000UL)
#define EFM_UQID0_LOT_ID_POS     (24U)
#define EFM_UQID0_LOT_ID         (0xFF000000UL)

/* Bit definition for EFM_UQID1 register */
#define EFM_UQID1 (0xFFFFFFFFUL)

/* Bit definition for EFM_UQID2 register */
#define EFM_UQID2_LOT_ID (0x000000FFUL)

/* Bit definition for EFM_MMF_REMPRT register */
#define EFM_MMF_REMPRT_MMF_REMPRT (0x0000FFFFUL)

/* Bit definition for EFM_MMF_REMCR register */
#define EFM_MMF_REMCR_RMSIZE_POS  (0U)
#define EFM_MMF_REMCR_RMSIZE      (0x0000001FUL)
#define EFM_MMF_REMCR_RMTADDR_POS (12U)
#define EFM_MMF_REMCR_RMTADDR     (0x1FFFF000UL)
#define EFM_MMF_REMCR_EN_POS      (31U)
#define EFM_MMF_REMCR_EN          (0x80000000UL)

/* Bit definition for EFM_WLOCK register */
#define EFM_WLOCK_WLOCK0_POS (0U)
#define EFM_WLOCK_WLOCK0     (0x00000001UL)
#define EFM_WLOCK_WLOCK4_POS (4U)
#define EFM_WLOCK_WLOCK4     (0x00000010UL)

/* Bit definition for EFM_F0NWPRT register */
#define EFM_F0NWPRT_F0NWPRT0_POS  (0U)
#define EFM_F0NWPRT_F0NWPRT0      (0x00000001UL)
#define EFM_F0NWPRT_F0NWPRT1_POS  (1U)
#define EFM_F0NWPRT_F0NWPRT1      (0x00000002UL)
#define EFM_F0NWPRT_F0NWPRT2_POS  (2U)
#define EFM_F0NWPRT_F0NWPRT2      (0x00000004UL)
#define EFM_F0NWPRT_F0NWPRT3_POS  (3U)
#define EFM_F0NWPRT_F0NWPRT3      (0x00000008UL)
#define EFM_F0NWPRT_F0NWPRT4_POS  (4U)
#define EFM_F0NWPRT_F0NWPRT4      (0x00000010UL)
#define EFM_F0NWPRT_F0NWPRT5_POS  (5U)
#define EFM_F0NWPRT_F0NWPRT5      (0x00000020UL)
#define EFM_F0NWPRT_F0NWPRT6_POS  (6U)
#define EFM_F0NWPRT_F0NWPRT6      (0x00000040UL)
#define EFM_F0NWPRT_F0NWPRT7_POS  (7U)
#define EFM_F0NWPRT_F0NWPRT7      (0x00000080UL)
#define EFM_F0NWPRT_F0NWPRT8_POS  (8U)
#define EFM_F0NWPRT_F0NWPRT8      (0x00000100UL)
#define EFM_F0NWPRT_F0NWPRT9_POS  (9U)
#define EFM_F0NWPRT_F0NWPRT9      (0x00000200UL)
#define EFM_F0NWPRT_F0NWPRT10_POS (10U)
#define EFM_F0NWPRT_F0NWPRT10     (0x00000400UL)
#define EFM_F0NWPRT_F0NWPRT11_POS (11U)
#define EFM_F0NWPRT_F0NWPRT11     (0x00000800UL)
#define EFM_F0NWPRT_F0NWPRT12_POS (12U)
#define EFM_F0NWPRT_F0NWPRT12     (0x00001000UL)
#define EFM_F0NWPRT_F0NWPRT13_POS (13U)
#define EFM_F0NWPRT_F0NWPRT13     (0x00002000UL)
#define EFM_F0NWPRT_F0NWPRT14_POS (14U)
#define EFM_F0NWPRT_F0NWPRT14     (0x00004000UL)
#define EFM_F0NWPRT_F0NWPRT15_POS (15U)
#define EFM_F0NWPRT_F0NWPRT15     (0x00008000UL)
#define EFM_F0NWPRT_F0NWPRT16_POS (16U)
#define EFM_F0NWPRT_F0NWPRT16     (0x00010000UL)
#define EFM_F0NWPRT_F0NWPRT17_POS (17U)
#define EFM_F0NWPRT_F0NWPRT17     (0x00020000UL)
#define EFM_F0NWPRT_F0NWPRT18_POS (18U)
#define EFM_F0NWPRT_F0NWPRT18     (0x00040000UL)
#define EFM_F0NWPRT_F0NWPRT19_POS (19U)
#define EFM_F0NWPRT_F0NWPRT19     (0x00080000UL)
#define EFM_F0NWPRT_F0NWPRT20_POS (20U)
#define EFM_F0NWPRT_F0NWPRT20     (0x00100000UL)
#define EFM_F0NWPRT_F0NWPRT21_POS (21U)
#define EFM_F0NWPRT_F0NWPRT21     (0x00200000UL)
#define EFM_F0NWPRT_F0NWPRT22_POS (22U)
#define EFM_F0NWPRT_F0NWPRT22     (0x00400000UL)
#define EFM_F0NWPRT_F0NWPRT23_POS (23U)
#define EFM_F0NWPRT_F0NWPRT23     (0x00800000UL)
#define EFM_F0NWPRT_F0NWPRT24_POS (24U)
#define EFM_F0NWPRT_F0NWPRT24     (0x01000000UL)
#define EFM_F0NWPRT_F0NWPRT25_POS (25U)
#define EFM_F0NWPRT_F0NWPRT25     (0x02000000UL)
#define EFM_F0NWPRT_F0NWPRT26_POS (26U)
#define EFM_F0NWPRT_F0NWPRT26     (0x04000000UL)
#define EFM_F0NWPRT_F0NWPRT27_POS (27U)
#define EFM_F0NWPRT_F0NWPRT27     (0x08000000UL)
#define EFM_F0NWPRT_F0NWPRT28_POS (28U)
#define EFM_F0NWPRT_F0NWPRT28     (0x10000000UL)
#define EFM_F0NWPRT_F0NWPRT29_POS (29U)
#define EFM_F0NWPRT_F0NWPRT29     (0x20000000UL)
#define EFM_F0NWPRT_F0NWPRT30_POS (30U)
#define EFM_F0NWPRT_F0NWPRT30     (0x40000000UL)
#define EFM_F0NWPRT_F0NWPRT31_POS (31U)
#define EFM_F0NWPRT_F0NWPRT31     (0x80000000UL)

/* Bit definition for EFM_F1NWPRT register */
#define EFM_F1NWPRT_F1NWPRT0_POS  (0U)
#define EFM_F1NWPRT_F1NWPRT0      (0x00000001UL)
#define EFM_F1NWPRT_F1NWPRT1_POS  (1U)
#define EFM_F1NWPRT_F1NWPRT1      (0x00000002UL)
#define EFM_F1NWPRT_F1NWPRT2_POS  (2U)
#define EFM_F1NWPRT_F1NWPRT2      (0x00000004UL)
#define EFM_F1NWPRT_F1NWPRT3_POS  (3U)
#define EFM_F1NWPRT_F1NWPRT3      (0x00000008UL)
#define EFM_F1NWPRT_F1NWPRT4_POS  (4U)
#define EFM_F1NWPRT_F1NWPRT4      (0x00000010UL)
#define EFM_F1NWPRT_F1NWPRT5_POS  (5U)
#define EFM_F1NWPRT_F1NWPRT5      (0x00000020UL)
#define EFM_F1NWPRT_F1NWPRT6_POS  (6U)
#define EFM_F1NWPRT_F1NWPRT6      (0x00000040UL)
#define EFM_F1NWPRT_F1NWPRT7_POS  (7U)
#define EFM_F1NWPRT_F1NWPRT7      (0x00000080UL)
#define EFM_F1NWPRT_F1NWPRT8_POS  (8U)
#define EFM_F1NWPRT_F1NWPRT8      (0x00000100UL)
#define EFM_F1NWPRT_F1NWPRT9_POS  (9U)
#define EFM_F1NWPRT_F1NWPRT9      (0x00000200UL)
#define EFM_F1NWPRT_F1NWPRT10_POS (10U)
#define EFM_F1NWPRT_F1NWPRT10     (0x00000400UL)
#define EFM_F1NWPRT_F1NWPRT11_POS (11U)
#define EFM_F1NWPRT_F1NWPRT11     (0x00000800UL)
#define EFM_F1NWPRT_F1NWPRT12_POS (12U)
#define EFM_F1NWPRT_F1NWPRT12     (0x00001000UL)
#define EFM_F1NWPRT_F1NWPRT13_POS (13U)
#define EFM_F1NWPRT_F1NWPRT13     (0x00002000UL)
#define EFM_F1NWPRT_F1NWPRT14_POS (14U)
#define EFM_F1NWPRT_F1NWPRT14     (0x00004000UL)
#define EFM_F1NWPRT_F1NWPRT15_POS (15U)
#define EFM_F1NWPRT_F1NWPRT15     (0x00008000UL)
#define EFM_F1NWPRT_F1NWPRT16_POS (16U)
#define EFM_F1NWPRT_F1NWPRT16     (0x00010000UL)
#define EFM_F1NWPRT_F1NWPRT17_POS (17U)
#define EFM_F1NWPRT_F1NWPRT17     (0x00020000UL)
#define EFM_F1NWPRT_F1NWPRT18_POS (18U)
#define EFM_F1NWPRT_F1NWPRT18     (0x00040000UL)
#define EFM_F1NWPRT_F1NWPRT19_POS (19U)
#define EFM_F1NWPRT_F1NWPRT19     (0x00080000UL)
#define EFM_F1NWPRT_F1NWPRT20_POS (20U)
#define EFM_F1NWPRT_F1NWPRT20     (0x00100000UL)
#define EFM_F1NWPRT_F1NWPRT21_POS (21U)
#define EFM_F1NWPRT_F1NWPRT21     (0x00200000UL)
#define EFM_F1NWPRT_F1NWPRT22_POS (22U)
#define EFM_F1NWPRT_F1NWPRT22     (0x00400000UL)
#define EFM_F1NWPRT_F1NWPRT23_POS (23U)
#define EFM_F1NWPRT_F1NWPRT23     (0x00800000UL)
#define EFM_F1NWPRT_F1NWPRT24_POS (24U)
#define EFM_F1NWPRT_F1NWPRT24     (0x01000000UL)
#define EFM_F1NWPRT_F1NWPRT25_POS (25U)
#define EFM_F1NWPRT_F1NWPRT25     (0x02000000UL)
#define EFM_F1NWPRT_F1NWPRT26_POS (26U)
#define EFM_F1NWPRT_F1NWPRT26     (0x04000000UL)
#define EFM_F1NWPRT_F1NWPRT27_POS (27U)
#define EFM_F1NWPRT_F1NWPRT27     (0x08000000UL)
#define EFM_F1NWPRT_F1NWPRT28_POS (28U)
#define EFM_F1NWPRT_F1NWPRT28     (0x10000000UL)
#define EFM_F1NWPRT_F1NWPRT29_POS (29U)
#define EFM_F1NWPRT_F1NWPRT29     (0x20000000UL)
#define EFM_F1NWPRT_F1NWPRT30_POS (30U)
#define EFM_F1NWPRT_F1NWPRT30     (0x40000000UL)
#define EFM_F1NWPRT_F1NWPRT31_POS (31U)
#define EFM_F1NWPRT_F1NWPRT31     (0x80000000UL)

/* Bit definition for EFM_CKCR register */
#define EFM_CKCR_F0ECCOAD_POS (0U)
#define EFM_CKCR_F0ECCOAD     (0x00000001UL)
#define EFM_CKCR_F0ECCMOD_POS (8U)
#define EFM_CKCR_F0ECCMOD     (0x00000300UL)
#define EFM_CKCR_F0ECCMOD_0   (0x00000100UL)
#define EFM_CKCR_F0ECCMOD_1   (0x00000200UL)
#define EFM_CKCR_F1ECCOAD_POS (16U)
#define EFM_CKCR_F1ECCOAD     (0x00010000UL)
#define EFM_CKCR_F1ECCMOD_POS (24U)
#define EFM_CKCR_F1ECCMOD     (0x03000000UL)
#define EFM_CKCR_F1ECCMOD_0   (0x01000000UL)
#define EFM_CKCR_F1ECCMOD_1   (0x02000000UL)

/* Bit definition for EFM_CKPR register */
#define EFM_CKPR_CKPRC_POS  (0U)
#define EFM_CKPR_CKPRC      (0x00000001UL)
#define EFM_CKPR_CKPRKW_POS (1U)
#define EFM_CKPR_CKPRKW     (0x000000FEUL)

/* Bit definition for EFM_CKSR register */
#define EFM_CKSR_F0_1ERR_POS (0U)
#define EFM_CKSR_F0_1ERR     (0x00000001UL)
#define EFM_CKSR_F0_2ERR_POS (1U)
#define EFM_CKSR_F0_2ERR     (0x00000002UL)
#define EFM_CKSR_F1_1ERR_POS (16U)
#define EFM_CKSR_F1_1ERR     (0x00010000UL)
#define EFM_CKSR_F1_2ERR_POS (17U)
#define EFM_CKSR_F1_2ERR     (0x00020000UL)

/* Bit definition for EFM_EIEN register */
#define EFM_EIEN_F0_EIEN_POS (0U)
#define EFM_EIEN_F0_EIEN     (0x00000001UL)
#define EFM_EIEN_F1_EIEN_POS (16U)
#define EFM_EIEN_F1_EIEN     (0x00010000UL)

/* Bit definition for EFM_FECCCR register */
#define EFM_FECCCR_GDIS_POS (0U)
#define EFM_FECCCR_GDIS     (0x00000001UL)
#define EFM_FECCCR_VDIS_POS (1U)
#define EFM_FECCCR_VDIS     (0x00000002UL)

/* Bit definition for EFM_FECCDR register */
#define EFM_FECCDR_DWD_POS (0U)
#define EFM_FECCDR_DWD     (0x000001FFUL)
#define EFM_FECCDR_DRD_POS (16U)
#define EFM_FECCDR_DRD     (0x01FF0000UL)

