MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for EFM_FERR0 register */
#define EFM_FERR0_VALID_POS (0U)
#define EFM_FERR0_VALID     (0x00000001UL)
#define EFM_FERR0_FATAL_POS (1U)
#define EFM_FERR0_FATAL     (0x00000002UL)
#define EFM_FERR0_INDEX_POS (4U)
#define EFM_FERR0_INDEX     (0x00FFFFF0UL)

/* Bit definition for EFM_FERR1 register */
#define EFM_FERR1_VALID_POS (0U)
#define EFM_FERR1_VALID     (0x00000001UL)
#define EFM_FERR1_FATAL_POS (1U)
#define EFM_FERR1_FATAL     (0x00000002UL)
#define EFM_FERR1_INDEX_POS (4U)
#define EFM_FERR1_INDEX     (0x00FFFFF0UL)

/* Bit definition for EFM_FEIR0 register */
#define EFM_FEIR0 (0xFFFFFFFFUL)

/* Bit definition for EFM_FEIR1 register */
#define EFM_FEIR1 (0xFFFFFFFFUL)

/* Bit definition for EFM_FEIR2 register */
#define EFM_FEIR2 (0xFFFFFFFFUL)

/* Bit definition for EFM_FEIR3 register */
#define EFM_FEIR3 (0xFFFFFFFFUL)

/* Bit definition for EFM_FEIR4 register */
#define EFM_FEIR4 (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral EMB
 *******************************************************************************/
/* Bit definition for EMB_CTL1 register */
#define EMB_CTL1_CMPEN1_POS        (0U)
#define EMB_CTL1_CMPEN1            (0x00000001UL)
#define EMB_CTL1_CMPEN2_POS        (1U)
#define EMB_CTL1_CMPEN2            (0x00000002UL)
#define EMB_CTL1_CMPEN3_POS        (2U)
#define EMB_CTL1_CMPEN3            (0x00000004UL)
#define EMB_CTL1_CMPEN4_POS        (3U)
#define EMB_CTL1_CMPEN4            (0x00000008UL)
#define EMB_CTL1_SYSEN_POS         (4U)
#define EMB_CTL1_SYSEN             (0x00000010UL)
#define EMB_CTL1_PWMSEN0_POS       (5U)
#define EMB_CTL1_PWMSEN0           (0x00000020UL)
#define EMB_CTL1_PWMSEN1_POS       (6U)
#define EMB_CTL1_PWMSEN1           (0x00000040UL)
#define EMB_CTL1_PWMSEN2_POS       (7U)
#define EMB_CTL1_PWMSEN2           (0x00000080UL)
#define EMB_CTL1_PWMSEN3_POS       (8U)
#define EMB_CTL1_PWMSEN3           (0x00000100UL)
#define EMB_CTL1_PWMSEN4_POS       (9U)
#define EMB_CTL1_PWMSEN4           (0x00000200UL)
#define EMB_CTL1_PWMSEN5_POS       (10U)
#define EMB_CTL1_PWMSEN5           (0x00000400UL)
#define EMB_CTL1_FCMERREN_POS      (15U)
#define EMB_CTL1_FCMERREN          (0x00008000UL)
#define EMB_CTL1_PORTINEN1_POS     (16U)
#define EMB_CTL1_PORTINEN1         (0x00010000UL)
#define EMB_CTL1_PORTINEN2_POS     (17U)
#define EMB_CTL1_PORTINEN2         (0x00020000UL)
#define EMB_CTL1_PORTINEN3_POS     (18U)
#define EMB_CTL1_PORTINEN3         (0x00040000UL)
#define EMB_CTL1_PORTINEN4_POS     (19U)
#define EMB_CTL1_PORTINEN4         (0x00080000UL)
#define EMB_CTL1_PORTINEN5_POS     (20U)
#define EMB_CTL1_PORTINEN5         (0x00100000UL)
#define EMB_CTL1_INVSEL1_POS       (22U)
#define EMB_CTL1_INVSEL1           (0x00400000UL)
#define EMB_CTL1_INVSEL2_POS       (23U)
#define EMB_CTL1_INVSEL2           (0x00800000UL)
#define EMB_CTL1_INVSEL3_POS       (24U)
#define EMB_CTL1_INVSEL3           (0x01000000UL)
#define EMB_CTL1_INVSEL4_POS       (25U)
#define EMB_CTL1_INVSEL4           (0x02000000UL)
#define EMB_CTL1_INVSEL5_POS       (26U)
#define EMB_CTL1_INVSEL5           (0x04000000UL)
#define EMB_CTL1_OSCSTPEN_POS      (27U)
#define EMB_CTL1_OSCSTPEN          (0x08000000UL)
#define EMB_CTL1_SRAMECCERREN_POS  (28U)
#define EMB_CTL1_SRAMECCERREN      (0x10000000UL)
#define EMB_CTL1_FLASHECCERREN_POS (29U)
#define EMB_CTL1_FLASHECCERREN     (0x20000000UL)
#define EMB_CTL1_LOCKUPEN_POS      (30U)
#define EMB_CTL1_LOCKUPEN          (0x40000000UL)
#define EMB_CTL1_PVDEN_POS         (31U)
#define EMB_CTL1_PVDEN             (0x80000000UL)

/* Bit definition for EMB_CTL2 register */
#define EMB_CTL2_PWMLV0_POS   (0U)
#define EMB_CTL2_PWMLV0       (0x00000001UL)
#define EMB_CTL2_PWMLV1_POS   (1U)
#define EMB_CTL2_PWMLV1       (0x00000002UL)
#define EMB_CTL2_PWMLV2_POS   (2U)
#define EMB_CTL2_PWMLV2       (0x00000004UL)
#define EMB_CTL2_PWMLV3_POS   (3U)
#define EMB_CTL2_PWMLV3       (0x00000008UL)
#define EMB_CTL2_PWMLV4_POS   (4U)
#define EMB_CTL2_PWMLV4       (0x00000010UL)
#define EMB_CTL2_PWMLV5_POS   (5U)
#define EMB_CTL2_PWMLV5       (0x00000020UL)
#define EMB_CTL2_NFSEL1_2_POS (10U)
#define EMB_CTL2_NFSEL1_2     (0x00000400UL)
#define EMB_CTL2_NFSEL2_2_POS (11U)
#define EMB_CTL2_NFSEL2_2     (0x00000800UL)
#define EMB_CTL2_NFSEL3_2_POS (12U)
#define EMB_CTL2_NFSEL3_2     (0x00001000UL)
#define EMB_CTL2_NFSEL4_2_POS (13U)
#define EMB_CTL2_NFSEL4_2     (0x00002000UL)
#define EMB_CTL2_NFSEL5_2_POS (14U)
#define EMB_CTL2_NFSEL5_2     (0x00004000UL)
#define EMB_CTL2_NFMD_POS     (15U)
#define EMB_CTL2_NFMD         (0x00008000UL)
#define EMB_CTL2_NFSEL1_POS   (16U)
#define EMB_CTL2_NFSEL1       (0x00030000UL)
#define EMB_CTL2_NFSEL1_0     (0x00010000UL)
#define EMB_CTL2_NFSEL1_1     (0x00020000UL)
#define EMB_CTL2_NFEN1_POS    (18U)
#define EMB_CTL2_NFEN1        (0x00040000UL)
#define EMB_CTL2_NFSEL2_POS   (19U)
#define EMB_CTL2_NFSEL2       (0x00180000UL)
#define EMB_CTL2_NFSEL2_0     (0x00080000UL)
#define EMB_CTL2_NFSEL2_1     (0x00100000UL)
#define EMB_CTL2_NFEN2_POS    (21U)
#define EMB_CTL2_NFEN2        (0x00200000UL)
#define EMB_CTL2_NFSEL3_POS   (22U)
#define EMB_CTL2_NFSEL3       (0x00C00000UL)
#define EMB_CTL2_NFSEL3_0     (0x00400000UL)
#define EMB_CTL2_NFSEL3_1     (0x00800000UL)
#define EMB_CTL2_NFEN3_POS    (24U)
#define EMB_CTL2_NFEN3        (0x01000000UL)
#define EMB_CTL2_NFSEL4_POS   (25U)
#define EMB_CTL2_NFSEL4       (0x06000000UL)
#define EMB_CTL2_NFSEL4_0     (0x02000000UL)
#define EMB_CTL2_NFSEL4_1     (0x04000000UL)
#define EMB_CTL2_NFEN4_POS    (27U)
#define EMB_CTL2_NFEN4        (0x08000000UL)
#define EMB_CTL2_NFSEL5_POS   (28U)
#define EMB_CTL2_NFSEL5       (0x30000000UL)
#define EMB_CTL2_NFSEL5_0     (0x10000000UL)
#define EMB_CTL2_NFSEL5_1     (0x20000000UL)
#define EMB_CTL2_NFEN5_POS    (30U)
#define EMB_CTL2_NFEN5        (0x40000000UL)

/* Bit definition for EMB_SOE register */
#define EMB_SOE_SOE (0x00000001UL)

/* Bit definition for EMB_STAT1 register */
#define EMB_STAT1_PWMSF_POS        (1U)
#define EMB_STAT1_PWMSF            (0x00000002UL)
#define EMB_STAT1_CMPF_POS         (2U)
#define EMB_STAT1_CMPF             (0x00000004UL)
#define EMB_STAT1_SYSF_POS         (3U)
#define EMB_STAT1_SYSF             (0x00000008UL)
#define EMB_STAT1_PWMST_POS        (5U)
#define EMB_STAT1_PWMST            (0x00000020UL)
#define EMB_STAT1_CMPST_POS        (6U)
#define EMB_STAT1_CMPST            (0x00000040UL)
#define EMB_STAT1_SYSST_POS        (7U)
#define EMB_STAT1_SYSST            (0x00000080UL)
#define EMB_STAT1_PORTINF1_POS     (8U)
#define EMB_STAT1_PORTINF1         (0x00000100UL)
#define EMB_STAT1_PORTINF2_POS     (9U)
#define EMB_STAT1_PORTINF2         (0x00000200UL)
#define EMB_STAT1_PORTINF3_POS     (10U)
#define EMB_STAT1_PORTINF3         (0x00000400UL)
#define EMB_STAT1_PORTINF4_POS     (11U)
#define EMB_STAT1_PORTINF4         (0x00000800UL)
#define EMB_STAT1_PORTINF5_POS     (12U)
#define EMB_STAT1_PORTINF5         (0x00001000UL)
#define EMB_STAT1_FCMERRF_POS      (13U)
#define EMB_STAT1_FCMERRF          (0x00002000UL)
#define EMB_STAT1_PORTINST1_POS    (14U)
#define EMB_STAT1_PORTINST1        (0x00004000UL)
#define EMB_STAT1_PORTINST2_POS    (15U)
#define EMB_STAT1_PORTINST2        (0x00008000UL)
#define EMB_STAT1_PORTINST3_POS    (16U)
#define EMB_STAT1_PORTINST3        (0x00010000UL)
#define EMB_STAT1_PORTINST4_POS    (17U)
#define EMB_STAT1_PORTINST4        (0x00020000UL)
#define EMB_STAT1_PORTINST5_POS    (18U)
#define EMB_STAT1_PORTINST5        (0x00040000UL)
#define EMB_STAT1_OSCF_POS         (19U)
#define EMB_STAT1_OSCF             (0x00080000UL)
#define EMB_STAT1_SRAMECCERRF_POS  (20U)
#define EMB_STAT1_SRAMECCERRF      (0x00100000UL)
#define EMB_STAT1_FLASHECCERRF_POS (21U)
#define EMB_STAT1_FLASHECCERRF     (0x00200000UL)
#define EMB_STAT1_LOCKUPF_POS      (22U)
#define EMB_STAT1_LOCKUPF          (0x00400000UL)
#define EMB_STAT1_PVDF_POS         (23U)
#define EMB_STAT1_PVDF             (0x00800000UL)
#define EMB_STAT1_CMP1F_POS        (24U)
#define EMB_STAT1_CMP1F            (0x01000000UL)
#define EMB_STAT1_CMP2F_POS        (25U)
#define EMB_STAT1_CMP2F            (0x02000000UL)
#define EMB_STAT1_CMP3F_POS        (26U)
#define EMB_STAT1_CMP3F            (0x04000000UL)
#define EMB_STAT1_CMP4F_POS        (27U)
#define EMB_STAT1_CMP4F            (0x08000000UL)
#define EMB_STAT1_CMP5F_POS        (28U)
#define EMB_STAT1_CMP5F            (0x10000000UL)
#define EMB_STAT1_CMP6F_POS        (29U)
#define EMB_STAT1_CMP6F            (0x20000000UL)
#define EMB_STAT1_CMP7F_POS        (30U)
#define EMB_STAT1_CMP7F            (0x40000000UL)
#define EMB_STAT1_CMP8F_POS        (31U)
#define EMB_STAT1_CMP8F            (0x80000000UL)

/* Bit definition for EMB_STATCLR register */
#define EMB_STATCLR_PWMSFCLR_POS        (1U)
#define EMB_STATCLR_PWMSFCLR            (0x00000002UL)
#define EMB_STATCLR_CMPFCLR_POS         (2U)
#define EMB_STATCLR_CMPFCLR             (0x00000004UL)
#define EMB_STATCLR_SYSFCLR_POS         (3U)
#define EMB_STATCLR_SYSFCLR             (0x00000008UL)
#define EMB_STATCLR_PORTINFCLR1_POS     (8U)
#define EMB_STATCLR_PORTINFCLR1         (0x00000100UL)
#define EMB_STATCLR_PORTINFCLR2_POS     (9U)
#define EMB_STATCLR_PORTINFCLR2         (0x00000200UL)
#define EMB_STATCLR_PORTINFCLR3_POS     (10U)
#define EMB_STATCLR_PORTINFCLR3         (0x00000400UL)
#define EMB_STATCLR_PORTINFCLR4_POS     (11U)
#define EMB_STATCLR_PORTINFCLR4         (0x00000800UL)
#define EMB_STATCLR_PORTINFCLR5_POS     (12U)
#define EMB_STATCLR_PORTINFCLR5         (0x00001000UL)
#define EMB_STATCLR_PORTINFCLR6_POS     (13U)
#define EMB_STATCLR_PORTINFCLR6         (0x00002000UL)
#define EMB_STATCLR_PORTINFCLR7_POS     (14U)
#define EMB_STATCLR_PORTINFCLR7         (0x00004000UL)
#define EMB_STATCLR_PORTINFCLR8_POS     (15U)
#define EMB_STATCLR_PORTINFCLR8         (0x00008000UL)
#define EMB_STATCLR_PORTINFCLR9_POS     (16U)
#define EMB_STATCLR_PORTINFCLR9         (0x00010000UL)
#define EMB_STATCLR_FCMERRFCLR_POS      (18U)
#define EMB_STATCLR_FCMERRFCLR          (0x00040000UL)
#define EMB_STATCLR_OSCFCLR_POS         (19U)
#define EMB_STATCLR_OSCFCLR             (0x00080000UL)
#define EMB_STATCLR_SRAMECCERRFCLR_POS  (20U)
#define EMB_STATCLR_SRAMECCERRFCLR      (0x00100000UL)
#define EMB_STATCLR_FLASHECCERRFCLR_POS (21U)
#define EMB_STATCLR_FLASHECCERRFCLR     (0x00200000UL)
#define EMB_STATCLR_LOCKUPFCLR_POS      (22U)
#define EMB_STATCLR_LOCKUPFCLR          (0x00400000UL)
#define EMB_STATCLR_PVDFCLR_POS         (23U)
#define EMB_STATCLR_PVDFCLR             (0x00800000UL)
#define EMB_STATCLR_CMP1FCLR_POS        (24U)
#define EMB_STATCLR_CMP1FCLR            (0x01000000UL)
#define EMB_STATCLR_CMP2FCLR_POS        (25U)
#define EMB_STATCLR_CMP2FCLR            (0x02000000UL)
#define EMB_STATCLR_CMP3FCLR_POS        (26U)
#define EMB_STATCLR_CMP3FCLR            (0x04000000UL)
#define EMB_STATCLR_CMP4FCLR_POS        (27U)
#define EMB_STATCLR_CMP4FCLR            (0x08000000UL)
#define EMB_STATCLR_CMP5FCLR_POS        (28U)
#define EMB_STATCLR_CMP5FCLR            (0x10000000UL)
#define EMB_STATCLR_CMP6FCLR_POS        (29U)
#define EMB_STATCLR_CMP6FCLR            (0x20000000UL)
#define EMB_STATCLR_CMP7FCLR_POS        (30U)
#define EMB_STATCLR_CMP7FCLR            (0x40000000UL)
#define EMB_STATCLR_CMP8FCLR_POS        (31U)
#define EMB_STATCLR_CMP8FCLR            (0x80000000UL)

