MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for EMB_INTEN register */
#define EMB_INTEN_PWMSINTEN_POS      (1U)
#define EMB_INTEN_PWMSINTEN          (0x00000002UL)
#define EMB_INTEN_CMPINTEN_POS       (2U)
#define EMB_INTEN_CMPINTEN           (0x00000004UL)
#define EMB_INTEN_SYSINTEN_POS       (3U)
#define EMB_INTEN_SYSINTEN           (0x00000008UL)
#define EMB_INTEN_PORTININTEN1_POS   (8U)
#define EMB_INTEN_PORTININTEN1       (0x00000100UL)
#define EMB_INTEN_PORTININTEN2_POS   (9U)
#define EMB_INTEN_PORTININTEN2       (0x00000200UL)
#define EMB_INTEN_PORTININTEN3_POS   (10U)
#define EMB_INTEN_PORTININTEN3       (0x00000400UL)
#define EMB_INTEN_PORTININTEN4_POS   (11U)
#define EMB_INTEN_PORTININTEN4       (0x00000800UL)
#define EMB_INTEN_PORTININTEN5_POS   (12U)
#define EMB_INTEN_PORTININTEN5       (0x00001000UL)
#define EMB_INTEN_PORTININTEN6_POS   (13U)
#define EMB_INTEN_PORTININTEN6       (0x00002000UL)
#define EMB_INTEN_PORTININTEN7_POS   (14U)
#define EMB_INTEN_PORTININTEN7       (0x00004000UL)
#define EMB_INTEN_PORTININTEN8_POS   (15U)
#define EMB_INTEN_PORTININTEN8       (0x00008000UL)
#define EMB_INTEN_PORTININTEN9_POS   (16U)
#define EMB_INTEN_PORTININTEN9       (0x00010000UL)
#define EMB_INTEN_XBARINTEN_POS      (24U)
#define EMB_INTEN_XBARINTEN          (0x01000000UL)
#define EMB_INTEN_PLAINTEN_POS       (25U)
#define EMB_INTEN_PLAINTEN           (0x02000000UL)
#define EMB_INTEN_DSOGI_PLLINTEN_POS (26U)
#define EMB_INTEN_DSOGI_PLLINTEN     (0x04000000UL)

/* Bit definition for EMB_RLSSEL register */
#define EMB_RLSSEL_PWMRSEL_POS       (1U)
#define EMB_RLSSEL_PWMRSEL           (0x00000002UL)
#define EMB_RLSSEL_CMPRSEL_POS       (2U)
#define EMB_RLSSEL_CMPRSEL           (0x00000004UL)
#define EMB_RLSSEL_SYSRSEL_POS       (3U)
#define EMB_RLSSEL_SYSRSEL           (0x00000008UL)
#define EMB_RLSSEL_PORTINRSEL1_POS   (8U)
#define EMB_RLSSEL_PORTINRSEL1       (0x00000100UL)
#define EMB_RLSSEL_PORTINRSEL2_POS   (9U)
#define EMB_RLSSEL_PORTINRSEL2       (0x00000200UL)
#define EMB_RLSSEL_PORTINRSEL3_POS   (10U)
#define EMB_RLSSEL_PORTINRSEL3       (0x00000400UL)
#define EMB_RLSSEL_PORTINRSEL4_POS   (11U)
#define EMB_RLSSEL_PORTINRSEL4       (0x00000800UL)
#define EMB_RLSSEL_PORTINRSEL5_POS   (12U)
#define EMB_RLSSEL_PORTINRSEL5       (0x00001000UL)
#define EMB_RLSSEL_PORTINRSEL6_POS   (13U)
#define EMB_RLSSEL_PORTINRSEL6       (0x00002000UL)
#define EMB_RLSSEL_PORTINRSEL7_POS   (14U)
#define EMB_RLSSEL_PORTINRSEL7       (0x00004000UL)
#define EMB_RLSSEL_PORTINRSEL8_POS   (15U)
#define EMB_RLSSEL_PORTINRSEL8       (0x00008000UL)
#define EMB_RLSSEL_PORTINRSEL9_POS   (16U)
#define EMB_RLSSEL_PORTINRSEL9       (0x00010000UL)
#define EMB_RLSSEL_XBARRSEL_POS      (24U)
#define EMB_RLSSEL_XBARRSEL          (0x01000000UL)
#define EMB_RLSSEL_PLARSEL_POS       (25U)
#define EMB_RLSSEL_PLARSEL           (0x02000000UL)
#define EMB_RLSSEL_DSOGI_PLLRSEL_POS (26U)
#define EMB_RLSSEL_DSOGI_PLLRSEL     (0x04000000UL)

/* Bit definition for EMB_CTL3 register */
#define EMB_CTL3_PORTINEN6_POS (0U)
#define EMB_CTL3_PORTINEN6     (0x00000001UL)
#define EMB_CTL3_PORTINEN7_POS (1U)
#define EMB_CTL3_PORTINEN7     (0x00000002UL)
#define EMB_CTL3_PORTINEN8_POS (2U)
#define EMB_CTL3_PORTINEN8     (0x00000004UL)
#define EMB_CTL3_PORTINEN9_POS (3U)
#define EMB_CTL3_PORTINEN9     (0x00000008UL)
#define EMB_CTL3_INVSEL6_POS   (5U)
#define EMB_CTL3_INVSEL6       (0x00000020UL)
#define EMB_CTL3_INVSEL7_POS   (6U)
#define EMB_CTL3_INVSEL7       (0x00000040UL)
#define EMB_CTL3_INVSEL8_POS   (7U)
#define EMB_CTL3_INVSEL8       (0x00000080UL)
#define EMB_CTL3_INVSEL9_POS   (8U)
#define EMB_CTL3_INVSEL9       (0x00000100UL)
#define EMB_CTL3_NFSEL6_2_POS  (10U)
#define EMB_CTL3_NFSEL6_2      (0x00000400UL)
#define EMB_CTL3_NFSEL7_2_POS  (11U)
#define EMB_CTL3_NFSEL7_2      (0x00000800UL)
#define EMB_CTL3_NFSEL8_2_POS  (12U)
#define EMB_CTL3_NFSEL8_2      (0x00001000UL)
#define EMB_CTL3_NFSEL9_2_POS  (13U)
#define EMB_CTL3_NFSEL9_2      (0x00002000UL)
#define EMB_CTL3_NFSEL6_POS    (16U)
#define EMB_CTL3_NFSEL6        (0x00030000UL)
#define EMB_CTL3_NFSEL6_0      (0x00010000UL)
#define EMB_CTL3_NFSEL6_1      (0x00020000UL)
#define EMB_CTL3_NFEN6_POS     (18U)
#define EMB_CTL3_NFEN6         (0x00040000UL)
#define EMB_CTL3_NFSEL7_POS    (19U)
#define EMB_CTL3_NFSEL7        (0x00180000UL)
#define EMB_CTL3_NFSEL7_0      (0x00080000UL)
#define EMB_CTL3_NFSEL7_1      (0x00100000UL)
#define EMB_CTL3_NFEN7_POS     (21U)
#define EMB_CTL3_NFEN7         (0x00200000UL)
#define EMB_CTL3_NFSEL8_POS    (22U)
#define EMB_CTL3_NFSEL8        (0x00C00000UL)
#define EMB_CTL3_NFSEL8_0      (0x00400000UL)
#define EMB_CTL3_NFSEL8_1      (0x00800000UL)
#define EMB_CTL3_NFEN8_POS     (24U)
#define EMB_CTL3_NFEN8         (0x01000000UL)
#define EMB_CTL3_NFSEL9_POS    (25U)
#define EMB_CTL3_NFSEL9        (0x06000000UL)
#define EMB_CTL3_NFSEL9_0      (0x02000000UL)
#define EMB_CTL3_NFSEL9_1      (0x04000000UL)
#define EMB_CTL3_NFEN9_POS     (27U)
#define EMB_CTL3_NFEN9         (0x08000000UL)

/* Bit definition for EMB_CTL4 register */
#define EMB_CTL4_CMPEN5_POS      (0U)
#define EMB_CTL4_CMPEN5          (0x00000001UL)
#define EMB_CTL4_CMPEN6_POS      (1U)
#define EMB_CTL4_CMPEN6          (0x00000002UL)
#define EMB_CTL4_CMPEN7_POS      (2U)
#define EMB_CTL4_CMPEN7          (0x00000004UL)
#define EMB_CTL4_CMPEN8_POS      (3U)
#define EMB_CTL4_CMPEN8          (0x00000008UL)
#define EMB_CTL4_DSOGI_PLLEN_POS (7U)
#define EMB_CTL4_DSOGI_PLLEN     (0x00000080UL)
#define EMB_CTL4_XBAREN1_POS     (8U)
#define EMB_CTL4_XBAREN1         (0x00000100UL)
#define EMB_CTL4_XBAREN2_POS     (9U)
#define EMB_CTL4_XBAREN2         (0x00000200UL)
#define EMB_CTL4_XBAREN3_POS     (10U)
#define EMB_CTL4_XBAREN3         (0x00000400UL)
#define EMB_CTL4_XBAREN4_POS     (11U)
#define EMB_CTL4_XBAREN4         (0x00000800UL)
#define EMB_CTL4_XBAREN5_POS     (12U)
#define EMB_CTL4_XBAREN5         (0x00001000UL)
#define EMB_CTL4_XBAREN6_POS     (13U)
#define EMB_CTL4_XBAREN6         (0x00002000UL)
#define EMB_CTL4_XBARISEL1_POS   (20U)
#define EMB_CTL4_XBARISEL1       (0x00100000UL)
#define EMB_CTL4_XBARISEL2_POS   (21U)
#define EMB_CTL4_XBARISEL2       (0x00200000UL)
#define EMB_CTL4_XBARISEL3_POS   (22U)
#define EMB_CTL4_XBARISEL3       (0x00400000UL)
#define EMB_CTL4_XBARISEL4_POS   (23U)
#define EMB_CTL4_XBARISEL4       (0x00800000UL)
#define EMB_CTL4_XBARISEL5_POS   (24U)
#define EMB_CTL4_XBARISEL5       (0x01000000UL)
#define EMB_CTL4_XBARISEL6_POS   (25U)
#define EMB_CTL4_XBARISEL6       (0x02000000UL)

/* Bit definition for EMB_STAT2 register */
#define EMB_STAT2_PORTINF6_POS    (0U)
#define EMB_STAT2_PORTINF6        (0x00000001UL)
#define EMB_STAT2_PORTINF7_POS    (1U)
#define EMB_STAT2_PORTINF7        (0x00000002UL)
#define EMB_STAT2_PORTINF8_POS    (2U)
#define EMB_STAT2_PORTINF8        (0x00000004UL)
#define EMB_STAT2_PORTINF9_POS    (3U)
#define EMB_STAT2_PORTINF9        (0x00000008UL)
#define EMB_STAT2_PORTINST6_POS   (5U)
#define EMB_STAT2_PORTINST6       (0x00000020UL)
#define EMB_STAT2_PORTINST7_POS   (6U)
#define EMB_STAT2_PORTINST7       (0x00000040UL)
#define EMB_STAT2_PORTINST8_POS   (7U)
#define EMB_STAT2_PORTINST8       (0x00000080UL)
#define EMB_STAT2_PORTINST9_POS   (8U)
#define EMB_STAT2_PORTINST9       (0x00000100UL)
#define EMB_STAT2_DSOGI_PLLST_POS (14U)
#define EMB_STAT2_DSOGI_PLLST     (0x00004000UL)
#define EMB_STAT2_DSOGI_PLLF_POS  (15U)
#define EMB_STAT2_DSOGI_PLLF      (0x00008000UL)
#define EMB_STAT2_XBARST1_POS     (16U)
#define EMB_STAT2_XBARST1         (0x00010000UL)
#define EMB_STAT2_XBARST2_POS     (17U)
#define EMB_STAT2_XBARST2         (0x00020000UL)
#define EMB_STAT2_XBARST3_POS     (18U)
#define EMB_STAT2_XBARST3         (0x00040000UL)
#define EMB_STAT2_XBARST4_POS     (19U)
#define EMB_STAT2_XBARST4         (0x00080000UL)
#define EMB_STAT2_XBARST5_POS     (20U)
#define EMB_STAT2_XBARST5         (0x00100000UL)
#define EMB_STAT2_XBARST6_POS     (21U)
#define EMB_STAT2_XBARST6         (0x00200000UL)
#define EMB_STAT2_XBARF1_POS      (24U)
#define EMB_STAT2_XBARF1          (0x01000000UL)
#define EMB_STAT2_XBARF2_POS      (25U)
#define EMB_STAT2_XBARF2          (0x02000000UL)
#define EMB_STAT2_XBARF3_POS      (26U)
#define EMB_STAT2_XBARF3          (0x04000000UL)
#define EMB_STAT2_XBARF4_POS      (27U)
#define EMB_STAT2_XBARF4          (0x08000000UL)
#define EMB_STAT2_XBARF5_POS      (28U)
#define EMB_STAT2_XBARF5          (0x10000000UL)
#define EMB_STAT2_XBARF6_POS      (29U)
#define EMB_STAT2_XBARF6          (0x20000000UL)

/* Bit definition for EMB_STAT3 register */
#define EMB_STAT3_PLAST0_POS  (0U)
#define EMB_STAT3_PLAST0      (0x00000001UL)
#define EMB_STAT3_PLAST1_POS  (1U)
#define EMB_STAT3_PLAST1      (0x00000002UL)
#define EMB_STAT3_PLAST2_POS  (2U)
#define EMB_STAT3_PLAST2      (0x00000004UL)
#define EMB_STAT3_PLAST3_POS  (3U)
#define EMB_STAT3_PLAST3      (0x00000008UL)
#define EMB_STAT3_PLAST4_POS  (4U)
#define EMB_STAT3_PLAST4      (0x00000010UL)
#define EMB_STAT3_PLAST5_POS  (5U)
#define EMB_STAT3_PLAST5      (0x00000020UL)
#define EMB_STAT3_PLAST6_POS  (6U)
#define EMB_STAT3_PLAST6      (0x00000040UL)
#define EMB_STAT3_PLAST7_POS  (7U)
#define EMB_STAT3_PLAST7      (0x00000080UL)
#define EMB_STAT3_PLAST8_POS  (8U)
#define EMB_STAT3_PLAST8      (0x00000100UL)
#define EMB_STAT3_PLAST9_POS  (9U)
#define EMB_STAT3_PLAST9      (0x00000200UL)
#define EMB_STAT3_PLAST10_POS (10U)
#define EMB_STAT3_PLAST10     (0x00000400UL)
#define EMB_STAT3_PLAST11_POS (11U)
#define EMB_STAT3_PLAST11     (0x00000800UL)
#define EMB_STAT3_PLAST12_POS (12U)
#define EMB_STAT3_PLAST12     (0x00001000UL)
#define EMB_STAT3_PLAST13_POS (13U)
#define EMB_STAT3_PLAST13     (0x00002000UL)
#define EMB_STAT3_PLAST14_POS (14U)
#define EMB_STAT3_PLAST14     (0x00004000UL)
#define EMB_STAT3_PLAST15_POS (15U)
#define EMB_STAT3_PLAST15     (0x00008000UL)
#define EMB_STAT3_PLAF0_POS   (16U)
#define EMB_STAT3_PLAF0       (0x00010000UL)
#define EMB_STAT3_PLAF1_POS   (17U)
#define EMB_STAT3_PLAF1       (0x00020000UL)
#define EMB_STAT3_PLAF2_POS   (18U)
#define EMB_STAT3_PLAF2       (0x00040000UL)
#define EMB_STAT3_PLAF3_POS   (19U)
#define EMB_STAT3_PLAF3       (0x00080000UL)
#define EMB_STAT3_PLAF4_POS   (20U)
#define EMB_STAT3_PLAF4       (0x00100000UL)
#define EMB_STAT3_PLAF5_POS   (21U)
#define EMB_STAT3_PLAF5       (0x00200000UL)
#define EMB_STAT3_PLAF6_POS   (22U)
#define EMB_STAT3_PLAF6       (0x00400000UL)
#define EMB_STAT3_PLAF7_POS   (23U)
#define EMB_STAT3_PLAF7       (0x00800000UL)
#define EMB_STAT3_PLAF8_POS   (24U)
#define EMB_STAT3_PLAF8       (0x01000000UL)
#define EMB_STAT3_PLAF9_POS   (25U)
#define EMB_STAT3_PLAF9       (0x02000000UL)
#define EMB_STAT3_PLAF10_POS  (26U)
#define EMB_STAT3_PLAF10      (0x04000000UL)
#define EMB_STAT3_PLAF11_POS  (27U)
#define EMB_STAT3_PLAF11      (0x08000000UL)
#define EMB_STAT3_PLAF12_POS  (28U)
#define EMB_STAT3_PLAF12      (0x10000000UL)
#define EMB_STAT3_PLAF13_POS  (29U)
#define EMB_STAT3_PLAF13      (0x20000000UL)
#define EMB_STAT3_PLAF14_POS  (30U)
#define EMB_STAT3_PLAF14      (0x40000000UL)
#define EMB_STAT3_PLAF15_POS  (31U)
#define EMB_STAT3_PLAF15      (0x80000000UL)

/* Bit definition for EMB_CTL5 register */
#define EMB_CTL5_PLAEN0_POS  (0U)
#define EMB_CTL5_PLAEN0      (0x00000001UL)
#define EMB_CTL5_PLAEN1_POS  (1U)
#define EMB_CTL5_PLAEN1      (0x00000002UL)
#define EMB_CTL5_PLAEN2_POS  (2U)
#define EMB_CTL5_PLAEN2      (0x00000004UL)
#define EMB_CTL5_PLAEN3_POS  (3U)
#define EMB_CTL5_PLAEN3      (0x00000008UL)
#define EMB_CTL5_PLAEN4_POS  (4U)
#define EMB_CTL5_PLAEN4      (0x00000010UL)
#define EMB_CTL5_PLAEN5_POS  (5U)
#define EMB_CTL5_PLAEN5      (0x00000020UL)
#define EMB_CTL5_PLAEN6_POS  (6U)
#define EMB_CTL5_PLAEN6      (0x00000040UL)
#define EMB_CTL5_PLAEN7_POS  (7U)
#define EMB_CTL5_PLAEN7      (0x00000080UL)
#define EMB_CTL5_PLAEN8_POS  (8U)
#define EMB_CTL5_PLAEN8      (0x00000100UL)
#define EMB_CTL5_PLAEN9_POS  (9U)
#define EMB_CTL5_PLAEN9      (0x00000200UL)
#define EMB_CTL5_PLAEN10_POS (10U)
#define EMB_CTL5_PLAEN10     (0x00000400UL)
#define EMB_CTL5_PLAEN11_POS (11U)
#define EMB_CTL5_PLAEN11     (0x00000800UL)
#define EMB_CTL5_PLAEN12_POS (12U)
#define EMB_CTL5_PLAEN12     (0x00001000UL)
#define EMB_CTL5_PLAEN13_POS (13U)
#define EMB_CTL5_PLAEN13     (0x00002000UL)
#define EMB_CTL5_PLAEN14_POS (14U)
#define EMB_CTL5_PLAEN14     (0x00004000UL)
#define EMB_CTL5_PLAEN15_POS (15U)
#define EMB_CTL5_PLAEN15     (0x00008000UL)

/* Bit definition for EMB_CTL6 register */
#define EMB_CTL6_XNFSEL1_POS (0U)
#define EMB_CTL6_XNFSEL1     (0x00000007UL)
#define EMB_CTL6_XNFEN1_POS  (3U)
#define EMB_CTL6_XNFEN1      (0x00000008UL)
#define EMB_CTL6_XNFSEL2_POS (4U)
#define EMB_CTL6_XNFSEL2     (0x00000070UL)
#define EMB_CTL6_XNFEN2_POS  (7U)
#define EMB_CTL6_XNFEN2      (0x00000080UL)
#define EMB_CTL6_XNFSEL3_POS (8U)
#define EMB_CTL6_XNFSEL3     (0x00000700UL)
#define EMB_CTL6_XNFEN3_POS  (11U)
#define EMB_CTL6_XNFEN3      (0x00000800UL)
#define EMB_CTL6_XNFSEL4_POS (12U)
#define EMB_CTL6_XNFSEL4     (0x00007000UL)
#define EMB_CTL6_XNFEN4_POS  (15U)
#define EMB_CTL6_XNFEN4      (0x00008000UL)
#define EMB_CTL6_XNFSEL5_POS (16U)
#define EMB_CTL6_XNFSEL5     (0x00070000UL)
#define EMB_CTL6_XNFEN5_POS  (19U)
#define EMB_CTL6_XNFEN5      (0x00080000UL)
#define EMB_CTL6_XNFSEL6_POS (20U)
#define EMB_CTL6_XNFSEL6     (0x00700000UL)
#define EMB_CTL6_XNFEN6_POS  (23U)
#define EMB_CTL6_XNFEN6      (0x00800000UL)

