MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral ERMU
 *******************************************************************************/
/* Bit definition for ERMU_EOC register */
#define ERMU_EOC_SET_POS (0U)
#define ERMU_EOC_SET     (0x00000001UL)
#define ERMU_EOC_CLR_POS (1U)
#define ERMU_EOC_CLR     (0x00000002UL)
#define ERMU_EOC_CTE_POS (16U)
#define ERMU_EOC_CTE     (0x00010000UL)

/* Bit definition for ERMU_EOS register */
#define ERMU_EOS_EOS_POS (0U)
#define ERMU_EOS_EOS     (0x00000001UL)
#define ERMU_EOS_CTS_POS (16U)
#define ERMU_EOS_CTS     (0x00010000UL)

/* Bit definition for ERMU_EOCTCNT register */
#define ERMU_EOCTCNT_CNT (0x0000FFFFUL)

/* Bit definition for ERMU_EOCTCMP register */
#define ERMU_EOCTCMP_CMP (0x0000FFFFUL)

/* Bit definition for ERMU_EOTTC register */
#define ERMU_EOTTC_TTE (0x00000001UL)

/* Bit definition for ERMU_EOTTCNT register */
#define ERMU_EOTTCNT_CNT (0x0000FFFFUL)

/* Bit definition for ERMU_EOTTCMP register */
#define ERMU_EOTTCMP_CMP (0x0000FFFFUL)

/* Bit definition for ERMU_EOOM0 register */
#define ERMU_EOOM0_OM (0xFFFFFFFFUL)

/* Bit definition for ERMU_EOOM1 register */
#define ERMU_EOOM1_OM (0xFFFFFFFFUL)

/* Bit definition for ERMU_WTC register */
#define ERMU_WTC_WTE_POS (0U)
#define ERMU_WTC_WTE     (0x00000001UL)
#define ERMU_WTC_STP_POS (16U)
#define ERMU_WTC_STP     (0x00010000UL)

/* Bit definition for ERMU_WTS register */
#define ERMU_WTS_WTS (0x00000001UL)

/* Bit definition for ERMU_WTCNT register */
#define ERMU_WTCNT_CNT (0x0000FFFFUL)

/* Bit definition for ERMU_WTCMP register */
#define ERMU_WTCMP_CMP (0x0000FFFFUL)

/* Bit definition for ERMU_WTSE register */
#define ERMU_WTSE_LPISE_POS (0U)
#define ERMU_WTSE_LPISE     (0x00000001UL)
#define ERMU_WTSE_HPISE_POS (16U)
#define ERMU_WTSE_HPISE     (0x00010000UL)

/* Bit definition for ERMU_ESS register */
#define ERMU_ESS_ESS (0xFFFFFFFFUL)

/* Bit definition for ERMU_ESSC register */
#define ERMU_ESSC_ESSC (0xFFFFFFFFUL)

/* Bit definition for ERMU_PET register */
#define ERMU_PET_PET (0xFFFFFFFFUL)

/* Bit definition for ERMU_RE register */
#define ERMU_RE_RE (0xFFFFFFFFUL)

/* Bit definition for ERMU_LPIE register */
#define ERMU_LPIE_LPIE (0xFFFFFFFFUL)

/* Bit definition for ERMU_HPIE register */
#define ERMU_HPIE_HPIE (0xFFFFFFFFUL)

/* Bit definition for ERMU_CCPS register */
#define ERMU_CCPS_PSE_POS (0U)
#define ERMU_CCPS_PSE     (0x00000001UL)
#define ERMU_CCPS_PSS_POS (16U)
#define ERMU_CCPS_PSS     (0xFFFF0000UL)

/*******************************************************************************
                Bit definition for Peripheral FCM
 *******************************************************************************/
/* Bit definition for FCM_LVR register */
#define FCM_LVR_LVR (0x0000FFFFUL)

/* Bit definition for FCM_UVR register */
#define FCM_UVR_UVR (0x0000FFFFUL)

/* Bit definition for FCM_CNTR register */
#define FCM_CNTR_CNTR (0x0000FFFFUL)

/* Bit definition for FCM_MCCR register */
#define FCM_MCCR_MDIVS_POS (0U)
#define FCM_MCCR_MDIVS     (0x00000003UL)
#define FCM_MCCR_MCKS_POS  (4U)
#define FCM_MCCR_MCKS      (0x000000F0UL)

/* Bit definition for FCM_RCCR register */
#define FCM_RCCR_RDIVS_POS  (0U)
#define FCM_RCCR_RDIVS      (0x00000003UL)
#define FCM_RCCR_RCKS_POS   (3U)
#define FCM_RCCR_RCKS       (0x00000078UL)
#define FCM_RCCR_INEXS_POS  (7U)
#define FCM_RCCR_INEXS      (0x00000080UL)
#define FCM_RCCR_DNFS_POS   (8U)
#define FCM_RCCR_DNFS       (0x00000300UL)
#define FCM_RCCR_DNFS_0     (0x00000100UL)
#define FCM_RCCR_DNFS_1     (0x00000200UL)
#define FCM_RCCR_EDGES_POS  (12U)
#define FCM_RCCR_EDGES      (0x00003000UL)
#define FCM_RCCR_EDGES_0    (0x00001000UL)
#define FCM_RCCR_EDGES_1    (0x00002000UL)
#define FCM_RCCR_EXREFE_POS (15U)
#define FCM_RCCR_EXREFE     (0x00008000UL)

/* Bit definition for FCM_RIER register */
#define FCM_RIER_ERRIE_POS    (0U)
#define FCM_RIER_ERRIE        (0x00000001UL)
#define FCM_RIER_MENDIE_POS   (1U)
#define FCM_RIER_MENDIE       (0x00000002UL)
#define FCM_RIER_OVFIE_POS    (2U)
#define FCM_RIER_OVFIE        (0x00000004UL)
#define FCM_RIER_ERRINTRS_POS (4U)
#define FCM_RIER_ERRINTRS     (0x00000010UL)
#define FCM_RIER_ERRRE_POS    (7U)
#define FCM_RIER_ERRRE        (0x00000080UL)

/* Bit definition for FCM_CLR register */
#define FCM_CLR_ERRFCLR_POS  (0U)
#define FCM_CLR_ERRFCLR      (0x00000001UL)
#define FCM_CLR_MENDFCLR_POS (1U)
#define FCM_CLR_MENDFCLR     (0x00000002UL)
#define FCM_CLR_OVFCLR_POS   (2U)
#define FCM_CLR_OVFCLR       (0x00000004UL)

/*******************************************************************************
                Bit definition for Peripheral FCM_COM
 *******************************************************************************/
/* Bit definition for FCM_COM_STR register */
#define FCM_COM_STR_START1_POS (0U)
#define FCM_COM_STR_START1     (0x00000001UL)
#define FCM_COM_STR_START2_POS (1U)
#define FCM_COM_STR_START2     (0x00000002UL)
#define FCM_COM_STR_START3_POS (2U)
#define FCM_COM_STR_START3     (0x00000004UL)
#define FCM_COM_STR_START4_POS (3U)
#define FCM_COM_STR_START4     (0x00000008UL)

/* Bit definition for FCM_COM_SR register */
#define FCM_COM_SR_ERRF1_POS  (0U)
#define FCM_COM_SR_ERRF1      (0x00000001UL)
#define FCM_COM_SR_MENDF1_POS (1U)
#define FCM_COM_SR_MENDF1     (0x00000002UL)
#define FCM_COM_SR_OVF1_POS   (2U)
#define FCM_COM_SR_OVF1       (0x00000004UL)
#define FCM_COM_SR_ERRF2_POS  (3U)
#define FCM_COM_SR_ERRF2      (0x00000008UL)
#define FCM_COM_SR_MENDF2_POS (4U)
#define FCM_COM_SR_MENDF2     (0x00000010UL)
#define FCM_COM_SR_OVF2_POS   (5U)
#define FCM_COM_SR_OVF2       (0x00000020UL)
#define FCM_COM_SR_ERRF3_POS  (6U)
#define FCM_COM_SR_ERRF3      (0x00000040UL)
#define FCM_COM_SR_MENDF3_POS (7U)
#define FCM_COM_SR_MENDF3     (0x00000080UL)
#define FCM_COM_SR_OVF3_POS   (8U)
#define FCM_COM_SR_OVF3       (0x00000100UL)
#define FCM_COM_SR_ERRF4_POS  (9U)
#define FCM_COM_SR_ERRF4      (0x00000200UL)
#define FCM_COM_SR_MENDF4_POS (10U)
#define FCM_COM_SR_MENDF4     (0x00000400UL)
#define FCM_COM_SR_OVF4_POS   (11U)
#define FCM_COM_SR_OVF4       (0x00000800UL)

