MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral FMAC
 *******************************************************************************/
/* Bit definition for FMAC_FIR_CR register */
#define FMAC_FIR_CR_START_POS     (0U)
#define FMAC_FIR_CR_START         (0x00000001UL)
#define FMAC_FIR_CR_SOFT_RST_POS  (1U)
#define FMAC_FIR_CR_SOFT_RST      (0x00000002UL)
#define FMAC_FIR_CR_DATA_CLR_POS  (2U)
#define FMAC_FIR_CR_DATA_CLR      (0x00000004UL)
#define FMAC_FIR_CR_ENABLE_POS    (8U)
#define FMAC_FIR_CR_ENABLE        (0x00000100UL)
#define FMAC_FIR_CR_CAL_MODE_POS  (9U)
#define FMAC_FIR_CR_CAL_MODE      (0x00000200UL)
#define FMAC_FIR_CR_DATA_TYPE_POS (10U)
#define FMAC_FIR_CR_DATA_TYPE     (0x00000400UL)
#define FMAC_FIR_CR_FUNC_POS      (11U)
#define FMAC_FIR_CR_FUNC          (0x00000800UL)
#define FMAC_FIR_CR_TH_EN_POS     (12U)
#define FMAC_FIR_CR_TH_EN         (0x00001000UL)
#define FMAC_FIR_CR_UNRD_PRO_POS  (13U)
#define FMAC_FIR_CR_UNRD_PRO      (0x00002000UL)
#define FMAC_FIR_CR_XSEL_POS      (16U)
#define FMAC_FIR_CR_XSEL          (0x001F0000UL)

/* Bit definition for FMAC_FIR_XWDATA register */
#define FMAC_FIR_XWDATA (0xFFFFFFFFUL)

/* Bit definition for FMAC_FIR_CWDATA register */
#define FMAC_FIR_CWDATA (0xFFFFFFFFUL)

/* Bit definition for FMAC_FIR_PARM register */
#define FMAC_FIR_PARM_COEF_NUM (0x000000FFUL)

/* Bit definition for FMAC_FIR_YRDATA register */
#define FMAC_FIR_YRDATA (0xFFFFFFFFUL)

/* Bit definition for FMAC_FIR_INT_CR register */
#define FMAC_FIR_INT_CR_FIR_DONE_EN (0x00000001UL)

/* Bit definition for FMAC_FIR_STA register */
#define FMAC_FIR_STA_FIR_DATA_RDY_POS  (0U)
#define FMAC_FIR_STA_FIR_DATA_RDY      (0x00000001UL)
#define FMAC_FIR_STA_FIR_START_ERR_POS (1U)
#define FMAC_FIR_STA_FIR_START_ERR     (0x00000002UL)
#define FMAC_FIR_STA_FIR_RUN_POS       (8U)
#define FMAC_FIR_STA_FIR_RUN           (0x00000100UL)
#define FMAC_FIR_STA_FIR_CLR_STA_POS   (9U)
#define FMAC_FIR_STA_FIR_CLR_STA       (0x00000200UL)
#define FMAC_FIR_STA_FIR_RAM0_FULL_POS (10U)
#define FMAC_FIR_STA_FIR_RAM0_FULL     (0x00000400UL)
#define FMAC_FIR_STA_FIR_RAM1_FULL_POS (11U)
#define FMAC_FIR_STA_FIR_RAM1_FULL     (0x00000800UL)
#define FMAC_FIR_STA_FIR_INF_POS       (16U)
#define FMAC_FIR_STA_FIR_INF           (0x00010000UL)
#define FMAC_FIR_STA_FIR_NAN_POS       (17U)
#define FMAC_FIR_STA_FIR_NAN           (0x00020000UL)
#define FMAC_FIR_STA_FIR_OOR_POS       (18U)
#define FMAC_FIR_STA_FIR_OOR           (0x00040000UL)

/* Bit definition for FMAC_FIR_DATA_NUM register */
#define FMAC_FIR_DATA_NUM_RAM0_DATA_NUM_POS (0U)
#define FMAC_FIR_DATA_NUM_RAM0_DATA_NUM     (0x000003FFUL)
#define FMAC_FIR_DATA_NUM_RAM1_DATA_NUM_POS (16U)
#define FMAC_FIR_DATA_NUM_RAM1_DATA_NUM     (0x01FF0000UL)

/* Bit definition for FMAC_FIR_AVG_COEF register */
#define FMAC_FIR_AVG_COEF (0xFFFFFFFFUL)

/* Bit definition for FMAC_FIR_YMAX register */
#define FMAC_FIR_YMAX (0xFFFFFFFFUL)

/* Bit definition for FMAC_FIR_YMIN register */
#define FMAC_FIR_YMIN (0xFFFFFFFFUL)

/* Bit definition for FMAC_FIR_SRADDR register */
#define FMAC_FIR_SRADDR_FIR_SRADDRX_POS (0U)
#define FMAC_FIR_SRADDR_FIR_SRADDRX     (0x000001FFUL)
#define FMAC_FIR_SRADDR_FIR_SRADDRC_POS (16U)
#define FMAC_FIR_SRADDR_FIR_SRADDRC     (0x00FF0000UL)

/* Bit definition for FMAC_FIR_SRDATAX register */
#define FMAC_FIR_SRDATAX (0xFFFFFFFFUL)

/* Bit definition for FMAC_FIR_SRDATAC register */
#define FMAC_FIR_SRDATAC (0xFFFFFFFFUL)

/* Bit definition for FMAC_FIR_HADDR register */
#define FMAC_FIR_HADDR_FIR_HRADDRX_POS (0U)
#define FMAC_FIR_HADDR_FIR_HRADDRX     (0x000001FFUL)
#define FMAC_FIR_HADDR_FIR_HWADDRX_POS (16U)
#define FMAC_FIR_HADDR_FIR_HWADDRX     (0x01FF0000UL)

/* Bit definition for FMAC_IIR_CR1 register */
#define FMAC_IIR_CR1_CH1_START_POS     (0U)
#define FMAC_IIR_CR1_CH1_START         (0x00000001UL)
#define FMAC_IIR_CR1_CH2_START_POS     (1U)
#define FMAC_IIR_CR1_CH2_START         (0x00000002UL)
#define FMAC_IIR_CR1_CH3_START_POS     (2U)
#define FMAC_IIR_CR1_CH3_START         (0x00000004UL)
#define FMAC_IIR_CR1_CH4_START_POS     (3U)
#define FMAC_IIR_CR1_CH4_START         (0x00000008UL)
#define FMAC_IIR_CR1_CH5_START_POS     (4U)
#define FMAC_IIR_CR1_CH5_START         (0x00000010UL)
#define FMAC_IIR_CR1_CH6_START_POS     (5U)
#define FMAC_IIR_CR1_CH6_START         (0x00000020UL)
#define FMAC_IIR_CR1_CH1_CAL_MODE_POS  (8U)
#define FMAC_IIR_CR1_CH1_CAL_MODE      (0x00000100UL)
#define FMAC_IIR_CR1_CH2_CAL_MODE_POS  (9U)
#define FMAC_IIR_CR1_CH2_CAL_MODE      (0x00000200UL)
#define FMAC_IIR_CR1_CH3_CAL_MODE_POS  (10U)
#define FMAC_IIR_CR1_CH3_CAL_MODE      (0x00000400UL)
#define FMAC_IIR_CR1_CH4_CAL_MODE_POS  (11U)
#define FMAC_IIR_CR1_CH4_CAL_MODE      (0x00000800UL)
#define FMAC_IIR_CR1_CH5_CAL_MODE_POS  (12U)
#define FMAC_IIR_CR1_CH5_CAL_MODE      (0x00001000UL)
#define FMAC_IIR_CR1_CH6_CAL_MODE_POS  (13U)
#define FMAC_IIR_CR1_CH6_CAL_MODE      (0x00002000UL)
#define FMAC_IIR_CR1_CH1_DATA_TYPE_POS (16U)
#define FMAC_IIR_CR1_CH1_DATA_TYPE     (0x00010000UL)
#define FMAC_IIR_CR1_CH2_DATA_TYPE_POS (17U)
#define FMAC_IIR_CR1_CH2_DATA_TYPE     (0x00020000UL)
#define FMAC_IIR_CR1_CH3_DATA_TYPE_POS (18U)
#define FMAC_IIR_CR1_CH3_DATA_TYPE     (0x00040000UL)
#define FMAC_IIR_CR1_CH4_DATA_TYPE_POS (19U)
#define FMAC_IIR_CR1_CH4_DATA_TYPE     (0x00080000UL)
#define FMAC_IIR_CR1_CH5_DATA_TYPE_POS (20U)
#define FMAC_IIR_CR1_CH5_DATA_TYPE     (0x00100000UL)
#define FMAC_IIR_CR1_CH6_DATA_TYPE_POS (21U)
#define FMAC_IIR_CR1_CH6_DATA_TYPE     (0x00200000UL)
#define FMAC_IIR_CR1_CH1_ENABLE_POS    (24U)
#define FMAC_IIR_CR1_CH1_ENABLE        (0x01000000UL)
#define FMAC_IIR_CR1_CH2_ENABLE_POS    (25U)
#define FMAC_IIR_CR1_CH2_ENABLE        (0x02000000UL)
#define FMAC_IIR_CR1_CH3_ENABLE_POS    (26U)
#define FMAC_IIR_CR1_CH3_ENABLE        (0x04000000UL)
#define FMAC_IIR_CR1_CH4_ENABLE_POS    (27U)
#define FMAC_IIR_CR1_CH4_ENABLE        (0x08000000UL)
#define FMAC_IIR_CR1_CH5_ENABLE_POS    (28U)
#define FMAC_IIR_CR1_CH5_ENABLE        (0x10000000UL)
#define FMAC_IIR_CR1_CH6_ENABLE_POS    (29U)
#define FMAC_IIR_CR1_CH6_ENABLE        (0x20000000UL)

