MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for FMAC_IIR_CR2 register */
#define FMAC_IIR_CR2_CH1_DCLR_POS     (0U)
#define FMAC_IIR_CR2_CH1_DCLR         (0x00000001UL)
#define FMAC_IIR_CR2_CH2_DCLR_POS     (1U)
#define FMAC_IIR_CR2_CH2_DCLR         (0x00000002UL)
#define FMAC_IIR_CR2_CH3_DCLR_POS     (2U)
#define FMAC_IIR_CR2_CH3_DCLR         (0x00000004UL)
#define FMAC_IIR_CR2_CH4_DCLR_POS     (3U)
#define FMAC_IIR_CR2_CH4_DCLR         (0x00000008UL)
#define FMAC_IIR_CR2_CH5_DCLR_POS     (4U)
#define FMAC_IIR_CR2_CH5_DCLR         (0x00000010UL)
#define FMAC_IIR_CR2_CH6_DCLR_POS     (5U)
#define FMAC_IIR_CR2_CH6_DCLR         (0x00000020UL)
#define FMAC_IIR_CR2_CH1_RST_POS      (8U)
#define FMAC_IIR_CR2_CH1_RST          (0x00000100UL)
#define FMAC_IIR_CR2_CH2_RST_POS      (9U)
#define FMAC_IIR_CR2_CH2_RST          (0x00000200UL)
#define FMAC_IIR_CR2_CH3_RST_POS      (10U)
#define FMAC_IIR_CR2_CH3_RST          (0x00000400UL)
#define FMAC_IIR_CR2_CH4_RST_POS      (11U)
#define FMAC_IIR_CR2_CH4_RST          (0x00000800UL)
#define FMAC_IIR_CR2_CH5_RST_POS      (12U)
#define FMAC_IIR_CR2_CH5_RST          (0x00001000UL)
#define FMAC_IIR_CR2_CH6_RST_POS      (13U)
#define FMAC_IIR_CR2_CH6_RST          (0x00002000UL)
#define FMAC_IIR_CR2_CH1_TH_EN_POS    (16U)
#define FMAC_IIR_CR2_CH1_TH_EN        (0x00010000UL)
#define FMAC_IIR_CR2_CH2_TH_EN_POS    (17U)
#define FMAC_IIR_CR2_CH2_TH_EN        (0x00020000UL)
#define FMAC_IIR_CR2_CH1_UNRD_PRO_POS (24U)
#define FMAC_IIR_CR2_CH1_UNRD_PRO     (0x01000000UL)
#define FMAC_IIR_CR2_CH2_UNRD_PRO_POS (25U)
#define FMAC_IIR_CR2_CH2_UNRD_PRO     (0x02000000UL)
#define FMAC_IIR_CR2_CH3_UNRD_PRO_POS (26U)
#define FMAC_IIR_CR2_CH3_UNRD_PRO     (0x04000000UL)
#define FMAC_IIR_CR2_CH4_UNRD_PRO_POS (27U)
#define FMAC_IIR_CR2_CH4_UNRD_PRO     (0x08000000UL)
#define FMAC_IIR_CR2_CH5_UNRD_PRO_POS (28U)
#define FMAC_IIR_CR2_CH5_UNRD_PRO     (0x10000000UL)
#define FMAC_IIR_CR2_CH6_UNRD_PRO_POS (29U)
#define FMAC_IIR_CR2_CH6_UNRD_PRO     (0x20000000UL)

/* Bit definition for FMAC_IIR_INT_CR register */
#define FMAC_IIR_INT_CR_CH1_DONE_EN_POS (0U)
#define FMAC_IIR_INT_CR_CH1_DONE_EN     (0x00000001UL)
#define FMAC_IIR_INT_CR_CH2_DONE_EN_POS (1U)
#define FMAC_IIR_INT_CR_CH2_DONE_EN     (0x00000002UL)
#define FMAC_IIR_INT_CR_CH3_DONE_EN_POS (2U)
#define FMAC_IIR_INT_CR_CH3_DONE_EN     (0x00000004UL)
#define FMAC_IIR_INT_CR_CH4_DONE_EN_POS (3U)
#define FMAC_IIR_INT_CR_CH4_DONE_EN     (0x00000008UL)
#define FMAC_IIR_INT_CR_CH5_DONE_EN_POS (4U)
#define FMAC_IIR_INT_CR_CH5_DONE_EN     (0x00000010UL)
#define FMAC_IIR_INT_CR_CH6_DONE_EN_POS (5U)
#define FMAC_IIR_INT_CR_CH6_DONE_EN     (0x00000020UL)

/* Bit definition for FMAC_IIR_STA1 register */
#define FMAC_IIR_STA1_CH1_START_ERR_POS (0U)
#define FMAC_IIR_STA1_CH1_START_ERR     (0x00000001UL)
#define FMAC_IIR_STA1_CH2_START_ERR_POS (1U)
#define FMAC_IIR_STA1_CH2_START_ERR     (0x00000002UL)
#define FMAC_IIR_STA1_CH3_START_ERR_POS (2U)
#define FMAC_IIR_STA1_CH3_START_ERR     (0x00000004UL)
#define FMAC_IIR_STA1_CH4_START_ERR_POS (3U)
#define FMAC_IIR_STA1_CH4_START_ERR     (0x00000008UL)
#define FMAC_IIR_STA1_CH5_START_ERR_POS (4U)
#define FMAC_IIR_STA1_CH5_START_ERR     (0x00000010UL)
#define FMAC_IIR_STA1_CH6_START_ERR_POS (5U)
#define FMAC_IIR_STA1_CH6_START_ERR     (0x00000020UL)
#define FMAC_IIR_STA1_CH1_DATA_RDY_POS  (8U)
#define FMAC_IIR_STA1_CH1_DATA_RDY      (0x00000100UL)
#define FMAC_IIR_STA1_CH2_DATA_RDY_POS  (9U)
#define FMAC_IIR_STA1_CH2_DATA_RDY      (0x00000200UL)
#define FMAC_IIR_STA1_CH3_DATA_RDY_POS  (10U)
#define FMAC_IIR_STA1_CH3_DATA_RDY      (0x00000400UL)
#define FMAC_IIR_STA1_CH4_DATA_RDY_POS  (11U)
#define FMAC_IIR_STA1_CH4_DATA_RDY      (0x00000800UL)
#define FMAC_IIR_STA1_CH5_DATA_RDY_POS  (12U)
#define FMAC_IIR_STA1_CH5_DATA_RDY      (0x00001000UL)
#define FMAC_IIR_STA1_CH6_DATA_RDY_POS  (13U)
#define FMAC_IIR_STA1_CH6_DATA_RDY      (0x00002000UL)

/* Bit definition for FMAC_IIR_STA2 register */
#define FMAC_IIR_STA2_CH1_INF_POS (0U)
#define FMAC_IIR_STA2_CH1_INF     (0x00000001UL)
#define FMAC_IIR_STA2_CH2_INF_POS (1U)
#define FMAC_IIR_STA2_CH2_INF     (0x00000002UL)
#define FMAC_IIR_STA2_CH3_INF_POS (2U)
#define FMAC_IIR_STA2_CH3_INF     (0x00000004UL)
#define FMAC_IIR_STA2_CH4_INF_POS (3U)
#define FMAC_IIR_STA2_CH4_INF     (0x00000008UL)
#define FMAC_IIR_STA2_CH5_INF_POS (4U)
#define FMAC_IIR_STA2_CH5_INF     (0x00000010UL)
#define FMAC_IIR_STA2_CH6_INF_POS (5U)
#define FMAC_IIR_STA2_CH6_INF     (0x00000020UL)
#define FMAC_IIR_STA2_CH1_NAN_POS (8U)
#define FMAC_IIR_STA2_CH1_NAN     (0x00000100UL)
#define FMAC_IIR_STA2_CH2_NAN_POS (9U)
#define FMAC_IIR_STA2_CH2_NAN     (0x00000200UL)
#define FMAC_IIR_STA2_CH3_NAN_POS (10U)
#define FMAC_IIR_STA2_CH3_NAN     (0x00000400UL)
#define FMAC_IIR_STA2_CH4_NAN_POS (11U)
#define FMAC_IIR_STA2_CH4_NAN     (0x00000800UL)
#define FMAC_IIR_STA2_CH5_NAN_POS (12U)
#define FMAC_IIR_STA2_CH5_NAN     (0x00001000UL)
#define FMAC_IIR_STA2_CH6_NAN_POS (13U)
#define FMAC_IIR_STA2_CH6_NAN     (0x00002000UL)
#define FMAC_IIR_STA2_CH1_OOR_POS (16U)
#define FMAC_IIR_STA2_CH1_OOR     (0x00010000UL)
#define FMAC_IIR_STA2_CH2_OOR_POS (17U)
#define FMAC_IIR_STA2_CH2_OOR     (0x00020000UL)
#define FMAC_IIR_STA2_CH3_OOR_POS (18U)
#define FMAC_IIR_STA2_CH3_OOR     (0x00040000UL)
#define FMAC_IIR_STA2_CH4_OOR_POS (19U)
#define FMAC_IIR_STA2_CH4_OOR     (0x00080000UL)
#define FMAC_IIR_STA2_CH5_OOR_POS (20U)
#define FMAC_IIR_STA2_CH5_OOR     (0x00100000UL)
#define FMAC_IIR_STA2_CH6_OOR_POS (21U)
#define FMAC_IIR_STA2_CH6_OOR     (0x00200000UL)

/* Bit definition for FMAC_IIR_BUF_STA register */
#define FMAC_IIR_BUF_STA_CH1_XFULL_POS (0U)
#define FMAC_IIR_BUF_STA_CH1_XFULL     (0x00000001UL)
#define FMAC_IIR_BUF_STA_CH2_XFULL_POS (1U)
#define FMAC_IIR_BUF_STA_CH2_XFULL     (0x00000002UL)
#define FMAC_IIR_BUF_STA_CH3_XFULL_POS (2U)
#define FMAC_IIR_BUF_STA_CH3_XFULL     (0x00000004UL)
#define FMAC_IIR_BUF_STA_CH4_XFULL_POS (3U)
#define FMAC_IIR_BUF_STA_CH4_XFULL     (0x00000008UL)
#define FMAC_IIR_BUF_STA_CH5_XFULL_POS (4U)
#define FMAC_IIR_BUF_STA_CH5_XFULL     (0x00000010UL)
#define FMAC_IIR_BUF_STA_CH6_XFULL_POS (5U)
#define FMAC_IIR_BUF_STA_CH6_XFULL     (0x00000020UL)
#define FMAC_IIR_BUF_STA_CH1_YFULL_POS (8U)
#define FMAC_IIR_BUF_STA_CH1_YFULL     (0x00000100UL)
#define FMAC_IIR_BUF_STA_CH2_YFULL_POS (9U)
#define FMAC_IIR_BUF_STA_CH2_YFULL     (0x00000200UL)
#define FMAC_IIR_BUF_STA_CH3_YFULL_POS (10U)
#define FMAC_IIR_BUF_STA_CH3_YFULL     (0x00000400UL)
#define FMAC_IIR_BUF_STA_CH4_YFULL_POS (11U)
#define FMAC_IIR_BUF_STA_CH4_YFULL     (0x00000800UL)
#define FMAC_IIR_BUF_STA_CH5_YFULL_POS (12U)
#define FMAC_IIR_BUF_STA_CH5_YFULL     (0x00001000UL)
#define FMAC_IIR_BUF_STA_CH6_YFULL_POS (13U)
#define FMAC_IIR_BUF_STA_CH6_YFULL     (0x00002000UL)
#define FMAC_IIR_BUF_STA_CH1_CFULL_POS (16U)
#define FMAC_IIR_BUF_STA_CH1_CFULL     (0x00010000UL)
#define FMAC_IIR_BUF_STA_CH2_CFULL_POS (17U)
#define FMAC_IIR_BUF_STA_CH2_CFULL     (0x00020000UL)
#define FMAC_IIR_BUF_STA_CH3_CFULL_POS (18U)
#define FMAC_IIR_BUF_STA_CH3_CFULL     (0x00040000UL)
#define FMAC_IIR_BUF_STA_CH4_CFULL_POS (19U)
#define FMAC_IIR_BUF_STA_CH4_CFULL     (0x00080000UL)
#define FMAC_IIR_BUF_STA_CH5_CFULL_POS (20U)
#define FMAC_IIR_BUF_STA_CH5_CFULL     (0x00100000UL)
#define FMAC_IIR_BUF_STA_CH6_CFULL_POS (21U)
#define FMAC_IIR_BUF_STA_CH6_CFULL     (0x00200000UL)

/* Bit definition for FMAC_IIR_CH1_PARM register */
#define FMAC_IIR_CH1_PARM_X_NUM_POS (0U)
#define FMAC_IIR_CH1_PARM_X_NUM     (0x00000007UL)
#define FMAC_IIR_CH1_PARM_Y_NUM_POS (8U)
#define FMAC_IIR_CH1_PARM_Y_NUM     (0x00000700UL)
#define FMAC_IIR_CH1_PARM_C_NUM_POS (16U)
#define FMAC_IIR_CH1_PARM_C_NUM     (0x000F0000UL)

/* Bit definition for FMAC_IIR_CH2_PARM register */
#define FMAC_IIR_CH2_PARM_X_NUM_POS (0U)
#define FMAC_IIR_CH2_PARM_X_NUM     (0x00000007UL)
#define FMAC_IIR_CH2_PARM_Y_NUM_POS (8U)
#define FMAC_IIR_CH2_PARM_Y_NUM     (0x00000700UL)
#define FMAC_IIR_CH2_PARM_C_NUM_POS (16U)
#define FMAC_IIR_CH2_PARM_C_NUM     (0x000F0000UL)

