MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for FMAC_IIR_CH3_PARM register */
#define FMAC_IIR_CH3_PARM_X_NUM_POS (0U)
#define FMAC_IIR_CH3_PARM_X_NUM     (0x00000007UL)
#define FMAC_IIR_CH3_PARM_Y_NUM_POS (8U)
#define FMAC_IIR_CH3_PARM_Y_NUM     (0x00000700UL)
#define FMAC_IIR_CH3_PARM_C_NUM_POS (16U)
#define FMAC_IIR_CH3_PARM_C_NUM     (0x000F0000UL)

/* Bit definition for FMAC_IIR_CH4_PARM register */
#define FMAC_IIR_CH4_PARM_X_NUM_POS (0U)
#define FMAC_IIR_CH4_PARM_X_NUM     (0x00000007UL)
#define FMAC_IIR_CH4_PARM_Y_NUM_POS (8U)
#define FMAC_IIR_CH4_PARM_Y_NUM     (0x00000700UL)
#define FMAC_IIR_CH4_PARM_C_NUM_POS (16U)
#define FMAC_IIR_CH4_PARM_C_NUM     (0x000F0000UL)

/* Bit definition for FMAC_IIR_CH5_PARM register */
#define FMAC_IIR_CH5_PARM_X_NUM_POS (0U)
#define FMAC_IIR_CH5_PARM_X_NUM     (0x00000007UL)
#define FMAC_IIR_CH5_PARM_Y_NUM_POS (8U)
#define FMAC_IIR_CH5_PARM_Y_NUM     (0x00000700UL)
#define FMAC_IIR_CH5_PARM_C_NUM_POS (16U)
#define FMAC_IIR_CH5_PARM_C_NUM     (0x000F0000UL)

/* Bit definition for FMAC_IIR_CH6_PARM register */
#define FMAC_IIR_CH6_PARM_X_NUM_POS (0U)
#define FMAC_IIR_CH6_PARM_X_NUM     (0x00000007UL)
#define FMAC_IIR_CH6_PARM_Y_NUM_POS (8U)
#define FMAC_IIR_CH6_PARM_Y_NUM     (0x00000700UL)
#define FMAC_IIR_CH6_PARM_C_NUM_POS (16U)
#define FMAC_IIR_CH6_PARM_C_NUM     (0x000F0000UL)

/* Bit definition for FMAC_IIR_YRDATA1 register */
#define FMAC_IIR_YRDATA1 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YRDATA2 register */
#define FMAC_IIR_YRDATA2 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YRDATA3 register */
#define FMAC_IIR_YRDATA3 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YRDATA4 register */
#define FMAC_IIR_YRDATA4 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YRDATA5 register */
#define FMAC_IIR_YRDATA5 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YRDATA6 register */
#define FMAC_IIR_YRDATA6 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_XWDATA1 register */
#define FMAC_IIR_XWDATA1 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_XWDATA2 register */
#define FMAC_IIR_XWDATA2 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_XWDATA3 register */
#define FMAC_IIR_XWDATA3 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_XWDATA4 register */
#define FMAC_IIR_XWDATA4 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_XWDATA5 register */
#define FMAC_IIR_XWDATA5 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_XWDATA6 register */
#define FMAC_IIR_XWDATA6 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_CWDATA1 register */
#define FMAC_IIR_CWDATA1 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_CWDATA2 register */
#define FMAC_IIR_CWDATA2 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_CWDATA3 register */
#define FMAC_IIR_CWDATA3 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_CWDATA4 register */
#define FMAC_IIR_CWDATA4 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_CWDATA5 register */
#define FMAC_IIR_CWDATA5 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_CWDATA6 register */
#define FMAC_IIR_CWDATA6 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YWDATA1 register */
#define FMAC_IIR_YWDATA1 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YWDATA2 register */
#define FMAC_IIR_YWDATA2 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YWDATA3 register */
#define FMAC_IIR_YWDATA3 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YWDATA4 register */
#define FMAC_IIR_YWDATA4 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YWDATA5 register */
#define FMAC_IIR_YWDATA5 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YWDATA6 register */
#define FMAC_IIR_YWDATA6 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YMAX1 register */
#define FMAC_IIR_YMAX1 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YMAX2 register */
#define FMAC_IIR_YMAX2 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YMIN1 register */
#define FMAC_IIR_YMIN1 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_YMIN2 register */
#define FMAC_IIR_YMIN2 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_DATA_CR1 register */
#define FMAC_IIR_DATA_CR1_XSEL (0x0000001FUL)

/* Bit definition for FMAC_IIR_DATA_CR2 register */
#define FMAC_IIR_DATA_CR2_XSEL (0x0000001FUL)

/* Bit definition for FMAC_IIR_DATA_CR3 register */
#define FMAC_IIR_DATA_CR3_XSEL (0x0000001FUL)

/* Bit definition for FMAC_IIR_DATA_CR4 register */
#define FMAC_IIR_DATA_CR4_XSEL (0x0000001FUL)

/* Bit definition for FMAC_IIR_DATA_CR5 register */
#define FMAC_IIR_DATA_CR5_XSEL (0x0000001FUL)

/* Bit definition for FMAC_IIR_DATA_CR6 register */
#define FMAC_IIR_DATA_CR6_XSEL (0x0000001FUL)

/* Bit definition for FMAC_IIR_SRADDR1 register */
#define FMAC_IIR_SRADDR1_IIR_SRADDRX_POS (0U)
#define FMAC_IIR_SRADDR1_IIR_SRADDRX     (0x00000007UL)
#define FMAC_IIR_SRADDR1_IIR_SRADDRY_POS (8U)
#define FMAC_IIR_SRADDR1_IIR_SRADDRY     (0x00000300UL)
#define FMAC_IIR_SRADDR1_IIR_SRADDRY_0   (0x00000100UL)
#define FMAC_IIR_SRADDR1_IIR_SRADDRY_1   (0x00000200UL)
#define FMAC_IIR_SRADDR1_IIR_SRADDRC_POS (16U)
#define FMAC_IIR_SRADDR1_IIR_SRADDRC     (0x000F0000UL)

/* Bit definition for FMAC_IIR_SRADDR2 register */
#define FMAC_IIR_SRADDR2_IIR_SRADDRX_POS (0U)
#define FMAC_IIR_SRADDR2_IIR_SRADDRX     (0x00000007UL)
#define FMAC_IIR_SRADDR2_IIR_SRADDRY_POS (8U)
#define FMAC_IIR_SRADDR2_IIR_SRADDRY     (0x00000300UL)
#define FMAC_IIR_SRADDR2_IIR_SRADDRY_0   (0x00000100UL)
#define FMAC_IIR_SRADDR2_IIR_SRADDRY_1   (0x00000200UL)
#define FMAC_IIR_SRADDR2_IIR_SRADDRC_POS (16U)
#define FMAC_IIR_SRADDR2_IIR_SRADDRC     (0x000F0000UL)

/* Bit definition for FMAC_IIR_SRADDR3 register */
#define FMAC_IIR_SRADDR3_IIR_SRADDRX_POS (0U)
#define FMAC_IIR_SRADDR3_IIR_SRADDRX     (0x00000007UL)
#define FMAC_IIR_SRADDR3_IIR_SRADDRY_POS (8U)
#define FMAC_IIR_SRADDR3_IIR_SRADDRY     (0x00000300UL)
#define FMAC_IIR_SRADDR3_IIR_SRADDRY_0   (0x00000100UL)
#define FMAC_IIR_SRADDR3_IIR_SRADDRY_1   (0x00000200UL)
#define FMAC_IIR_SRADDR3_IIR_SRADDRC_POS (16U)
#define FMAC_IIR_SRADDR3_IIR_SRADDRC     (0x000F0000UL)

/* Bit definition for FMAC_IIR_SRADDR4 register */
#define FMAC_IIR_SRADDR4_IIR_SRADDRX_POS (0U)
#define FMAC_IIR_SRADDR4_IIR_SRADDRX     (0x00000007UL)
#define FMAC_IIR_SRADDR4_IIR_SRADDRY_POS (8U)
#define FMAC_IIR_SRADDR4_IIR_SRADDRY     (0x00000300UL)
#define FMAC_IIR_SRADDR4_IIR_SRADDRY_0   (0x00000100UL)
#define FMAC_IIR_SRADDR4_IIR_SRADDRY_1   (0x00000200UL)
#define FMAC_IIR_SRADDR4_IIR_SRADDRC_POS (16U)
#define FMAC_IIR_SRADDR4_IIR_SRADDRC     (0x000F0000UL)

