MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for FMAC_IIR_SRADDR5 register */
#define FMAC_IIR_SRADDR5_IIR_SRADDRX_POS (0U)
#define FMAC_IIR_SRADDR5_IIR_SRADDRX     (0x00000007UL)
#define FMAC_IIR_SRADDR5_IIR_SRADDRY_POS (8U)
#define FMAC_IIR_SRADDR5_IIR_SRADDRY     (0x00000300UL)
#define FMAC_IIR_SRADDR5_IIR_SRADDRY_0   (0x00000100UL)
#define FMAC_IIR_SRADDR5_IIR_SRADDRY_1   (0x00000200UL)
#define FMAC_IIR_SRADDR5_IIR_SRADDRC_POS (16U)
#define FMAC_IIR_SRADDR5_IIR_SRADDRC     (0x000F0000UL)

/* Bit definition for FMAC_IIR_SRADDR6 register */
#define FMAC_IIR_SRADDR6_IIR_SRADDRX_POS (0U)
#define FMAC_IIR_SRADDR6_IIR_SRADDRX     (0x00000007UL)
#define FMAC_IIR_SRADDR6_IIR_SRADDRY_POS (8U)
#define FMAC_IIR_SRADDR6_IIR_SRADDRY     (0x00000300UL)
#define FMAC_IIR_SRADDR6_IIR_SRADDRY_0   (0x00000100UL)
#define FMAC_IIR_SRADDR6_IIR_SRADDRY_1   (0x00000200UL)
#define FMAC_IIR_SRADDR6_IIR_SRADDRC_POS (16U)
#define FMAC_IIR_SRADDR6_IIR_SRADDRC     (0x000F0000UL)

/* Bit definition for FMAC_IIR_SRDATAX1 register */
#define FMAC_IIR_SRDATAX1 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAX2 register */
#define FMAC_IIR_SRDATAX2 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAX3 register */
#define FMAC_IIR_SRDATAX3 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAX4 register */
#define FMAC_IIR_SRDATAX4 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAX5 register */
#define FMAC_IIR_SRDATAX5 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAX6 register */
#define FMAC_IIR_SRDATAX6 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAC1 register */
#define FMAC_IIR_SRDATAC1 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAC2 register */
#define FMAC_IIR_SRDATAC2 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAC3 register */
#define FMAC_IIR_SRDATAC3 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAC4 register */
#define FMAC_IIR_SRDATAC4 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAC5 register */
#define FMAC_IIR_SRDATAC5 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAC6 register */
#define FMAC_IIR_SRDATAC6 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAY1 register */
#define FMAC_IIR_SRDATAY1 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAY2 register */
#define FMAC_IIR_SRDATAY2 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAY3 register */
#define FMAC_IIR_SRDATAY3 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAY4 register */
#define FMAC_IIR_SRDATAY4 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAY5 register */
#define FMAC_IIR_SRDATAY5 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_SRDATAY6 register */
#define FMAC_IIR_SRDATAY6 (0xFFFFFFFFUL)

/* Bit definition for FMAC_IIR_HADDR1 register */
#define FMAC_IIR_HADDR1_IIR_HRADDRX_POS (0U)
#define FMAC_IIR_HADDR1_IIR_HRADDRX     (0x00000007UL)
#define FMAC_IIR_HADDR1_IIR_HRADDRY_POS (8U)
#define FMAC_IIR_HADDR1_IIR_HRADDRY     (0x00000300UL)
#define FMAC_IIR_HADDR1_IIR_HRADDRY_0   (0x00000100UL)
#define FMAC_IIR_HADDR1_IIR_HRADDRY_1   (0x00000200UL)
#define FMAC_IIR_HADDR1_IIR_HWADDRX_POS (16U)
#define FMAC_IIR_HADDR1_IIR_HWADDRX     (0x00070000UL)

/* Bit definition for FMAC_IIR_HADDR2 register */
#define FMAC_IIR_HADDR2_IIR_HRADDRX_POS (0U)
#define FMAC_IIR_HADDR2_IIR_HRADDRX     (0x00000007UL)
#define FMAC_IIR_HADDR2_IIR_HRADDRY_POS (8U)
#define FMAC_IIR_HADDR2_IIR_HRADDRY     (0x00000300UL)
#define FMAC_IIR_HADDR2_IIR_HRADDRY_0   (0x00000100UL)
#define FMAC_IIR_HADDR2_IIR_HRADDRY_1   (0x00000200UL)
#define FMAC_IIR_HADDR2_IIR_HWADDRX_POS (16U)
#define FMAC_IIR_HADDR2_IIR_HWADDRX     (0x00070000UL)

/* Bit definition for FMAC_IIR_HADDR3 register */
#define FMAC_IIR_HADDR3_IIR_HRADDRX_POS (0U)
#define FMAC_IIR_HADDR3_IIR_HRADDRX     (0x00000007UL)
#define FMAC_IIR_HADDR3_IIR_HRADDRY_POS (8U)
#define FMAC_IIR_HADDR3_IIR_HRADDRY     (0x00000300UL)
#define FMAC_IIR_HADDR3_IIR_HRADDRY_0   (0x00000100UL)
#define FMAC_IIR_HADDR3_IIR_HRADDRY_1   (0x00000200UL)
#define FMAC_IIR_HADDR3_IIR_HWADDRX_POS (16U)
#define FMAC_IIR_HADDR3_IIR_HWADDRX     (0x00070000UL)

/* Bit definition for FMAC_IIR_HADDR4 register */
#define FMAC_IIR_HADDR4_IIR_HRADDRX_POS (0U)
#define FMAC_IIR_HADDR4_IIR_HRADDRX     (0x00000007UL)
#define FMAC_IIR_HADDR4_IIR_HRADDRY_POS (8U)
#define FMAC_IIR_HADDR4_IIR_HRADDRY     (0x00000300UL)
#define FMAC_IIR_HADDR4_IIR_HRADDRY_0   (0x00000100UL)
#define FMAC_IIR_HADDR4_IIR_HRADDRY_1   (0x00000200UL)
#define FMAC_IIR_HADDR4_IIR_HWADDRX_POS (16U)
#define FMAC_IIR_HADDR4_IIR_HWADDRX     (0x00070000UL)

/* Bit definition for FMAC_IIR_HADDR5 register */
#define FMAC_IIR_HADDR5_IIR_HRADDRX_POS (0U)
#define FMAC_IIR_HADDR5_IIR_HRADDRX     (0x00000007UL)
#define FMAC_IIR_HADDR5_IIR_HRADDRY_POS (8U)
#define FMAC_IIR_HADDR5_IIR_HRADDRY     (0x00000300UL)
#define FMAC_IIR_HADDR5_IIR_HRADDRY_0   (0x00000100UL)
#define FMAC_IIR_HADDR5_IIR_HRADDRY_1   (0x00000200UL)
#define FMAC_IIR_HADDR5_IIR_HWADDRX_POS (16U)
#define FMAC_IIR_HADDR5_IIR_HWADDRX     (0x00070000UL)

/* Bit definition for FMAC_IIR_HADDR6 register */
#define FMAC_IIR_HADDR6_IIR_HRADDRX_POS (0U)
#define FMAC_IIR_HADDR6_IIR_HRADDRX     (0x00000007UL)
#define FMAC_IIR_HADDR6_IIR_HRADDRY_POS (8U)
#define FMAC_IIR_HADDR6_IIR_HRADDRY     (0x00000300UL)
#define FMAC_IIR_HADDR6_IIR_HRADDRY_0   (0x00000100UL)
#define FMAC_IIR_HADDR6_IIR_HRADDRY_1   (0x00000200UL)
#define FMAC_IIR_HADDR6_IIR_HWADDRX_POS (16U)
#define FMAC_IIR_HADDR6_IIR_HWADDRX     (0x00070000UL)

/*******************************************************************************
                Bit definition for Peripheral FMAC_ECC
 *******************************************************************************/
/* Bit definition for FMAC_ECC_RAM0_CKCR register */
#define FMAC_ECC_RAM0_CKCR_ECCMOD   (0x00000003UL)
#define FMAC_ECC_RAM0_CKCR_ECCMOD_0 (0x00000001UL)
#define FMAC_ECC_RAM0_CKCR_ECCMOD_1 (0x00000002UL)

/* Bit definition for FMAC_ECC_RAM0_CKSR register */
#define FMAC_ECC_RAM0_CKSR_RAM_1ERR_POS (0U)
#define FMAC_ECC_RAM0_CKSR_RAM_1ERR     (0x00000001UL)
#define FMAC_ECC_RAM0_CKSR_RAM_2ERR_POS (1U)
#define FMAC_ECC_RAM0_CKSR_RAM_2ERR     (0x00000002UL)

/* Bit definition for FMAC_ECC_RAM0_EIEN register */
#define FMAC_ECC_RAM0_EIEN_EIEN (0x00000001UL)

/* Bit definition for FMAC_ECC_RAM0_EIBIT0 register */
#define FMAC_ECC_RAM0_EIBIT0 (0xFFFFFFFFUL)

/* Bit definition for FMAC_ECC_RAM0_EIBIT1 register */
#define FMAC_ECC_RAM0_EIBIT1_EIBIT (0x0000007FUL)

/* Bit definition for FMAC_ECC_RAM0_ECCERRADDR register */
#define FMAC_ECC_RAM0_ECCERRADDR_ECCERRADDR (0x000000FFUL)

/* Bit definition for FMAC_ECC_RAM1_CKCR register */
#define FMAC_ECC_RAM1_CKCR_ECCMOD   (0x00000003UL)
#define FMAC_ECC_RAM1_CKCR_ECCMOD_0 (0x00000001UL)
#define FMAC_ECC_RAM1_CKCR_ECCMOD_1 (0x00000002UL)

/* Bit definition for FMAC_ECC_RAM1_CKSR register */
#define FMAC_ECC_RAM1_CKSR_RAM_1ERR_POS (0U)
#define FMAC_ECC_RAM1_CKSR_RAM_1ERR     (0x00000001UL)
#define FMAC_ECC_RAM1_CKSR_RAM_2ERR_POS (1U)
#define FMAC_ECC_RAM1_CKSR_RAM_2ERR     (0x00000002UL)

/* Bit definition for FMAC_ECC_RAM1_EIEN register */
#define FMAC_ECC_RAM1_EIEN_EIEN (0x00000001UL)

