MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for FMAC_ECC_RAM1_EIBIT0 register */
#define FMAC_ECC_RAM1_EIBIT0 (0xFFFFFFFFUL)

/* Bit definition for FMAC_ECC_RAM1_EIBIT1 register */
#define FMAC_ECC_RAM1_EIBIT1_EIBIT (0x0000007FUL)

/* Bit definition for FMAC_ECC_RAM1_ECCERRADDR register */
#define FMAC_ECC_RAM1_ECCERRADDR_ECCERRADDR (0x000000FFUL)

/*******************************************************************************
                Bit definition for Peripheral GPIO
 *******************************************************************************/
/* Bit definition for GPIO_PIDR register */
#define GPIO_PIDR_PIN00_POS (0U)
#define GPIO_PIDR_PIN00     (0x0001U)
#define GPIO_PIDR_PIN01_POS (1U)
#define GPIO_PIDR_PIN01     (0x0002U)
#define GPIO_PIDR_PIN02_POS (2U)
#define GPIO_PIDR_PIN02     (0x0004U)
#define GPIO_PIDR_PIN03_POS (3U)
#define GPIO_PIDR_PIN03     (0x0008U)
#define GPIO_PIDR_PIN04_POS (4U)
#define GPIO_PIDR_PIN04     (0x0010U)
#define GPIO_PIDR_PIN05_POS (5U)
#define GPIO_PIDR_PIN05     (0x0020U)
#define GPIO_PIDR_PIN06_POS (6U)
#define GPIO_PIDR_PIN06     (0x0040U)
#define GPIO_PIDR_PIN07_POS (7U)
#define GPIO_PIDR_PIN07     (0x0080U)
#define GPIO_PIDR_PIN08_POS (8U)
#define GPIO_PIDR_PIN08     (0x0100U)
#define GPIO_PIDR_PIN09_POS (9U)
#define GPIO_PIDR_PIN09     (0x0200U)
#define GPIO_PIDR_PIN10_POS (10U)
#define GPIO_PIDR_PIN10     (0x0400U)
#define GPIO_PIDR_PIN11_POS (11U)
#define GPIO_PIDR_PIN11     (0x0800U)
#define GPIO_PIDR_PIN12_POS (12U)
#define GPIO_PIDR_PIN12     (0x1000U)
#define GPIO_PIDR_PIN13_POS (13U)
#define GPIO_PIDR_PIN13     (0x2000U)
#define GPIO_PIDR_PIN14_POS (14U)
#define GPIO_PIDR_PIN14     (0x4000U)
#define GPIO_PIDR_PIN15_POS (15U)
#define GPIO_PIDR_PIN15     (0x8000U)

/* Bit definition for GPIO_PODR register */
#define GPIO_PODR_POUT00_POS (0U)
#define GPIO_PODR_POUT00     (0x0001U)
#define GPIO_PODR_POUT01_POS (1U)
#define GPIO_PODR_POUT01     (0x0002U)
#define GPIO_PODR_POUT02_POS (2U)
#define GPIO_PODR_POUT02     (0x0004U)
#define GPIO_PODR_POUT03_POS (3U)
#define GPIO_PODR_POUT03     (0x0008U)
#define GPIO_PODR_POUT04_POS (4U)
#define GPIO_PODR_POUT04     (0x0010U)
#define GPIO_PODR_POUT05_POS (5U)
#define GPIO_PODR_POUT05     (0x0020U)
#define GPIO_PODR_POUT06_POS (6U)
#define GPIO_PODR_POUT06     (0x0040U)
#define GPIO_PODR_POUT07_POS (7U)
#define GPIO_PODR_POUT07     (0x0080U)
#define GPIO_PODR_POUT08_POS (8U)
#define GPIO_PODR_POUT08     (0x0100U)
#define GPIO_PODR_POUT09_POS (9U)
#define GPIO_PODR_POUT09     (0x0200U)
#define GPIO_PODR_POUT10_POS (10U)
#define GPIO_PODR_POUT10     (0x0400U)
#define GPIO_PODR_POUT11_POS (11U)
#define GPIO_PODR_POUT11     (0x0800U)
#define GPIO_PODR_POUT12_POS (12U)
#define GPIO_PODR_POUT12     (0x1000U)
#define GPIO_PODR_POUT13_POS (13U)
#define GPIO_PODR_POUT13     (0x2000U)
#define GPIO_PODR_POUT14_POS (14U)
#define GPIO_PODR_POUT14     (0x4000U)
#define GPIO_PODR_POUT15_POS (15U)
#define GPIO_PODR_POUT15     (0x8000U)

/* Bit definition for GPIO_POER register */
#define GPIO_POER_POUTE00_POS (0U)
#define GPIO_POER_POUTE00     (0x0001U)
#define GPIO_POER_POUTE01_POS (1U)
#define GPIO_POER_POUTE01     (0x0002U)
#define GPIO_POER_POUTE02_POS (2U)
#define GPIO_POER_POUTE02     (0x0004U)
#define GPIO_POER_POUTE03_POS (3U)
#define GPIO_POER_POUTE03     (0x0008U)
#define GPIO_POER_POUTE04_POS (4U)
#define GPIO_POER_POUTE04     (0x0010U)
#define GPIO_POER_POUTE05_POS (5U)
#define GPIO_POER_POUTE05     (0x0020U)
#define GPIO_POER_POUTE06_POS (6U)
#define GPIO_POER_POUTE06     (0x0040U)
#define GPIO_POER_POUTE07_POS (7U)
#define GPIO_POER_POUTE07     (0x0080U)
#define GPIO_POER_POUTE08_POS (8U)
#define GPIO_POER_POUTE08     (0x0100U)
#define GPIO_POER_POUTE09_POS (9U)
#define GPIO_POER_POUTE09     (0x0200U)
#define GPIO_POER_POUTE10_POS (10U)
#define GPIO_POER_POUTE10     (0x0400U)
#define GPIO_POER_POUTE11_POS (11U)
#define GPIO_POER_POUTE11     (0x0800U)
#define GPIO_POER_POUTE12_POS (12U)
#define GPIO_POER_POUTE12     (0x1000U)
#define GPIO_POER_POUTE13_POS (13U)
#define GPIO_POER_POUTE13     (0x2000U)
#define GPIO_POER_POUTE14_POS (14U)
#define GPIO_POER_POUTE14     (0x4000U)
#define GPIO_POER_POUTE15_POS (15U)
#define GPIO_POER_POUTE15     (0x8000U)

/* Bit definition for GPIO_POSR register */
#define GPIO_POSR_POS00_POS (0U)
#define GPIO_POSR_POS00     (0x0001U)
#define GPIO_POSR_POS01_POS (1U)
#define GPIO_POSR_POS01     (0x0002U)
#define GPIO_POSR_POS02_POS (2U)
#define GPIO_POSR_POS02     (0x0004U)
#define GPIO_POSR_POS03_POS (3U)
#define GPIO_POSR_POS03     (0x0008U)
#define GPIO_POSR_POS04_POS (4U)
#define GPIO_POSR_POS04     (0x0010U)
#define GPIO_POSR_POS05_POS (5U)
#define GPIO_POSR_POS05     (0x0020U)
#define GPIO_POSR_POS06_POS (6U)
#define GPIO_POSR_POS06     (0x0040U)
#define GPIO_POSR_POS07_POS (7U)
#define GPIO_POSR_POS07     (0x0080U)
#define GPIO_POSR_POS08_POS (8U)
#define GPIO_POSR_POS08     (0x0100U)
#define GPIO_POSR_POS09_POS (9U)
#define GPIO_POSR_POS09     (0x0200U)
#define GPIO_POSR_POS10_POS (10U)
#define GPIO_POSR_POS10     (0x0400U)
#define GPIO_POSR_POS11_POS (11U)
#define GPIO_POSR_POS11     (0x0800U)
#define GPIO_POSR_POS12_POS (12U)
#define GPIO_POSR_POS12     (0x1000U)
#define GPIO_POSR_POS13_POS (13U)
#define GPIO_POSR_POS13     (0x2000U)
#define GPIO_POSR_POS14_POS (14U)
#define GPIO_POSR_POS14     (0x4000U)
#define GPIO_POSR_POS15_POS (15U)
#define GPIO_POSR_POS15     (0x8000U)

/* Bit definition for GPIO_PORR register */
#define GPIO_PORR_POR00_POS (0U)
#define GPIO_PORR_POR00     (0x0001U)
#define GPIO_PORR_POR01_POS (1U)
#define GPIO_PORR_POR01     (0x0002U)
#define GPIO_PORR_POR02_POS (2U)
#define GPIO_PORR_POR02     (0x0004U)
#define GPIO_PORR_POR03_POS (3U)
#define GPIO_PORR_POR03     (0x0008U)
#define GPIO_PORR_POR04_POS (4U)
#define GPIO_PORR_POR04     (0x0010U)
#define GPIO_PORR_POR05_POS (5U)
#define GPIO_PORR_POR05     (0x0020U)
#define GPIO_PORR_POR06_POS (6U)
#define GPIO_PORR_POR06     (0x0040U)
#define GPIO_PORR_POR07_POS (7U)
#define GPIO_PORR_POR07     (0x0080U)
#define GPIO_PORR_POR08_POS (8U)
#define GPIO_PORR_POR08     (0x0100U)
#define GPIO_PORR_POR09_POS (9U)
#define GPIO_PORR_POR09     (0x0200U)
#define GPIO_PORR_POR10_POS (10U)
#define GPIO_PORR_POR10     (0x0400U)
#define GPIO_PORR_POR11_POS (11U)
#define GPIO_PORR_POR11     (0x0800U)
#define GPIO_PORR_POR12_POS (12U)
#define GPIO_PORR_POR12     (0x1000U)
#define GPIO_PORR_POR13_POS (13U)
#define GPIO_PORR_POR13     (0x2000U)
#define GPIO_PORR_POR14_POS (14U)
#define GPIO_PORR_POR14     (0x4000U)
#define GPIO_PORR_POR15_POS (15U)
#define GPIO_PORR_POR15     (0x8000U)

/* Bit definition for GPIO_POTR register */
#define GPIO_POTR_POT00_POS (0U)
#define GPIO_POTR_POT00     (0x0001U)
#define GPIO_POTR_POT01_POS (1U)
#define GPIO_POTR_POT01     (0x0002U)
#define GPIO_POTR_POT02_POS (2U)
#define GPIO_POTR_POT02     (0x0004U)
#define GPIO_POTR_POT03_POS (3U)
#define GPIO_POTR_POT03     (0x0008U)
#define GPIO_POTR_POT04_POS (4U)
#define GPIO_POTR_POT04     (0x0010U)
#define GPIO_POTR_POT05_POS (5U)
#define GPIO_POTR_POT05     (0x0020U)
#define GPIO_POTR_POT06_POS (6U)
#define GPIO_POTR_POT06     (0x0040U)
#define GPIO_POTR_POT07_POS (7U)
#define GPIO_POTR_POT07     (0x0080U)
#define GPIO_POTR_POT08_POS (8U)
#define GPIO_POTR_POT08     (0x0100U)
#define GPIO_POTR_POT09_POS (9U)
#define GPIO_POTR_POT09     (0x0200U)
#define GPIO_POTR_POT10_POS (10U)
#define GPIO_POTR_POT10     (0x0400U)
#define GPIO_POTR_POT11_POS (11U)
#define GPIO_POTR_POT11     (0x0800U)
#define GPIO_POTR_POT12_POS (12U)
#define GPIO_POTR_POT12     (0x1000U)
#define GPIO_POTR_POT13_POS (13U)
#define GPIO_POTR_POT13     (0x2000U)
#define GPIO_POTR_POT14_POS (14U)
#define GPIO_POTR_POT14     (0x4000U)
#define GPIO_POTR_POT15_POS (15U)
#define GPIO_POTR_POT15     (0x8000U)

