MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for GPIO_PHRPWMSEL register */
#define GPIO_PHRPWMSEL_HRPWMSEL    (0x000FFFFFUL)
#define GPIO_PHRPWMSEL_HRPWMSEL_0  (0x00000001UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_1  (0x00000002UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_2  (0x00000004UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_3  (0x00000008UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_4  (0x00000010UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_5  (0x00000020UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_6  (0x00000040UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_7  (0x00000080UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_8  (0x00000100UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_9  (0x00000200UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_10 (0x00000400UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_11 (0x00000800UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_12 (0x00001000UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_13 (0x00002000UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_14 (0x00004000UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_15 (0x00008000UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_16 (0x00010000UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_17 (0x00020000UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_18 (0x00040000UL)
#define GPIO_PHRPWMSEL_HRPWMSEL_19 (0x00080000UL)

/* Bit definition for GPIO_PHRPWMEX register */
#define GPIO_PHRPWMEX_HRPWMEX (0x000FFFFFUL)

/* Bit definition for GPIO_PSPCR register */
#define GPIO_PSPCR_SPFE (0x001FU)

/* Bit definition for GPIO_PCCR register */
#define GPIO_PCCR_BFSEL_POS (0U)
#define GPIO_PCCR_BFSEL     (0x003FU)
#define GPIO_PCCR_RDWT_POS  (12U)
#define GPIO_PCCR_RDWT      (0x7000U)

/* Bit definition for GPIO_PINAER register */
#define GPIO_PINAER_PINAE (0x007FU)

/* Bit definition for GPIO_PWPR register */
#define GPIO_PWPR_WE_POS (0U)
#define GPIO_PWPR_WE     (0x0001U)
#define GPIO_PWPR_WP_POS (8U)
#define GPIO_PWPR_WP     (0xFF00U)

/* Bit definition for GPIO_PCR register */
#define GPIO_PCR_POUT_POS   (0U)
#define GPIO_PCR_POUT       (0x0001U)
#define GPIO_PCR_POUTE_POS  (1U)
#define GPIO_PCR_POUTE      (0x0002U)
#define GPIO_PCR_NOD_POS    (2U)
#define GPIO_PCR_NOD        (0x0004U)
#define GPIO_PCR_DRV_POS    (4U)
#define GPIO_PCR_DRV        (0x0030U)
#define GPIO_PCR_DRV_0      (0x0010U)
#define GPIO_PCR_DRV_1      (0x0020U)
#define GPIO_PCR_PUU_POS    (6U)
#define GPIO_PCR_PUU        (0x0040U)
#define GPIO_PCR_PUD_POS    (7U)
#define GPIO_PCR_PUD        (0x0080U)
#define GPIO_PCR_PIN_POS    (8U)
#define GPIO_PCR_PIN        (0x0100U)
#define GPIO_PCR_INVE_POS   (9U)
#define GPIO_PCR_INVE       (0x0200U)
#define GPIO_PCR_CINSEL_POS (10U)
#define GPIO_PCR_CINSEL     (0x0400U)
#define GPIO_PCR_INTE_POS   (12U)
#define GPIO_PCR_INTE       (0x1000U)
#define GPIO_PCR_LTE_POS    (14U)
#define GPIO_PCR_LTE        (0x4000U)
#define GPIO_PCR_DDIS_POS   (15U)
#define GPIO_PCR_DDIS       (0x8000U)

/* Bit definition for GPIO_PFSR register */
#define GPIO_PFSR_FSEL_POS (0U)
#define GPIO_PFSR_FSEL     (0x003FU)
#define GPIO_PFSR_BFE_POS  (8U)
#define GPIO_PFSR_BFE      (0x0100U)

/*******************************************************************************
                Bit definition for Peripheral HASH
 *******************************************************************************/
/* Bit definition for HASH_CR register */
#define HASH_CR_START_POS    (0U)
#define HASH_CR_START        (0x00000001UL)
#define HASH_CR_FST_GRP_POS  (1U)
#define HASH_CR_FST_GRP      (0x00000002UL)
#define HASH_CR_KMSG_END_POS (2U)
#define HASH_CR_KMSG_END     (0x00000004UL)
#define HASH_CR_MODE_POS     (4U)
#define HASH_CR_MODE         (0x00000030UL)
#define HASH_CR_MODE_0       (0x00000010UL)
#define HASH_CR_MODE_1       (0x00000020UL)
#define HASH_CR_LKEY_POS     (6U)
#define HASH_CR_LKEY         (0x00000040UL)
#define HASH_CR_BUSY_POS     (8U)
#define HASH_CR_BUSY         (0x00000100UL)
#define HASH_CR_CYC_END_POS  (9U)
#define HASH_CR_CYC_END      (0x00000200UL)
#define HASH_CR_HMAC_END_POS (10U)
#define HASH_CR_HMAC_END     (0x00000400UL)
#define HASH_CR_HCIE_POS     (14U)
#define HASH_CR_HCIE         (0x00004000UL)
#define HASH_CR_HEIE_POS     (15U)
#define HASH_CR_HEIE         (0x00008000UL)
#define HASH_CR_DATATYPE_POS (16U)
#define HASH_CR_DATATYPE     (0x00030000UL)
#define HASH_CR_DATATYPE_0   (0x00010000UL)
#define HASH_CR_DATATYPE_1   (0x00020000UL)

/* Bit definition for HASH_HR7 register */
#define HASH_HR7 (0xFFFFFFFFUL)

/* Bit definition for HASH_HR6 register */
#define HASH_HR6 (0xFFFFFFFFUL)

/* Bit definition for HASH_HR5 register */
#define HASH_HR5 (0xFFFFFFFFUL)

/* Bit definition for HASH_HR4 register */
#define HASH_HR4 (0xFFFFFFFFUL)

/* Bit definition for HASH_HR3 register */
#define HASH_HR3 (0xFFFFFFFFUL)

/* Bit definition for HASH_HR2 register */
#define HASH_HR2 (0xFFFFFFFFUL)

/* Bit definition for HASH_HR1 register */
#define HASH_HR1 (0xFFFFFFFFUL)

/* Bit definition for HASH_HR0 register */
#define HASH_HR0 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR15 register */
#define HASH_DR15 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR14 register */
#define HASH_DR14 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR13 register */
#define HASH_DR13 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR12 register */
#define HASH_DR12 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR11 register */
#define HASH_DR11 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR10 register */
#define HASH_DR10 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR9 register */
#define HASH_DR9 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR8 register */
#define HASH_DR8 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR7 register */
#define HASH_DR7 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR6 register */
#define HASH_DR6 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR5 register */
#define HASH_DR5 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR4 register */
#define HASH_DR4 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR3 register */
#define HASH_DR3 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR2 register */
#define HASH_DR2 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR1 register */
#define HASH_DR1 (0xFFFFFFFFUL)

/* Bit definition for HASH_DR0 register */
#define HASH_DR0 (0xFFFFFFFFUL)

