MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral HRPWM
 *******************************************************************************/
/* Bit definition for HRPWM_CNTER register */
#define HRPWM_CNTER_CNT (0x0001FFFFUL)

/* Bit definition for HRPWM_UPDAR register */
#define HRPWM_UPDAR_UPDA (0x0001FFFFUL)

/* Bit definition for HRPWM_PHSCMP7A register */
#define HRPWM_PHSCMP7A_PHSCMP7A (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP7B register */
#define HRPWM_PHSCMP7B_PHSCMP7B (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP6A register */
#define HRPWM_PHSCMP6A_PHSCMP6A (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP6B register */
#define HRPWM_PHSCMP6B_PHSCMP6B (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP5A register */
#define HRPWM_PHSCMP5A_PHSCMP5A (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP5B register */
#define HRPWM_PHSCMP5B_PHSCMP5B (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP4A register */
#define HRPWM_PHSCMP4A_PHSCMP4A (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP4B register */
#define HRPWM_PHSCMP4B_PHSCMP4B (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP3A register */
#define HRPWM_PHSCMP3A_PHSCMP3A (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP3B register */
#define HRPWM_PHSCMP3B_PHSCMP3B (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP2A register */
#define HRPWM_PHSCMP2A_PHSCMP2A (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP2B register */
#define HRPWM_PHSCMP2B_PHSCMP2B (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP1A register */
#define HRPWM_PHSCMP1A_PHSCMP1A (0x0003FFFFUL)

/* Bit definition for HRPWM_PHSCMP1B register */
#define HRPWM_PHSCMP1B_PHSCMP1B (0x0003FFFFUL)

/* Bit definition for HRPWM_HRPERAR register */
#define HRPWM_HRPERAR_HRPERA (0x0001FFFFUL)

/* Bit definition for HRPWM_HRPERBR register */
#define HRPWM_HRPERBR_HRPERB (0x0001FFFFUL)

/* Bit definition for HRPWM_HRGCMAR register */
#define HRPWM_HRGCMAR_HRGCMA (0x0001FFFFUL)

/* Bit definition for HRPWM_HRGCMCR register */
#define HRPWM_HRGCMCR_HRGCMC (0x0001FFFFUL)

/* Bit definition for HRPWM_HRGCMBR register */
#define HRPWM_HRGCMBR_HRGCMB (0x0001FFFFUL)

/* Bit definition for HRPWM_HRGCMDR register */
#define HRPWM_HRGCMDR_HRGCMD (0x0001FFFFUL)

/* Bit definition for HRPWM_HRGCMER register */
#define HRPWM_HRGCMER_HRGCME (0x0001FFFFUL)

/* Bit definition for HRPWM_HRGCMGR register */
#define HRPWM_HRGCMGR_HRGCMG (0x0001FFFFUL)

/* Bit definition for HRPWM_HRGCMFR register */
#define HRPWM_HRGCMFR_HRGCMF (0x0001FFFFUL)

/* Bit definition for HRPWM_HRGCMHR register */
#define HRPWM_HRGCMHR_HRGCMH (0x0001FFFFUL)

/* Bit definition for HRPWM_SCMAR register */
#define HRPWM_SCMAR_SCMA (0x0001FFFFUL)

/* Bit definition for HRPWM_SCMCR register */
#define HRPWM_SCMCR_SCMC (0x0001FFFFUL)

/* Bit definition for HRPWM_SCMBR register */
#define HRPWM_SCMBR_SCMB (0x0001FFFFUL)

/* Bit definition for HRPWM_SCMDR register */
#define HRPWM_SCMDR_SCMD (0x0001FFFFUL)

/* Bit definition for HRPWM_CAPAR register */
#define HRPWM_CAPAR_CAPA_POS    (0U)
#define HRPWM_CAPAR_CAPA        (0x0001FFFFUL)
#define HRPWM_CAPAR_CAPDIRA_POS (17U)
#define HRPWM_CAPAR_CAPDIRA     (0x00020000UL)

/* Bit definition for HRPWM_CAPBR register */
#define HRPWM_CAPBR_CAPB_POS    (0U)
#define HRPWM_CAPBR_CAPB        (0x0001FFFFUL)
#define HRPWM_CAPBR_CAPDIRB_POS (17U)
#define HRPWM_CAPBR_CAPDIRB     (0x00020000UL)

/* Bit definition for HRPWM_HRDTUAR register */
#define HRPWM_HRDTUAR_HRDTUA (0x0001FFFFUL)

/* Bit definition for HRPWM_HRDTUBR register */
#define HRPWM_HRDTUBR_HRDTUB (0x0001FFFFUL)

/* Bit definition for HRPWM_HRDTDAR register */
#define HRPWM_HRDTDAR_HRDTDA (0x0001FFFFUL)

/* Bit definition for HRPWM_HRDTDBR register */
#define HRPWM_HRDTDBR_HRDTDB (0x0001FFFFUL)

/* Bit definition for HRPWM_EEFOFFSETAR register */
#define HRPWM_EEFOFFSETAR_OFFSET_POS    (0U)
#define HRPWM_EEFOFFSETAR_OFFSET        (0x0001FFFFUL)
#define HRPWM_EEFOFFSETAR_OFFSETDIR_POS (17U)
#define HRPWM_EEFOFFSETAR_OFFSETDIR     (0x00020000UL)

/* Bit definition for HRPWM_EEFOFFSETBR register */
#define HRPWM_EEFOFFSETBR_OFFSET_POS    (0U)
#define HRPWM_EEFOFFSETBR_OFFSET        (0x0001FFFFUL)
#define HRPWM_EEFOFFSETBR_OFFSETDIR_POS (17U)
#define HRPWM_EEFOFFSETBR_OFFSETDIR     (0x00020000UL)

/* Bit definition for HRPWM_EEFWINAR register */
#define HRPWM_EEFWINAR_WIN_POS    (0U)
#define HRPWM_EEFWINAR_WIN        (0x0001FFFFUL)
#define HRPWM_EEFWINAR_WINDIR_POS (17U)
#define HRPWM_EEFWINAR_WINDIR     (0x00020000UL)

/* Bit definition for HRPWM_EEFWINBR register */
#define HRPWM_EEFWINBR_WIN_POS    (0U)
#define HRPWM_EEFWINBR_WIN        (0x0001FFFFUL)
#define HRPWM_EEFWINBR_WINDIR_POS (17U)
#define HRPWM_EEFWINBR_WINDIR     (0x00020000UL)

/* Bit definition for HRPWM_VPERR register */
#define HRPWM_VPERR_SPPERIA_POS (8U)
#define HRPWM_VPERR_SPPERIA     (0x00000100UL)
#define HRPWM_VPERR_SPPERIB_POS (9U)
#define HRPWM_VPERR_SPPERIB     (0x00000200UL)
#define HRPWM_VPERR_OVFPERI_POS (10U)
#define HRPWM_VPERR_OVFPERI     (0x00000400UL)
#define HRPWM_VPERR_UDFPERI_POS (11U)
#define HRPWM_VPERR_UDFPERI     (0x00000800UL)
#define HRPWM_VPERR_PCNTE_POS   (16U)
#define HRPWM_VPERR_PCNTE       (0x00030000UL)
#define HRPWM_VPERR_PCNTE_0     (0x00010000UL)
#define HRPWM_VPERR_PCNTE_1     (0x00020000UL)
#define HRPWM_VPERR_PCNTS_POS   (18U)
#define HRPWM_VPERR_PCNTS       (0x007C0000UL)

/* Bit definition for HRPWM_BVPERR register */
#define HRPWM_BVPERR_PCNTS_POS (18U)
#define HRPWM_BVPERR_PCNTS     (0x007C0000UL)

/* Bit definition for HRPWM_PCNAR1 register */
#define HRPWM_PCNAR1_STACA_POS  (0U)
#define HRPWM_PCNAR1_STACA      (0x00000003UL)
#define HRPWM_PCNAR1_STACA_0    (0x00000001UL)
#define HRPWM_PCNAR1_STACA_1    (0x00000002UL)
#define HRPWM_PCNAR1_STPCA_POS  (2U)
#define HRPWM_PCNAR1_STPCA      (0x0000000CUL)
#define HRPWM_PCNAR1_STPCA_0    (0x00000004UL)
#define HRPWM_PCNAR1_STPCA_1    (0x00000008UL)
#define HRPWM_PCNAR1_OVFCA_POS  (4U)
#define HRPWM_PCNAR1_OVFCA      (0x00000030UL)
#define HRPWM_PCNAR1_OVFCA_0    (0x00000010UL)
#define HRPWM_PCNAR1_OVFCA_1    (0x00000020UL)
#define HRPWM_PCNAR1_UDFCA_POS  (6U)
#define HRPWM_PCNAR1_UDFCA      (0x000000C0UL)
#define HRPWM_PCNAR1_UDFCA_0    (0x00000040UL)
#define HRPWM_PCNAR1_UDFCA_1    (0x00000080UL)
#define HRPWM_PCNAR1_CMAUCA_POS (8U)
#define HRPWM_PCNAR1_CMAUCA     (0x00000300UL)
#define HRPWM_PCNAR1_CMAUCA_0   (0x00000100UL)
#define HRPWM_PCNAR1_CMAUCA_1   (0x00000200UL)
#define HRPWM_PCNAR1_CMADCA_POS (10U)
#define HRPWM_PCNAR1_CMADCA     (0x00000C00UL)
#define HRPWM_PCNAR1_CMADCA_0   (0x00000400UL)
#define HRPWM_PCNAR1_CMADCA_1   (0x00000800UL)
#define HRPWM_PCNAR1_CMBUCA_POS (12U)
#define HRPWM_PCNAR1_CMBUCA     (0x00003000UL)
#define HRPWM_PCNAR1_CMBUCA_0   (0x00001000UL)
#define HRPWM_PCNAR1_CMBUCA_1   (0x00002000UL)
#define HRPWM_PCNAR1_CMBDCA_POS (14U)
#define HRPWM_PCNAR1_CMBDCA     (0x0000C000UL)
#define HRPWM_PCNAR1_CMBDCA_0   (0x00004000UL)
#define HRPWM_PCNAR1_CMBDCA_1   (0x00008000UL)
#define HRPWM_PCNAR1_FORCA_POS  (16U)
#define HRPWM_PCNAR1_FORCA      (0x00030000UL)
#define HRPWM_PCNAR1_FORCA_0    (0x00010000UL)
#define HRPWM_PCNAR1_FORCA_1    (0x00020000UL)
#define HRPWM_PCNAR1_EMBCA_POS  (20U)
#define HRPWM_PCNAR1_EMBCA      (0x00300000UL)
#define HRPWM_PCNAR1_EMBCA_0    (0x00100000UL)
#define HRPWM_PCNAR1_EMBCA_1    (0x00200000UL)
#define HRPWM_PCNAR1_EMBRA_POS  (22U)
#define HRPWM_PCNAR1_EMBRA      (0x00C00000UL)
#define HRPWM_PCNAR1_EMBRA_0    (0x00400000UL)
#define HRPWM_PCNAR1_EMBRA_1    (0x00800000UL)
#define HRPWM_PCNAR1_EMBSA_POS  (24U)
#define HRPWM_PCNAR1_EMBSA      (0x0F000000UL)
#define HRPWM_PCNAR1_OUTENA_POS (28U)
#define HRPWM_PCNAR1_OUTENA     (0x10000000UL)

