MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_BPCNAR1 register */
#define HRPWM_BPCNAR1_STACA_POS  (0U)
#define HRPWM_BPCNAR1_STACA      (0x00000003UL)
#define HRPWM_BPCNAR1_STACA_0    (0x00000001UL)
#define HRPWM_BPCNAR1_STACA_1    (0x00000002UL)
#define HRPWM_BPCNAR1_STPCA_POS  (2U)
#define HRPWM_BPCNAR1_STPCA      (0x0000000CUL)
#define HRPWM_BPCNAR1_STPCA_0    (0x00000004UL)
#define HRPWM_BPCNAR1_STPCA_1    (0x00000008UL)
#define HRPWM_BPCNAR1_OVFCA_POS  (4U)
#define HRPWM_BPCNAR1_OVFCA      (0x00000030UL)
#define HRPWM_BPCNAR1_OVFCA_0    (0x00000010UL)
#define HRPWM_BPCNAR1_OVFCA_1    (0x00000020UL)
#define HRPWM_BPCNAR1_UDFCA_POS  (6U)
#define HRPWM_BPCNAR1_UDFCA      (0x000000C0UL)
#define HRPWM_BPCNAR1_UDFCA_0    (0x00000040UL)
#define HRPWM_BPCNAR1_UDFCA_1    (0x00000080UL)
#define HRPWM_BPCNAR1_CMAUCA_POS (8U)
#define HRPWM_BPCNAR1_CMAUCA     (0x00000300UL)
#define HRPWM_BPCNAR1_CMAUCA_0   (0x00000100UL)
#define HRPWM_BPCNAR1_CMAUCA_1   (0x00000200UL)
#define HRPWM_BPCNAR1_CMADCA_POS (10U)
#define HRPWM_BPCNAR1_CMADCA     (0x00000C00UL)
#define HRPWM_BPCNAR1_CMADCA_0   (0x00000400UL)
#define HRPWM_BPCNAR1_CMADCA_1   (0x00000800UL)
#define HRPWM_BPCNAR1_CMBUCA_POS (12U)
#define HRPWM_BPCNAR1_CMBUCA     (0x00003000UL)
#define HRPWM_BPCNAR1_CMBUCA_0   (0x00001000UL)
#define HRPWM_BPCNAR1_CMBUCA_1   (0x00002000UL)
#define HRPWM_BPCNAR1_CMBDCA_POS (14U)
#define HRPWM_BPCNAR1_CMBDCA     (0x0000C000UL)
#define HRPWM_BPCNAR1_CMBDCA_0   (0x00004000UL)
#define HRPWM_BPCNAR1_CMBDCA_1   (0x00008000UL)
#define HRPWM_BPCNAR1_FORCA_POS  (16U)
#define HRPWM_BPCNAR1_FORCA      (0x00030000UL)
#define HRPWM_BPCNAR1_FORCA_0    (0x00010000UL)
#define HRPWM_BPCNAR1_FORCA_1    (0x00020000UL)
#define HRPWM_BPCNAR1_EMBCA_POS  (20U)
#define HRPWM_BPCNAR1_EMBCA      (0x00300000UL)
#define HRPWM_BPCNAR1_EMBCA_0    (0x00100000UL)
#define HRPWM_BPCNAR1_EMBCA_1    (0x00200000UL)
#define HRPWM_BPCNAR1_EMBRA_POS  (22U)
#define HRPWM_BPCNAR1_EMBRA      (0x00C00000UL)
#define HRPWM_BPCNAR1_EMBRA_0    (0x00400000UL)
#define HRPWM_BPCNAR1_EMBRA_1    (0x00800000UL)
#define HRPWM_BPCNAR1_EMBSA_POS  (24U)
#define HRPWM_BPCNAR1_EMBSA      (0x0F000000UL)
#define HRPWM_BPCNAR1_OUTENA_POS (28U)
#define HRPWM_BPCNAR1_OUTENA     (0x10000000UL)

/* Bit definition for HRPWM_PCNAR2 register */
#define HRPWM_PCNAR2_EXEV1UCA_POS  (0U)
#define HRPWM_PCNAR2_EXEV1UCA      (0x00000003UL)
#define HRPWM_PCNAR2_EXEV1UCA_0    (0x00000001UL)
#define HRPWM_PCNAR2_EXEV1UCA_1    (0x00000002UL)
#define HRPWM_PCNAR2_EXEV2UCA_POS  (2U)
#define HRPWM_PCNAR2_EXEV2UCA      (0x0000000CUL)
#define HRPWM_PCNAR2_EXEV2UCA_0    (0x00000004UL)
#define HRPWM_PCNAR2_EXEV2UCA_1    (0x00000008UL)
#define HRPWM_PCNAR2_EXEV3UCA_POS  (4U)
#define HRPWM_PCNAR2_EXEV3UCA      (0x00000030UL)
#define HRPWM_PCNAR2_EXEV3UCA_0    (0x00000010UL)
#define HRPWM_PCNAR2_EXEV3UCA_1    (0x00000020UL)
#define HRPWM_PCNAR2_EXEV4UCA_POS  (6U)
#define HRPWM_PCNAR2_EXEV4UCA      (0x000000C0UL)
#define HRPWM_PCNAR2_EXEV4UCA_0    (0x00000040UL)
#define HRPWM_PCNAR2_EXEV4UCA_1    (0x00000080UL)
#define HRPWM_PCNAR2_EXEV5UCA_POS  (8U)
#define HRPWM_PCNAR2_EXEV5UCA      (0x00000300UL)
#define HRPWM_PCNAR2_EXEV5UCA_0    (0x00000100UL)
#define HRPWM_PCNAR2_EXEV5UCA_1    (0x00000200UL)
#define HRPWM_PCNAR2_EXEV6UCA_POS  (10U)
#define HRPWM_PCNAR2_EXEV6UCA      (0x00000C00UL)
#define HRPWM_PCNAR2_EXEV6UCA_0    (0x00000400UL)
#define HRPWM_PCNAR2_EXEV6UCA_1    (0x00000800UL)
#define HRPWM_PCNAR2_EXEV7UCA_POS  (12U)
#define HRPWM_PCNAR2_EXEV7UCA      (0x00003000UL)
#define HRPWM_PCNAR2_EXEV7UCA_0    (0x00001000UL)
#define HRPWM_PCNAR2_EXEV7UCA_1    (0x00002000UL)
#define HRPWM_PCNAR2_EXEV8UCA_POS  (14U)
#define HRPWM_PCNAR2_EXEV8UCA      (0x0000C000UL)
#define HRPWM_PCNAR2_EXEV8UCA_0    (0x00004000UL)
#define HRPWM_PCNAR2_EXEV8UCA_1    (0x00008000UL)
#define HRPWM_PCNAR2_EXEV9UCA_POS  (16U)
#define HRPWM_PCNAR2_EXEV9UCA      (0x00030000UL)
#define HRPWM_PCNAR2_EXEV9UCA_0    (0x00010000UL)
#define HRPWM_PCNAR2_EXEV9UCA_1    (0x00020000UL)
#define HRPWM_PCNAR2_EXEV10UCA_POS (18U)
#define HRPWM_PCNAR2_EXEV10UCA     (0x000C0000UL)
#define HRPWM_PCNAR2_EXEV10UCA_0   (0x00040000UL)
#define HRPWM_PCNAR2_EXEV10UCA_1   (0x00080000UL)
#define HRPWM_PCNAR2_CMEUCA_POS    (20U)
#define HRPWM_PCNAR2_CMEUCA        (0x00300000UL)
#define HRPWM_PCNAR2_CMEUCA_0      (0x00100000UL)
#define HRPWM_PCNAR2_CMEUCA_1      (0x00200000UL)
#define HRPWM_PCNAR2_CMFUCA_POS    (22U)
#define HRPWM_PCNAR2_CMFUCA        (0x00C00000UL)
#define HRPWM_PCNAR2_CMFUCA_0      (0x00400000UL)
#define HRPWM_PCNAR2_CMFUCA_1      (0x00800000UL)
#define HRPWM_PCNAR2_SCMAUCA_POS   (24U)
#define HRPWM_PCNAR2_SCMAUCA       (0x03000000UL)
#define HRPWM_PCNAR2_SCMAUCA_0     (0x01000000UL)
#define HRPWM_PCNAR2_SCMAUCA_1     (0x02000000UL)
#define HRPWM_PCNAR2_SCMBUCA_POS   (26U)
#define HRPWM_PCNAR2_SCMBUCA       (0x0C000000UL)
#define HRPWM_PCNAR2_SCMBUCA_0     (0x04000000UL)
#define HRPWM_PCNAR2_SCMBUCA_1     (0x08000000UL)
#define HRPWM_PCNAR2_SFTUCA_POS    (30U)
#define HRPWM_PCNAR2_SFTUCA        (0xC0000000UL)
#define HRPWM_PCNAR2_SFTUCA_0      (0x40000000UL)
#define HRPWM_PCNAR2_SFTUCA_1      (0x80000000UL)

/* Bit definition for HRPWM_BPCNAR2 register */
#define HRPWM_BPCNAR2_EXEV1UCA_POS  (0U)
#define HRPWM_BPCNAR2_EXEV1UCA      (0x00000003UL)
#define HRPWM_BPCNAR2_EXEV1UCA_0    (0x00000001UL)
#define HRPWM_BPCNAR2_EXEV1UCA_1    (0x00000002UL)
#define HRPWM_BPCNAR2_EXEV2UCA_POS  (2U)
#define HRPWM_BPCNAR2_EXEV2UCA      (0x0000000CUL)
#define HRPWM_BPCNAR2_EXEV2UCA_0    (0x00000004UL)
#define HRPWM_BPCNAR2_EXEV2UCA_1    (0x00000008UL)
#define HRPWM_BPCNAR2_EXEV3UCA_POS  (4U)
#define HRPWM_BPCNAR2_EXEV3UCA      (0x00000030UL)
#define HRPWM_BPCNAR2_EXEV3UCA_0    (0x00000010UL)
#define HRPWM_BPCNAR2_EXEV3UCA_1    (0x00000020UL)
#define HRPWM_BPCNAR2_EXEV4UCA_POS  (6U)
#define HRPWM_BPCNAR2_EXEV4UCA      (0x000000C0UL)
#define HRPWM_BPCNAR2_EXEV4UCA_0    (0x00000040UL)
#define HRPWM_BPCNAR2_EXEV4UCA_1    (0x00000080UL)
#define HRPWM_BPCNAR2_EXEV5UCA_POS  (8U)
#define HRPWM_BPCNAR2_EXEV5UCA      (0x00000300UL)
#define HRPWM_BPCNAR2_EXEV5UCA_0    (0x00000100UL)
#define HRPWM_BPCNAR2_EXEV5UCA_1    (0x00000200UL)
#define HRPWM_BPCNAR2_EXEV6UCA_POS  (10U)
#define HRPWM_BPCNAR2_EXEV6UCA      (0x00000C00UL)
#define HRPWM_BPCNAR2_EXEV6UCA_0    (0x00000400UL)
#define HRPWM_BPCNAR2_EXEV6UCA_1    (0x00000800UL)
#define HRPWM_BPCNAR2_EXEV7UCA_POS  (12U)
#define HRPWM_BPCNAR2_EXEV7UCA      (0x00003000UL)
#define HRPWM_BPCNAR2_EXEV7UCA_0    (0x00001000UL)
#define HRPWM_BPCNAR2_EXEV7UCA_1    (0x00002000UL)
#define HRPWM_BPCNAR2_EXEV8UCA_POS  (14U)
#define HRPWM_BPCNAR2_EXEV8UCA      (0x0000C000UL)
#define HRPWM_BPCNAR2_EXEV8UCA_0    (0x00004000UL)
#define HRPWM_BPCNAR2_EXEV8UCA_1    (0x00008000UL)
#define HRPWM_BPCNAR2_EXEV9UCA_POS  (16U)
#define HRPWM_BPCNAR2_EXEV9UCA      (0x00030000UL)
#define HRPWM_BPCNAR2_EXEV9UCA_0    (0x00010000UL)
#define HRPWM_BPCNAR2_EXEV9UCA_1    (0x00020000UL)
#define HRPWM_BPCNAR2_EXEV10UCA_POS (18U)
#define HRPWM_BPCNAR2_EXEV10UCA     (0x000C0000UL)
#define HRPWM_BPCNAR2_EXEV10UCA_0   (0x00040000UL)
#define HRPWM_BPCNAR2_EXEV10UCA_1   (0x00080000UL)
#define HRPWM_BPCNAR2_CMEUCA_POS    (20U)
#define HRPWM_BPCNAR2_CMEUCA        (0x00300000UL)
#define HRPWM_BPCNAR2_CMEUCA_0      (0x00100000UL)
#define HRPWM_BPCNAR2_CMEUCA_1      (0x00200000UL)
#define HRPWM_BPCNAR2_CMFUCA_POS    (22U)
#define HRPWM_BPCNAR2_CMFUCA        (0x00C00000UL)
#define HRPWM_BPCNAR2_CMFUCA_0      (0x00400000UL)
#define HRPWM_BPCNAR2_CMFUCA_1      (0x00800000UL)
#define HRPWM_BPCNAR2_SCMAUCA_POS   (24U)
#define HRPWM_BPCNAR2_SCMAUCA       (0x03000000UL)
#define HRPWM_BPCNAR2_SCMAUCA_0     (0x01000000UL)
#define HRPWM_BPCNAR2_SCMAUCA_1     (0x02000000UL)
#define HRPWM_BPCNAR2_SCMBUCA_POS   (26U)
#define HRPWM_BPCNAR2_SCMBUCA       (0x0C000000UL)
#define HRPWM_BPCNAR2_SCMBUCA_0     (0x04000000UL)
#define HRPWM_BPCNAR2_SCMBUCA_1     (0x08000000UL)
#define HRPWM_BPCNAR2_SFTUCA_POS    (30U)
#define HRPWM_BPCNAR2_SFTUCA        (0xC0000000UL)
#define HRPWM_BPCNAR2_SFTUCA_0      (0x40000000UL)
#define HRPWM_BPCNAR2_SFTUCA_1      (0x80000000UL)

