MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_PCNAR3 register */
#define HRPWM_PCNAR3_EXEV1DCA_POS  (0U)
#define HRPWM_PCNAR3_EXEV1DCA      (0x00000003UL)
#define HRPWM_PCNAR3_EXEV1DCA_0    (0x00000001UL)
#define HRPWM_PCNAR3_EXEV1DCA_1    (0x00000002UL)
#define HRPWM_PCNAR3_EXEV2DCA_POS  (2U)
#define HRPWM_PCNAR3_EXEV2DCA      (0x0000000CUL)
#define HRPWM_PCNAR3_EXEV2DCA_0    (0x00000004UL)
#define HRPWM_PCNAR3_EXEV2DCA_1    (0x00000008UL)
#define HRPWM_PCNAR3_EXEV3DCA_POS  (4U)
#define HRPWM_PCNAR3_EXEV3DCA      (0x00000030UL)
#define HRPWM_PCNAR3_EXEV3DCA_0    (0x00000010UL)
#define HRPWM_PCNAR3_EXEV3DCA_1    (0x00000020UL)
#define HRPWM_PCNAR3_EXEV4DCA_POS  (6U)
#define HRPWM_PCNAR3_EXEV4DCA      (0x000000C0UL)
#define HRPWM_PCNAR3_EXEV4DCA_0    (0x00000040UL)
#define HRPWM_PCNAR3_EXEV4DCA_1    (0x00000080UL)
#define HRPWM_PCNAR3_EXEV5DCA_POS  (8U)
#define HRPWM_PCNAR3_EXEV5DCA      (0x00000300UL)
#define HRPWM_PCNAR3_EXEV5DCA_0    (0x00000100UL)
#define HRPWM_PCNAR3_EXEV5DCA_1    (0x00000200UL)
#define HRPWM_PCNAR3_EXEV6DCA_POS  (10U)
#define HRPWM_PCNAR3_EXEV6DCA      (0x00000C00UL)
#define HRPWM_PCNAR3_EXEV6DCA_0    (0x00000400UL)
#define HRPWM_PCNAR3_EXEV6DCA_1    (0x00000800UL)
#define HRPWM_PCNAR3_EXEV7DCA_POS  (12U)
#define HRPWM_PCNAR3_EXEV7DCA      (0x00003000UL)
#define HRPWM_PCNAR3_EXEV7DCA_0    (0x00001000UL)
#define HRPWM_PCNAR3_EXEV7DCA_1    (0x00002000UL)
#define HRPWM_PCNAR3_EXEV8DCA_POS  (14U)
#define HRPWM_PCNAR3_EXEV8DCA      (0x0000C000UL)
#define HRPWM_PCNAR3_EXEV8DCA_0    (0x00004000UL)
#define HRPWM_PCNAR3_EXEV8DCA_1    (0x00008000UL)
#define HRPWM_PCNAR3_EXEV9DCA_POS  (16U)
#define HRPWM_PCNAR3_EXEV9DCA      (0x00030000UL)
#define HRPWM_PCNAR3_EXEV9DCA_0    (0x00010000UL)
#define HRPWM_PCNAR3_EXEV9DCA_1    (0x00020000UL)
#define HRPWM_PCNAR3_EXEV10DCA_POS (18U)
#define HRPWM_PCNAR3_EXEV10DCA     (0x000C0000UL)
#define HRPWM_PCNAR3_EXEV10DCA_0   (0x00040000UL)
#define HRPWM_PCNAR3_EXEV10DCA_1   (0x00080000UL)
#define HRPWM_PCNAR3_CMEDCA_POS    (20U)
#define HRPWM_PCNAR3_CMEDCA        (0x00300000UL)
#define HRPWM_PCNAR3_CMEDCA_0      (0x00100000UL)
#define HRPWM_PCNAR3_CMEDCA_1      (0x00200000UL)
#define HRPWM_PCNAR3_CMFDCA_POS    (22U)
#define HRPWM_PCNAR3_CMFDCA        (0x00C00000UL)
#define HRPWM_PCNAR3_CMFDCA_0      (0x00400000UL)
#define HRPWM_PCNAR3_CMFDCA_1      (0x00800000UL)
#define HRPWM_PCNAR3_SCMADCA_POS   (24U)
#define HRPWM_PCNAR3_SCMADCA       (0x03000000UL)
#define HRPWM_PCNAR3_SCMADCA_0     (0x01000000UL)
#define HRPWM_PCNAR3_SCMADCA_1     (0x02000000UL)
#define HRPWM_PCNAR3_SCMBDCA_POS   (26U)
#define HRPWM_PCNAR3_SCMBDCA       (0x0C000000UL)
#define HRPWM_PCNAR3_SCMBDCA_0     (0x04000000UL)
#define HRPWM_PCNAR3_SCMBDCA_1     (0x08000000UL)
#define HRPWM_PCNAR3_SFTDCA_POS    (30U)
#define HRPWM_PCNAR3_SFTDCA        (0xC0000000UL)
#define HRPWM_PCNAR3_SFTDCA_0      (0x40000000UL)
#define HRPWM_PCNAR3_SFTDCA_1      (0x80000000UL)

/* Bit definition for HRPWM_BPCNAR3 register */
#define HRPWM_BPCNAR3_EXEV1DCA_POS  (0U)
#define HRPWM_BPCNAR3_EXEV1DCA      (0x00000003UL)
#define HRPWM_BPCNAR3_EXEV1DCA_0    (0x00000001UL)
#define HRPWM_BPCNAR3_EXEV1DCA_1    (0x00000002UL)
#define HRPWM_BPCNAR3_EXEV2DCA_POS  (2U)
#define HRPWM_BPCNAR3_EXEV2DCA      (0x0000000CUL)
#define HRPWM_BPCNAR3_EXEV2DCA_0    (0x00000004UL)
#define HRPWM_BPCNAR3_EXEV2DCA_1    (0x00000008UL)
#define HRPWM_BPCNAR3_EXEV3DCA_POS  (4U)
#define HRPWM_BPCNAR3_EXEV3DCA      (0x00000030UL)
#define HRPWM_BPCNAR3_EXEV3DCA_0    (0x00000010UL)
#define HRPWM_BPCNAR3_EXEV3DCA_1    (0x00000020UL)
#define HRPWM_BPCNAR3_EXEV4DCA_POS  (6U)
#define HRPWM_BPCNAR3_EXEV4DCA      (0x000000C0UL)
#define HRPWM_BPCNAR3_EXEV4DCA_0    (0x00000040UL)
#define HRPWM_BPCNAR3_EXEV4DCA_1    (0x00000080UL)
#define HRPWM_BPCNAR3_EXEV5DCA_POS  (8U)
#define HRPWM_BPCNAR3_EXEV5DCA      (0x00000300UL)
#define HRPWM_BPCNAR3_EXEV5DCA_0    (0x00000100UL)
#define HRPWM_BPCNAR3_EXEV5DCA_1    (0x00000200UL)
#define HRPWM_BPCNAR3_EXEV6DCA_POS  (10U)
#define HRPWM_BPCNAR3_EXEV6DCA      (0x00000C00UL)
#define HRPWM_BPCNAR3_EXEV6DCA_0    (0x00000400UL)
#define HRPWM_BPCNAR3_EXEV6DCA_1    (0x00000800UL)
#define HRPWM_BPCNAR3_EXEV7DCA_POS  (12U)
#define HRPWM_BPCNAR3_EXEV7DCA      (0x00003000UL)
#define HRPWM_BPCNAR3_EXEV7DCA_0    (0x00001000UL)
#define HRPWM_BPCNAR3_EXEV7DCA_1    (0x00002000UL)
#define HRPWM_BPCNAR3_EXEV8DCA_POS  (14U)
#define HRPWM_BPCNAR3_EXEV8DCA      (0x0000C000UL)
#define HRPWM_BPCNAR3_EXEV8DCA_0    (0x00004000UL)
#define HRPWM_BPCNAR3_EXEV8DCA_1    (0x00008000UL)
#define HRPWM_BPCNAR3_EXEV9DCA_POS  (16U)
#define HRPWM_BPCNAR3_EXEV9DCA      (0x00030000UL)
#define HRPWM_BPCNAR3_EXEV9DCA_0    (0x00010000UL)
#define HRPWM_BPCNAR3_EXEV9DCA_1    (0x00020000UL)
#define HRPWM_BPCNAR3_EXEV10DCA_POS (18U)
#define HRPWM_BPCNAR3_EXEV10DCA     (0x000C0000UL)
#define HRPWM_BPCNAR3_EXEV10DCA_0   (0x00040000UL)
#define HRPWM_BPCNAR3_EXEV10DCA_1   (0x00080000UL)
#define HRPWM_BPCNAR3_CMEDCA_POS    (20U)
#define HRPWM_BPCNAR3_CMEDCA        (0x00300000UL)
#define HRPWM_BPCNAR3_CMEDCA_0      (0x00100000UL)
#define HRPWM_BPCNAR3_CMEDCA_1      (0x00200000UL)
#define HRPWM_BPCNAR3_CMFDCA_POS    (22U)
#define HRPWM_BPCNAR3_CMFDCA        (0x00C00000UL)
#define HRPWM_BPCNAR3_CMFDCA_0      (0x00400000UL)
#define HRPWM_BPCNAR3_CMFDCA_1      (0x00800000UL)
#define HRPWM_BPCNAR3_SCMADCA_POS   (24U)
#define HRPWM_BPCNAR3_SCMADCA       (0x03000000UL)
#define HRPWM_BPCNAR3_SCMADCA_0     (0x01000000UL)
#define HRPWM_BPCNAR3_SCMADCA_1     (0x02000000UL)
#define HRPWM_BPCNAR3_SCMBDCA_POS   (26U)
#define HRPWM_BPCNAR3_SCMBDCA       (0x0C000000UL)
#define HRPWM_BPCNAR3_SCMBDCA_0     (0x04000000UL)
#define HRPWM_BPCNAR3_SCMBDCA_1     (0x08000000UL)
#define HRPWM_BPCNAR3_SFTDCA_POS    (30U)
#define HRPWM_BPCNAR3_SFTDCA        (0xC0000000UL)
#define HRPWM_BPCNAR3_SFTDCA_0      (0x40000000UL)
#define HRPWM_BPCNAR3_SFTDCA_1      (0x80000000UL)

/* Bit definition for HRPWM_PCNAR14 register */
#define HRPWM_PCNAR14_TMEVT1UCA_POS  (0U)
#define HRPWM_PCNAR14_TMEVT1UCA      (0x00000003UL)
#define HRPWM_PCNAR14_TMEVT1UCA_0    (0x00000001UL)
#define HRPWM_PCNAR14_TMEVT1UCA_1    (0x00000002UL)
#define HRPWM_PCNAR14_TMEVT2UCA_POS  (2U)
#define HRPWM_PCNAR14_TMEVT2UCA      (0x0000000CUL)
#define HRPWM_PCNAR14_TMEVT2UCA_0    (0x00000004UL)
#define HRPWM_PCNAR14_TMEVT2UCA_1    (0x00000008UL)
#define HRPWM_PCNAR14_TMEVT3UCA_POS  (4U)
#define HRPWM_PCNAR14_TMEVT3UCA      (0x00000030UL)
#define HRPWM_PCNAR14_TMEVT3UCA_0    (0x00000010UL)
#define HRPWM_PCNAR14_TMEVT3UCA_1    (0x00000020UL)
#define HRPWM_PCNAR14_TMEVT4UCA_POS  (6U)
#define HRPWM_PCNAR14_TMEVT4UCA      (0x000000C0UL)
#define HRPWM_PCNAR14_TMEVT4UCA_0    (0x00000040UL)
#define HRPWM_PCNAR14_TMEVT4UCA_1    (0x00000080UL)
#define HRPWM_PCNAR14_TMEVT5UCA_POS  (8U)
#define HRPWM_PCNAR14_TMEVT5UCA      (0x00000300UL)
#define HRPWM_PCNAR14_TMEVT5UCA_0    (0x00000100UL)
#define HRPWM_PCNAR14_TMEVT5UCA_1    (0x00000200UL)
#define HRPWM_PCNAR14_TMEVT6UCA_POS  (10U)
#define HRPWM_PCNAR14_TMEVT6UCA      (0x00000C00UL)
#define HRPWM_PCNAR14_TMEVT6UCA_0    (0x00000400UL)
#define HRPWM_PCNAR14_TMEVT6UCA_1    (0x00000800UL)
#define HRPWM_PCNAR14_TMEVT7UCA_POS  (12U)
#define HRPWM_PCNAR14_TMEVT7UCA      (0x00003000UL)
#define HRPWM_PCNAR14_TMEVT7UCA_0    (0x00001000UL)
#define HRPWM_PCNAR14_TMEVT7UCA_1    (0x00002000UL)
#define HRPWM_PCNAR14_TMEVT8UCA_POS  (14U)
#define HRPWM_PCNAR14_TMEVT8UCA      (0x0000C000UL)
#define HRPWM_PCNAR14_TMEVT8UCA_0    (0x00004000UL)
#define HRPWM_PCNAR14_TMEVT8UCA_1    (0x00008000UL)
#define HRPWM_PCNAR14_TMEVT9UCA_POS  (16U)
#define HRPWM_PCNAR14_TMEVT9UCA      (0x00030000UL)
#define HRPWM_PCNAR14_TMEVT9UCA_0    (0x00010000UL)
#define HRPWM_PCNAR14_TMEVT9UCA_1    (0x00020000UL)
#define HRPWM_PCNAR14_TMEVT10UCA_POS (18U)
#define HRPWM_PCNAR14_TMEVT10UCA     (0x000C0000UL)
#define HRPWM_PCNAR14_TMEVT10UCA_0   (0x00040000UL)
#define HRPWM_PCNAR14_TMEVT10UCA_1   (0x00080000UL)

/* Bit definition for HRPWM_PCNAR24 register */
#define HRPWM_PCNAR24_U1OVFUCA_POS   (0U)
#define HRPWM_PCNAR24_U1OVFUCA       (0x00000003UL)
#define HRPWM_PCNAR24_U1OVFUCA_0     (0x00000001UL)
#define HRPWM_PCNAR24_U1OVFUCA_1     (0x00000002UL)
#define HRPWM_PCNAR24_U1UDFUCA_POS   (2U)
#define HRPWM_PCNAR24_U1UDFUCA       (0x0000000CUL)
#define HRPWM_PCNAR24_U1UDFUCA_0     (0x00000004UL)
#define HRPWM_PCNAR24_U1UDFUCA_1     (0x00000008UL)
#define HRPWM_PCNAR24_U1CMFUCA_POS   (4U)
#define HRPWM_PCNAR24_U1CMFUCA       (0x00000030UL)
#define HRPWM_PCNAR24_U1CMFUCA_0     (0x00000010UL)
#define HRPWM_PCNAR24_U1CMFUCA_1     (0x00000020UL)
#define HRPWM_PCNAR24_U1CMEUCA_POS   (6U)
#define HRPWM_PCNAR24_U1CMEUCA       (0x000000C0UL)
#define HRPWM_PCNAR24_U1CMEUCA_0     (0x00000040UL)
#define HRPWM_PCNAR24_U1CMEUCA_1     (0x00000080UL)
#define HRPWM_PCNAR24_U1CMBUCA_POS   (8U)
#define HRPWM_PCNAR24_U1CMBUCA       (0x00000300UL)
#define HRPWM_PCNAR24_U1CMBUCA_0     (0x00000100UL)
#define HRPWM_PCNAR24_U1CMBUCA_1     (0x00000200UL)
#define HRPWM_PCNAR24_U1CMAUCA_POS   (10U)
#define HRPWM_PCNAR24_U1CMAUCA       (0x00000C00UL)
#define HRPWM_PCNAR24_U1CMAUCA_0     (0x00000400UL)
#define HRPWM_PCNAR24_U1CMAUCA_1     (0x00000800UL)
#define HRPWM_PCNAR24_TMEVT1UCA_POS  (12U)
#define HRPWM_PCNAR24_TMEVT1UCA      (0x00003000UL)
#define HRPWM_PCNAR24_TMEVT1UCA_0    (0x00001000UL)
#define HRPWM_PCNAR24_TMEVT1UCA_1    (0x00002000UL)
#define HRPWM_PCNAR24_TMEVT2UCA_POS  (14U)
#define HRPWM_PCNAR24_TMEVT2UCA      (0x0000C000UL)
#define HRPWM_PCNAR24_TMEVT2UCA_0    (0x00004000UL)
#define HRPWM_PCNAR24_TMEVT2UCA_1    (0x00008000UL)
#define HRPWM_PCNAR24_TMEVT3UCA_POS  (16U)
#define HRPWM_PCNAR24_TMEVT3UCA      (0x00030000UL)
#define HRPWM_PCNAR24_TMEVT3UCA_0    (0x00010000UL)
#define HRPWM_PCNAR24_TMEVT3UCA_1    (0x00020000UL)
#define HRPWM_PCNAR24_TMEVT4UCA_POS  (18U)
#define HRPWM_PCNAR24_TMEVT4UCA      (0x000C0000UL)
#define HRPWM_PCNAR24_TMEVT4UCA_0    (0x00040000UL)
#define HRPWM_PCNAR24_TMEVT4UCA_1    (0x00080000UL)
#define HRPWM_PCNAR24_TMEVT5UCA_POS  (20U)
#define HRPWM_PCNAR24_TMEVT5UCA      (0x00300000UL)
#define HRPWM_PCNAR24_TMEVT5UCA_0    (0x00100000UL)
#define HRPWM_PCNAR24_TMEVT5UCA_1    (0x00200000UL)
#define HRPWM_PCNAR24_TMEVT6UCA_POS  (22U)
#define HRPWM_PCNAR24_TMEVT6UCA      (0x00C00000UL)
#define HRPWM_PCNAR24_TMEVT6UCA_0    (0x00400000UL)
#define HRPWM_PCNAR24_TMEVT6UCA_1    (0x00800000UL)
#define HRPWM_PCNAR24_TMEVT7UCA_POS  (24U)
#define HRPWM_PCNAR24_TMEVT7UCA      (0x03000000UL)
#define HRPWM_PCNAR24_TMEVT7UCA_0    (0x01000000UL)
#define HRPWM_PCNAR24_TMEVT7UCA_1    (0x02000000UL)
#define HRPWM_PCNAR24_TMEVT8UCA_POS  (26U)
#define HRPWM_PCNAR24_TMEVT8UCA      (0x0C000000UL)
#define HRPWM_PCNAR24_TMEVT8UCA_0    (0x04000000UL)
#define HRPWM_PCNAR24_TMEVT8UCA_1    (0x08000000UL)
#define HRPWM_PCNAR24_TMEVT9UCA_POS  (28U)
#define HRPWM_PCNAR24_TMEVT9UCA      (0x30000000UL)
#define HRPWM_PCNAR24_TMEVT9UCA_0    (0x10000000UL)
#define HRPWM_PCNAR24_TMEVT9UCA_1    (0x20000000UL)
#define HRPWM_PCNAR24_TMEVT10UCA_POS (30U)
#define HRPWM_PCNAR24_TMEVT10UCA     (0xC0000000UL)
#define HRPWM_PCNAR24_TMEVT10UCA_0   (0x40000000UL)
#define HRPWM_PCNAR24_TMEVT10UCA_1   (0x80000000UL)

