MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_PCNAR25 register */
#define HRPWM_PCNAR25_U1OVFDCA_POS   (0U)
#define HRPWM_PCNAR25_U1OVFDCA       (0x00000003UL)
#define HRPWM_PCNAR25_U1OVFDCA_0     (0x00000001UL)
#define HRPWM_PCNAR25_U1OVFDCA_1     (0x00000002UL)
#define HRPWM_PCNAR25_U1UDFDCA_POS   (2U)
#define HRPWM_PCNAR25_U1UDFDCA       (0x0000000CUL)
#define HRPWM_PCNAR25_U1UDFDCA_0     (0x00000004UL)
#define HRPWM_PCNAR25_U1UDFDCA_1     (0x00000008UL)
#define HRPWM_PCNAR25_U1CMFDCA_POS   (4U)
#define HRPWM_PCNAR25_U1CMFDCA       (0x00000030UL)
#define HRPWM_PCNAR25_U1CMFDCA_0     (0x00000010UL)
#define HRPWM_PCNAR25_U1CMFDCA_1     (0x00000020UL)
#define HRPWM_PCNAR25_U1CMEDCA_POS   (6U)
#define HRPWM_PCNAR25_U1CMEDCA       (0x000000C0UL)
#define HRPWM_PCNAR25_U1CMEDCA_0     (0x00000040UL)
#define HRPWM_PCNAR25_U1CMEDCA_1     (0x00000080UL)
#define HRPWM_PCNAR25_U1CMBDCA_POS   (8U)
#define HRPWM_PCNAR25_U1CMBDCA       (0x00000300UL)
#define HRPWM_PCNAR25_U1CMBDCA_0     (0x00000100UL)
#define HRPWM_PCNAR25_U1CMBDCA_1     (0x00000200UL)
#define HRPWM_PCNAR25_U1CMADCA_POS   (10U)
#define HRPWM_PCNAR25_U1CMADCA       (0x00000C00UL)
#define HRPWM_PCNAR25_U1CMADCA_0     (0x00000400UL)
#define HRPWM_PCNAR25_U1CMADCA_1     (0x00000800UL)
#define HRPWM_PCNAR25_TMEVT1DCA_POS  (12U)
#define HRPWM_PCNAR25_TMEVT1DCA      (0x00003000UL)
#define HRPWM_PCNAR25_TMEVT1DCA_0    (0x00001000UL)
#define HRPWM_PCNAR25_TMEVT1DCA_1    (0x00002000UL)
#define HRPWM_PCNAR25_TMEVT2DCA_POS  (14U)
#define HRPWM_PCNAR25_TMEVT2DCA      (0x0000C000UL)
#define HRPWM_PCNAR25_TMEVT2DCA_0    (0x00004000UL)
#define HRPWM_PCNAR25_TMEVT2DCA_1    (0x00008000UL)
#define HRPWM_PCNAR25_TMEVT3DCA_POS  (16U)
#define HRPWM_PCNAR25_TMEVT3DCA      (0x00030000UL)
#define HRPWM_PCNAR25_TMEVT3DCA_0    (0x00010000UL)
#define HRPWM_PCNAR25_TMEVT3DCA_1    (0x00020000UL)
#define HRPWM_PCNAR25_TMEVT4DCA_POS  (18U)
#define HRPWM_PCNAR25_TMEVT4DCA      (0x000C0000UL)
#define HRPWM_PCNAR25_TMEVT4DCA_0    (0x00040000UL)
#define HRPWM_PCNAR25_TMEVT4DCA_1    (0x00080000UL)
#define HRPWM_PCNAR25_TMEVT5DCA_POS  (20U)
#define HRPWM_PCNAR25_TMEVT5DCA      (0x00300000UL)
#define HRPWM_PCNAR25_TMEVT5DCA_0    (0x00100000UL)
#define HRPWM_PCNAR25_TMEVT5DCA_1    (0x00200000UL)
#define HRPWM_PCNAR25_TMEVT6DCA_POS  (22U)
#define HRPWM_PCNAR25_TMEVT6DCA      (0x00C00000UL)
#define HRPWM_PCNAR25_TMEVT6DCA_0    (0x00400000UL)
#define HRPWM_PCNAR25_TMEVT6DCA_1    (0x00800000UL)
#define HRPWM_PCNAR25_TMEVT7DCA_POS  (24U)
#define HRPWM_PCNAR25_TMEVT7DCA      (0x03000000UL)
#define HRPWM_PCNAR25_TMEVT7DCA_0    (0x01000000UL)
#define HRPWM_PCNAR25_TMEVT7DCA_1    (0x02000000UL)
#define HRPWM_PCNAR25_TMEVT8DCA_POS  (26U)
#define HRPWM_PCNAR25_TMEVT8DCA      (0x0C000000UL)
#define HRPWM_PCNAR25_TMEVT8DCA_0    (0x04000000UL)
#define HRPWM_PCNAR25_TMEVT8DCA_1    (0x08000000UL)
#define HRPWM_PCNAR25_TMEVT9DCA_POS  (28U)
#define HRPWM_PCNAR25_TMEVT9DCA      (0x30000000UL)
#define HRPWM_PCNAR25_TMEVT9DCA_0    (0x10000000UL)
#define HRPWM_PCNAR25_TMEVT9DCA_1    (0x20000000UL)
#define HRPWM_PCNAR25_TMEVT10DCA_POS (30U)
#define HRPWM_PCNAR25_TMEVT10DCA     (0xC0000000UL)
#define HRPWM_PCNAR25_TMEVT10DCA_0   (0x40000000UL)
#define HRPWM_PCNAR25_TMEVT10DCA_1   (0x80000000UL)

/* Bit definition for HRPWM_BPCNAR15 register */
#define HRPWM_BPCNAR15_TMEVT1DCA_POS  (0U)
#define HRPWM_BPCNAR15_TMEVT1DCA      (0x00000003UL)
#define HRPWM_BPCNAR15_TMEVT1DCA_0    (0x00000001UL)
#define HRPWM_BPCNAR15_TMEVT1DCA_1    (0x00000002UL)
#define HRPWM_BPCNAR15_TMEVT2DCA_POS  (2U)
#define HRPWM_BPCNAR15_TMEVT2DCA      (0x0000000CUL)
#define HRPWM_BPCNAR15_TMEVT2DCA_0    (0x00000004UL)
#define HRPWM_BPCNAR15_TMEVT2DCA_1    (0x00000008UL)
#define HRPWM_BPCNAR15_TMEVT3DCA_POS  (4U)
#define HRPWM_BPCNAR15_TMEVT3DCA      (0x00000030UL)
#define HRPWM_BPCNAR15_TMEVT3DCA_0    (0x00000010UL)
#define HRPWM_BPCNAR15_TMEVT3DCA_1    (0x00000020UL)
#define HRPWM_BPCNAR15_TMEVT4DCA_POS  (6U)
#define HRPWM_BPCNAR15_TMEVT4DCA      (0x000000C0UL)
#define HRPWM_BPCNAR15_TMEVT4DCA_0    (0x00000040UL)
#define HRPWM_BPCNAR15_TMEVT4DCA_1    (0x00000080UL)
#define HRPWM_BPCNAR15_TMEVT5DCA_POS  (8U)
#define HRPWM_BPCNAR15_TMEVT5DCA      (0x00000300UL)
#define HRPWM_BPCNAR15_TMEVT5DCA_0    (0x00000100UL)
#define HRPWM_BPCNAR15_TMEVT5DCA_1    (0x00000200UL)
#define HRPWM_BPCNAR15_TMEVT6DCA_POS  (10U)
#define HRPWM_BPCNAR15_TMEVT6DCA      (0x00000C00UL)
#define HRPWM_BPCNAR15_TMEVT6DCA_0    (0x00000400UL)
#define HRPWM_BPCNAR15_TMEVT6DCA_1    (0x00000800UL)
#define HRPWM_BPCNAR15_TMEVT7DCA_POS  (12U)
#define HRPWM_BPCNAR15_TMEVT7DCA      (0x00003000UL)
#define HRPWM_BPCNAR15_TMEVT7DCA_0    (0x00001000UL)
#define HRPWM_BPCNAR15_TMEVT7DCA_1    (0x00002000UL)
#define HRPWM_BPCNAR15_TMEVT8DCA_POS  (14U)
#define HRPWM_BPCNAR15_TMEVT8DCA      (0x0000C000UL)
#define HRPWM_BPCNAR15_TMEVT8DCA_0    (0x00004000UL)
#define HRPWM_BPCNAR15_TMEVT8DCA_1    (0x00008000UL)
#define HRPWM_BPCNAR15_TMEVT9DCA_POS  (16U)
#define HRPWM_BPCNAR15_TMEVT9DCA      (0x00030000UL)
#define HRPWM_BPCNAR15_TMEVT9DCA_0    (0x00010000UL)
#define HRPWM_BPCNAR15_TMEVT9DCA_1    (0x00020000UL)
#define HRPWM_BPCNAR15_TMEVT10DCA_POS (18U)
#define HRPWM_BPCNAR15_TMEVT10DCA     (0x000C0000UL)
#define HRPWM_BPCNAR15_TMEVT10DCA_0   (0x00040000UL)
#define HRPWM_BPCNAR15_TMEVT10DCA_1   (0x00080000UL)

/* Bit definition for HRPWM_BPCNAR25 register */
#define HRPWM_BPCNAR25_U1OVFDCA_POS   (0U)
#define HRPWM_BPCNAR25_U1OVFDCA       (0x00000003UL)
#define HRPWM_BPCNAR25_U1OVFDCA_0     (0x00000001UL)
#define HRPWM_BPCNAR25_U1OVFDCA_1     (0x00000002UL)
#define HRPWM_BPCNAR25_U1UDFDCA_POS   (2U)
#define HRPWM_BPCNAR25_U1UDFDCA       (0x0000000CUL)
#define HRPWM_BPCNAR25_U1UDFDCA_0     (0x00000004UL)
#define HRPWM_BPCNAR25_U1UDFDCA_1     (0x00000008UL)
#define HRPWM_BPCNAR25_U1CMFDCA_POS   (4U)
#define HRPWM_BPCNAR25_U1CMFDCA       (0x00000030UL)
#define HRPWM_BPCNAR25_U1CMFDCA_0     (0x00000010UL)
#define HRPWM_BPCNAR25_U1CMFDCA_1     (0x00000020UL)
#define HRPWM_BPCNAR25_U1CMEDCA_POS   (6U)
#define HRPWM_BPCNAR25_U1CMEDCA       (0x000000C0UL)
#define HRPWM_BPCNAR25_U1CMEDCA_0     (0x00000040UL)
#define HRPWM_BPCNAR25_U1CMEDCA_1     (0x00000080UL)
#define HRPWM_BPCNAR25_U1CMBDCA_POS   (8U)
#define HRPWM_BPCNAR25_U1CMBDCA       (0x00000300UL)
#define HRPWM_BPCNAR25_U1CMBDCA_0     (0x00000100UL)
#define HRPWM_BPCNAR25_U1CMBDCA_1     (0x00000200UL)
#define HRPWM_BPCNAR25_U1CMADCA_POS   (10U)
#define HRPWM_BPCNAR25_U1CMADCA       (0x00000C00UL)
#define HRPWM_BPCNAR25_U1CMADCA_0     (0x00000400UL)
#define HRPWM_BPCNAR25_U1CMADCA_1     (0x00000800UL)
#define HRPWM_BPCNAR25_TMEVT1DCA_POS  (12U)
#define HRPWM_BPCNAR25_TMEVT1DCA      (0x00003000UL)
#define HRPWM_BPCNAR25_TMEVT1DCA_0    (0x00001000UL)
#define HRPWM_BPCNAR25_TMEVT1DCA_1    (0x00002000UL)
#define HRPWM_BPCNAR25_TMEVT2DCA_POS  (14U)
#define HRPWM_BPCNAR25_TMEVT2DCA      (0x0000C000UL)
#define HRPWM_BPCNAR25_TMEVT2DCA_0    (0x00004000UL)
#define HRPWM_BPCNAR25_TMEVT2DCA_1    (0x00008000UL)
#define HRPWM_BPCNAR25_TMEVT3DCA_POS  (16U)
#define HRPWM_BPCNAR25_TMEVT3DCA      (0x00030000UL)
#define HRPWM_BPCNAR25_TMEVT3DCA_0    (0x00010000UL)
#define HRPWM_BPCNAR25_TMEVT3DCA_1    (0x00020000UL)
#define HRPWM_BPCNAR25_TMEVT4DCA_POS  (18U)
#define HRPWM_BPCNAR25_TMEVT4DCA      (0x000C0000UL)
#define HRPWM_BPCNAR25_TMEVT4DCA_0    (0x00040000UL)
#define HRPWM_BPCNAR25_TMEVT4DCA_1    (0x00080000UL)
#define HRPWM_BPCNAR25_TMEVT5DCA_POS  (20U)
#define HRPWM_BPCNAR25_TMEVT5DCA      (0x00300000UL)
#define HRPWM_BPCNAR25_TMEVT5DCA_0    (0x00100000UL)
#define HRPWM_BPCNAR25_TMEVT5DCA_1    (0x00200000UL)
#define HRPWM_BPCNAR25_TMEVT6DCA_POS  (22U)
#define HRPWM_BPCNAR25_TMEVT6DCA      (0x00C00000UL)
#define HRPWM_BPCNAR25_TMEVT6DCA_0    (0x00400000UL)
#define HRPWM_BPCNAR25_TMEVT6DCA_1    (0x00800000UL)
#define HRPWM_BPCNAR25_TMEVT7DCA_POS  (24U)
#define HRPWM_BPCNAR25_TMEVT7DCA      (0x03000000UL)
#define HRPWM_BPCNAR25_TMEVT7DCA_0    (0x01000000UL)
#define HRPWM_BPCNAR25_TMEVT7DCA_1    (0x02000000UL)
#define HRPWM_BPCNAR25_TMEVT8DCA_POS  (26U)
#define HRPWM_BPCNAR25_TMEVT8DCA      (0x0C000000UL)
#define HRPWM_BPCNAR25_TMEVT8DCA_0    (0x04000000UL)
#define HRPWM_BPCNAR25_TMEVT8DCA_1    (0x08000000UL)
#define HRPWM_BPCNAR25_TMEVT9DCA_POS  (28U)
#define HRPWM_BPCNAR25_TMEVT9DCA      (0x30000000UL)
#define HRPWM_BPCNAR25_TMEVT9DCA_0    (0x10000000UL)
#define HRPWM_BPCNAR25_TMEVT9DCA_1    (0x20000000UL)
#define HRPWM_BPCNAR25_TMEVT10DCA_POS (30U)
#define HRPWM_BPCNAR25_TMEVT10DCA     (0xC0000000UL)
#define HRPWM_BPCNAR25_TMEVT10DCA_0   (0x40000000UL)
#define HRPWM_BPCNAR25_TMEVT10DCA_1   (0x80000000UL)

/* Bit definition for HRPWM_PCNBR1 register */
#define HRPWM_PCNBR1_STACB_POS  (0U)
#define HRPWM_PCNBR1_STACB      (0x00000003UL)
#define HRPWM_PCNBR1_STACB_0    (0x00000001UL)
#define HRPWM_PCNBR1_STACB_1    (0x00000002UL)
#define HRPWM_PCNBR1_STPCB_POS  (2U)
#define HRPWM_PCNBR1_STPCB      (0x0000000CUL)
#define HRPWM_PCNBR1_STPCB_0    (0x00000004UL)
#define HRPWM_PCNBR1_STPCB_1    (0x00000008UL)
#define HRPWM_PCNBR1_OVFCB_POS  (4U)
#define HRPWM_PCNBR1_OVFCB      (0x00000030UL)
#define HRPWM_PCNBR1_OVFCB_0    (0x00000010UL)
#define HRPWM_PCNBR1_OVFCB_1    (0x00000020UL)
#define HRPWM_PCNBR1_UDFCB_POS  (6U)
#define HRPWM_PCNBR1_UDFCB      (0x000000C0UL)
#define HRPWM_PCNBR1_UDFCB_0    (0x00000040UL)
#define HRPWM_PCNBR1_UDFCB_1    (0x00000080UL)
#define HRPWM_PCNBR1_CMAUCB_POS (8U)
#define HRPWM_PCNBR1_CMAUCB     (0x00000300UL)
#define HRPWM_PCNBR1_CMAUCB_0   (0x00000100UL)
#define HRPWM_PCNBR1_CMAUCB_1   (0x00000200UL)
#define HRPWM_PCNBR1_CMADCB_POS (10U)
#define HRPWM_PCNBR1_CMADCB     (0x00000C00UL)
#define HRPWM_PCNBR1_CMADCB_0   (0x00000400UL)
#define HRPWM_PCNBR1_CMADCB_1   (0x00000800UL)
#define HRPWM_PCNBR1_CMBUCB_POS (12U)
#define HRPWM_PCNBR1_CMBUCB     (0x00003000UL)
#define HRPWM_PCNBR1_CMBUCB_0   (0x00001000UL)
#define HRPWM_PCNBR1_CMBUCB_1   (0x00002000UL)
#define HRPWM_PCNBR1_CMBDCB_POS (14U)
#define HRPWM_PCNBR1_CMBDCB     (0x0000C000UL)
#define HRPWM_PCNBR1_CMBDCB_0   (0x00004000UL)
#define HRPWM_PCNBR1_CMBDCB_1   (0x00008000UL)
#define HRPWM_PCNBR1_FORCB_POS  (16U)
#define HRPWM_PCNBR1_FORCB      (0x00030000UL)
#define HRPWM_PCNBR1_FORCB_0    (0x00010000UL)
#define HRPWM_PCNBR1_FORCB_1    (0x00020000UL)
#define HRPWM_PCNBR1_EMBCB_POS  (20U)
#define HRPWM_PCNBR1_EMBCB      (0x00300000UL)
#define HRPWM_PCNBR1_EMBCB_0    (0x00100000UL)
#define HRPWM_PCNBR1_EMBCB_1    (0x00200000UL)
#define HRPWM_PCNBR1_EMBRB_POS  (22U)
#define HRPWM_PCNBR1_EMBRB      (0x00C00000UL)
#define HRPWM_PCNBR1_EMBRB_0    (0x00400000UL)
#define HRPWM_PCNBR1_EMBRB_1    (0x00800000UL)
#define HRPWM_PCNBR1_EMBSB_POS  (24U)
#define HRPWM_PCNBR1_EMBSB      (0x0F000000UL)
#define HRPWM_PCNBR1_OUTENB_POS (28U)
#define HRPWM_PCNBR1_OUTENB     (0x10000000UL)

/* Bit definition for HRPWM_BPCNBR1 register */
#define HRPWM_BPCNBR1_STACB_POS  (0U)
#define HRPWM_BPCNBR1_STACB      (0x00000003UL)
#define HRPWM_BPCNBR1_STACB_0    (0x00000001UL)
#define HRPWM_BPCNBR1_STACB_1    (0x00000002UL)
#define HRPWM_BPCNBR1_STPCB_POS  (2U)
#define HRPWM_BPCNBR1_STPCB      (0x0000000CUL)
#define HRPWM_BPCNBR1_STPCB_0    (0x00000004UL)
#define HRPWM_BPCNBR1_STPCB_1    (0x00000008UL)
#define HRPWM_BPCNBR1_OVFCB_POS  (4U)
#define HRPWM_BPCNBR1_OVFCB      (0x00000030UL)
#define HRPWM_BPCNBR1_OVFCB_0    (0x00000010UL)
#define HRPWM_BPCNBR1_OVFCB_1    (0x00000020UL)
#define HRPWM_BPCNBR1_UDFCB_POS  (6U)
#define HRPWM_BPCNBR1_UDFCB      (0x000000C0UL)
#define HRPWM_BPCNBR1_UDFCB_0    (0x00000040UL)
#define HRPWM_BPCNBR1_UDFCB_1    (0x00000080UL)
#define HRPWM_BPCNBR1_CMAUCB_POS (8U)
#define HRPWM_BPCNBR1_CMAUCB     (0x00000300UL)
#define HRPWM_BPCNBR1_CMAUCB_0   (0x00000100UL)
#define HRPWM_BPCNBR1_CMAUCB_1   (0x00000200UL)
#define HRPWM_BPCNBR1_CMADCB_POS (10U)
#define HRPWM_BPCNBR1_CMADCB     (0x00000C00UL)
#define HRPWM_BPCNBR1_CMADCB_0   (0x00000400UL)
#define HRPWM_BPCNBR1_CMADCB_1   (0x00000800UL)
#define HRPWM_BPCNBR1_CMBUCB_POS (12U)
#define HRPWM_BPCNBR1_CMBUCB     (0x00003000UL)
#define HRPWM_BPCNBR1_CMBUCB_0   (0x00001000UL)
#define HRPWM_BPCNBR1_CMBUCB_1   (0x00002000UL)
#define HRPWM_BPCNBR1_CMBDCB_POS (14U)
#define HRPWM_BPCNBR1_CMBDCB     (0x0000C000UL)
#define HRPWM_BPCNBR1_CMBDCB_0   (0x00004000UL)
#define HRPWM_BPCNBR1_CMBDCB_1   (0x00008000UL)
#define HRPWM_BPCNBR1_FORCB_POS  (16U)
#define HRPWM_BPCNBR1_FORCB      (0x00030000UL)
#define HRPWM_BPCNBR1_FORCB_0    (0x00010000UL)
#define HRPWM_BPCNBR1_FORCB_1    (0x00020000UL)
#define HRPWM_BPCNBR1_EMBCB_POS  (20U)
#define HRPWM_BPCNBR1_EMBCB      (0x00300000UL)
#define HRPWM_BPCNBR1_EMBCB_0    (0x00100000UL)
#define HRPWM_BPCNBR1_EMBCB_1    (0x00200000UL)
#define HRPWM_BPCNBR1_EMBRB_POS  (22U)
#define HRPWM_BPCNBR1_EMBRB      (0x00C00000UL)
#define HRPWM_BPCNBR1_EMBRB_0    (0x00400000UL)
#define HRPWM_BPCNBR1_EMBRB_1    (0x00800000UL)
#define HRPWM_BPCNBR1_EMBSB_POS  (24U)
#define HRPWM_BPCNBR1_EMBSB      (0x0F000000UL)
#define HRPWM_BPCNBR1_OUTENB_POS (28U)
#define HRPWM_BPCNBR1_OUTENB     (0x10000000UL)

