MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_PCNBR2 register */
#define HRPWM_PCNBR2_EXEV1UCB_POS  (0U)
#define HRPWM_PCNBR2_EXEV1UCB      (0x00000003UL)
#define HRPWM_PCNBR2_EXEV1UCB_0    (0x00000001UL)
#define HRPWM_PCNBR2_EXEV1UCB_1    (0x00000002UL)
#define HRPWM_PCNBR2_EXEV2UCB_POS  (2U)
#define HRPWM_PCNBR2_EXEV2UCB      (0x0000000CUL)
#define HRPWM_PCNBR2_EXEV2UCB_0    (0x00000004UL)
#define HRPWM_PCNBR2_EXEV2UCB_1    (0x00000008UL)
#define HRPWM_PCNBR2_EXEV3UCB_POS  (4U)
#define HRPWM_PCNBR2_EXEV3UCB      (0x00000030UL)
#define HRPWM_PCNBR2_EXEV3UCB_0    (0x00000010UL)
#define HRPWM_PCNBR2_EXEV3UCB_1    (0x00000020UL)
#define HRPWM_PCNBR2_EXEV4UCB_POS  (6U)
#define HRPWM_PCNBR2_EXEV4UCB      (0x000000C0UL)
#define HRPWM_PCNBR2_EXEV4UCB_0    (0x00000040UL)
#define HRPWM_PCNBR2_EXEV4UCB_1    (0x00000080UL)
#define HRPWM_PCNBR2_EXEV5UCB_POS  (8U)
#define HRPWM_PCNBR2_EXEV5UCB      (0x00000300UL)
#define HRPWM_PCNBR2_EXEV5UCB_0    (0x00000100UL)
#define HRPWM_PCNBR2_EXEV5UCB_1    (0x00000200UL)
#define HRPWM_PCNBR2_EXEV6UCB_POS  (10U)
#define HRPWM_PCNBR2_EXEV6UCB      (0x00000C00UL)
#define HRPWM_PCNBR2_EXEV6UCB_0    (0x00000400UL)
#define HRPWM_PCNBR2_EXEV6UCB_1    (0x00000800UL)
#define HRPWM_PCNBR2_EXEV7UCB_POS  (12U)
#define HRPWM_PCNBR2_EXEV7UCB      (0x00003000UL)
#define HRPWM_PCNBR2_EXEV7UCB_0    (0x00001000UL)
#define HRPWM_PCNBR2_EXEV7UCB_1    (0x00002000UL)
#define HRPWM_PCNBR2_EXEV8UCB_POS  (14U)
#define HRPWM_PCNBR2_EXEV8UCB      (0x0000C000UL)
#define HRPWM_PCNBR2_EXEV8UCB_0    (0x00004000UL)
#define HRPWM_PCNBR2_EXEV8UCB_1    (0x00008000UL)
#define HRPWM_PCNBR2_EXEV9UCB_POS  (16U)
#define HRPWM_PCNBR2_EXEV9UCB      (0x00030000UL)
#define HRPWM_PCNBR2_EXEV9UCB_0    (0x00010000UL)
#define HRPWM_PCNBR2_EXEV9UCB_1    (0x00020000UL)
#define HRPWM_PCNBR2_EXEV10UCB_POS (18U)
#define HRPWM_PCNBR2_EXEV10UCB     (0x000C0000UL)
#define HRPWM_PCNBR2_EXEV10UCB_0   (0x00040000UL)
#define HRPWM_PCNBR2_EXEV10UCB_1   (0x00080000UL)
#define HRPWM_PCNBR2_CMEUCB_POS    (20U)
#define HRPWM_PCNBR2_CMEUCB        (0x00300000UL)
#define HRPWM_PCNBR2_CMEUCB_0      (0x00100000UL)
#define HRPWM_PCNBR2_CMEUCB_1      (0x00200000UL)
#define HRPWM_PCNBR2_CMFUCB_POS    (22U)
#define HRPWM_PCNBR2_CMFUCB        (0x00C00000UL)
#define HRPWM_PCNBR2_CMFUCB_0      (0x00400000UL)
#define HRPWM_PCNBR2_CMFUCB_1      (0x00800000UL)
#define HRPWM_PCNBR2_SCMAUCB_POS   (24U)
#define HRPWM_PCNBR2_SCMAUCB       (0x03000000UL)
#define HRPWM_PCNBR2_SCMAUCB_0     (0x01000000UL)
#define HRPWM_PCNBR2_SCMAUCB_1     (0x02000000UL)
#define HRPWM_PCNBR2_SCMBUCB_POS   (26U)
#define HRPWM_PCNBR2_SCMBUCB       (0x0C000000UL)
#define HRPWM_PCNBR2_SCMBUCB_0     (0x04000000UL)
#define HRPWM_PCNBR2_SCMBUCB_1     (0x08000000UL)
#define HRPWM_PCNBR2_SFTUCB_POS    (30U)
#define HRPWM_PCNBR2_SFTUCB        (0xC0000000UL)
#define HRPWM_PCNBR2_SFTUCB_0      (0x40000000UL)
#define HRPWM_PCNBR2_SFTUCB_1      (0x80000000UL)

/* Bit definition for HRPWM_BPCNBR2 register */
#define HRPWM_BPCNBR2_EXEV1UCB_POS  (0U)
#define HRPWM_BPCNBR2_EXEV1UCB      (0x00000003UL)
#define HRPWM_BPCNBR2_EXEV1UCB_0    (0x00000001UL)
#define HRPWM_BPCNBR2_EXEV1UCB_1    (0x00000002UL)
#define HRPWM_BPCNBR2_EXEV2UCB_POS  (2U)
#define HRPWM_BPCNBR2_EXEV2UCB      (0x0000000CUL)
#define HRPWM_BPCNBR2_EXEV2UCB_0    (0x00000004UL)
#define HRPWM_BPCNBR2_EXEV2UCB_1    (0x00000008UL)
#define HRPWM_BPCNBR2_EXEV3UCB_POS  (4U)
#define HRPWM_BPCNBR2_EXEV3UCB      (0x00000030UL)
#define HRPWM_BPCNBR2_EXEV3UCB_0    (0x00000010UL)
#define HRPWM_BPCNBR2_EXEV3UCB_1    (0x00000020UL)
#define HRPWM_BPCNBR2_EXEV4UCB_POS  (6U)
#define HRPWM_BPCNBR2_EXEV4UCB      (0x000000C0UL)
#define HRPWM_BPCNBR2_EXEV4UCB_0    (0x00000040UL)
#define HRPWM_BPCNBR2_EXEV4UCB_1    (0x00000080UL)
#define HRPWM_BPCNBR2_EXEV5UCB_POS  (8U)
#define HRPWM_BPCNBR2_EXEV5UCB      (0x00000300UL)
#define HRPWM_BPCNBR2_EXEV5UCB_0    (0x00000100UL)
#define HRPWM_BPCNBR2_EXEV5UCB_1    (0x00000200UL)
#define HRPWM_BPCNBR2_EXEV6UCB_POS  (10U)
#define HRPWM_BPCNBR2_EXEV6UCB      (0x00000C00UL)
#define HRPWM_BPCNBR2_EXEV6UCB_0    (0x00000400UL)
#define HRPWM_BPCNBR2_EXEV6UCB_1    (0x00000800UL)
#define HRPWM_BPCNBR2_EXEV7UCB_POS  (12U)
#define HRPWM_BPCNBR2_EXEV7UCB      (0x00003000UL)
#define HRPWM_BPCNBR2_EXEV7UCB_0    (0x00001000UL)
#define HRPWM_BPCNBR2_EXEV7UCB_1    (0x00002000UL)
#define HRPWM_BPCNBR2_EXEV8UCB_POS  (14U)
#define HRPWM_BPCNBR2_EXEV8UCB      (0x0000C000UL)
#define HRPWM_BPCNBR2_EXEV8UCB_0    (0x00004000UL)
#define HRPWM_BPCNBR2_EXEV8UCB_1    (0x00008000UL)
#define HRPWM_BPCNBR2_EXEV9UCB_POS  (16U)
#define HRPWM_BPCNBR2_EXEV9UCB      (0x00030000UL)
#define HRPWM_BPCNBR2_EXEV9UCB_0    (0x00010000UL)
#define HRPWM_BPCNBR2_EXEV9UCB_1    (0x00020000UL)
#define HRPWM_BPCNBR2_EXEV10UCB_POS (18U)
#define HRPWM_BPCNBR2_EXEV10UCB     (0x000C0000UL)
#define HRPWM_BPCNBR2_EXEV10UCB_0   (0x00040000UL)
#define HRPWM_BPCNBR2_EXEV10UCB_1   (0x00080000UL)
#define HRPWM_BPCNBR2_CMEUCB_POS    (20U)
#define HRPWM_BPCNBR2_CMEUCB        (0x00300000UL)
#define HRPWM_BPCNBR2_CMEUCB_0      (0x00100000UL)
#define HRPWM_BPCNBR2_CMEUCB_1      (0x00200000UL)
#define HRPWM_BPCNBR2_CMFUCB_POS    (22U)
#define HRPWM_BPCNBR2_CMFUCB        (0x00C00000UL)
#define HRPWM_BPCNBR2_CMFUCB_0      (0x00400000UL)
#define HRPWM_BPCNBR2_CMFUCB_1      (0x00800000UL)
#define HRPWM_BPCNBR2_SCMAUCB_POS   (24U)
#define HRPWM_BPCNBR2_SCMAUCB       (0x03000000UL)
#define HRPWM_BPCNBR2_SCMAUCB_0     (0x01000000UL)
#define HRPWM_BPCNBR2_SCMAUCB_1     (0x02000000UL)
#define HRPWM_BPCNBR2_SCMBUCB_POS   (26U)
#define HRPWM_BPCNBR2_SCMBUCB       (0x0C000000UL)
#define HRPWM_BPCNBR2_SCMBUCB_0     (0x04000000UL)
#define HRPWM_BPCNBR2_SCMBUCB_1     (0x08000000UL)
#define HRPWM_BPCNBR2_SFTUCB_POS    (30U)
#define HRPWM_BPCNBR2_SFTUCB        (0xC0000000UL)
#define HRPWM_BPCNBR2_SFTUCB_0      (0x40000000UL)
#define HRPWM_BPCNBR2_SFTUCB_1      (0x80000000UL)

/* Bit definition for HRPWM_PCNBR3 register */
#define HRPWM_PCNBR3_EXEV1DCB_POS  (0U)
#define HRPWM_PCNBR3_EXEV1DCB      (0x00000003UL)
#define HRPWM_PCNBR3_EXEV1DCB_0    (0x00000001UL)
#define HRPWM_PCNBR3_EXEV1DCB_1    (0x00000002UL)
#define HRPWM_PCNBR3_EXEV2DCB_POS  (2U)
#define HRPWM_PCNBR3_EXEV2DCB      (0x0000000CUL)
#define HRPWM_PCNBR3_EXEV2DCB_0    (0x00000004UL)
#define HRPWM_PCNBR3_EXEV2DCB_1    (0x00000008UL)
#define HRPWM_PCNBR3_EXEV3DCB_POS  (4U)
#define HRPWM_PCNBR3_EXEV3DCB      (0x00000030UL)
#define HRPWM_PCNBR3_EXEV3DCB_0    (0x00000010UL)
#define HRPWM_PCNBR3_EXEV3DCB_1    (0x00000020UL)
#define HRPWM_PCNBR3_EXEV4DCB_POS  (6U)
#define HRPWM_PCNBR3_EXEV4DCB      (0x000000C0UL)
#define HRPWM_PCNBR3_EXEV4DCB_0    (0x00000040UL)
#define HRPWM_PCNBR3_EXEV4DCB_1    (0x00000080UL)
#define HRPWM_PCNBR3_EXEV5DCB_POS  (8U)
#define HRPWM_PCNBR3_EXEV5DCB      (0x00000300UL)
#define HRPWM_PCNBR3_EXEV5DCB_0    (0x00000100UL)
#define HRPWM_PCNBR3_EXEV5DCB_1    (0x00000200UL)
#define HRPWM_PCNBR3_EXEV6DCB_POS  (10U)
#define HRPWM_PCNBR3_EXEV6DCB      (0x00000C00UL)
#define HRPWM_PCNBR3_EXEV6DCB_0    (0x00000400UL)
#define HRPWM_PCNBR3_EXEV6DCB_1    (0x00000800UL)
#define HRPWM_PCNBR3_EXEV7DCB_POS  (12U)
#define HRPWM_PCNBR3_EXEV7DCB      (0x00003000UL)
#define HRPWM_PCNBR3_EXEV7DCB_0    (0x00001000UL)
#define HRPWM_PCNBR3_EXEV7DCB_1    (0x00002000UL)
#define HRPWM_PCNBR3_EXEV8DCB_POS  (14U)
#define HRPWM_PCNBR3_EXEV8DCB      (0x0000C000UL)
#define HRPWM_PCNBR3_EXEV8DCB_0    (0x00004000UL)
#define HRPWM_PCNBR3_EXEV8DCB_1    (0x00008000UL)
#define HRPWM_PCNBR3_EXEV9DCB_POS  (16U)
#define HRPWM_PCNBR3_EXEV9DCB      (0x00030000UL)
#define HRPWM_PCNBR3_EXEV9DCB_0    (0x00010000UL)
#define HRPWM_PCNBR3_EXEV9DCB_1    (0x00020000UL)
#define HRPWM_PCNBR3_EXEV10DCB_POS (18U)
#define HRPWM_PCNBR3_EXEV10DCB     (0x000C0000UL)
#define HRPWM_PCNBR3_EXEV10DCB_0   (0x00040000UL)
#define HRPWM_PCNBR3_EXEV10DCB_1   (0x00080000UL)
#define HRPWM_PCNBR3_CMEDCB_POS    (20U)
#define HRPWM_PCNBR3_CMEDCB        (0x00300000UL)
#define HRPWM_PCNBR3_CMEDCB_0      (0x00100000UL)
#define HRPWM_PCNBR3_CMEDCB_1      (0x00200000UL)
#define HRPWM_PCNBR3_CMFDCB_POS    (22U)
#define HRPWM_PCNBR3_CMFDCB        (0x00C00000UL)
#define HRPWM_PCNBR3_CMFDCB_0      (0x00400000UL)
#define HRPWM_PCNBR3_CMFDCB_1      (0x00800000UL)
#define HRPWM_PCNBR3_SCMADCB_POS   (24U)
#define HRPWM_PCNBR3_SCMADCB       (0x03000000UL)
#define HRPWM_PCNBR3_SCMADCB_0     (0x01000000UL)
#define HRPWM_PCNBR3_SCMADCB_1     (0x02000000UL)
#define HRPWM_PCNBR3_SCMBDCB_POS   (26U)
#define HRPWM_PCNBR3_SCMBDCB       (0x0C000000UL)
#define HRPWM_PCNBR3_SCMBDCB_0     (0x04000000UL)
#define HRPWM_PCNBR3_SCMBDCB_1     (0x08000000UL)
#define HRPWM_PCNBR3_SFTDCB_POS    (30U)
#define HRPWM_PCNBR3_SFTDCB        (0xC0000000UL)
#define HRPWM_PCNBR3_SFTDCB_0      (0x40000000UL)
#define HRPWM_PCNBR3_SFTDCB_1      (0x80000000UL)

/* Bit definition for HRPWM_BPCNBR3 register */
#define HRPWM_BPCNBR3_EXEV1DCB_POS  (0U)
#define HRPWM_BPCNBR3_EXEV1DCB      (0x00000003UL)
#define HRPWM_BPCNBR3_EXEV1DCB_0    (0x00000001UL)
#define HRPWM_BPCNBR3_EXEV1DCB_1    (0x00000002UL)
#define HRPWM_BPCNBR3_EXEV2DCB_POS  (2U)
#define HRPWM_BPCNBR3_EXEV2DCB      (0x0000000CUL)
#define HRPWM_BPCNBR3_EXEV2DCB_0    (0x00000004UL)
#define HRPWM_BPCNBR3_EXEV2DCB_1    (0x00000008UL)
#define HRPWM_BPCNBR3_EXEV3DCB_POS  (4U)
#define HRPWM_BPCNBR3_EXEV3DCB      (0x00000030UL)
#define HRPWM_BPCNBR3_EXEV3DCB_0    (0x00000010UL)
#define HRPWM_BPCNBR3_EXEV3DCB_1    (0x00000020UL)
#define HRPWM_BPCNBR3_EXEV4DCB_POS  (6U)
#define HRPWM_BPCNBR3_EXEV4DCB      (0x000000C0UL)
#define HRPWM_BPCNBR3_EXEV4DCB_0    (0x00000040UL)
#define HRPWM_BPCNBR3_EXEV4DCB_1    (0x00000080UL)
#define HRPWM_BPCNBR3_EXEV5DCB_POS  (8U)
#define HRPWM_BPCNBR3_EXEV5DCB      (0x00000300UL)
#define HRPWM_BPCNBR3_EXEV5DCB_0    (0x00000100UL)
#define HRPWM_BPCNBR3_EXEV5DCB_1    (0x00000200UL)
#define HRPWM_BPCNBR3_EXEV6DCB_POS  (10U)
#define HRPWM_BPCNBR3_EXEV6DCB      (0x00000C00UL)
#define HRPWM_BPCNBR3_EXEV6DCB_0    (0x00000400UL)
#define HRPWM_BPCNBR3_EXEV6DCB_1    (0x00000800UL)
#define HRPWM_BPCNBR3_EXEV7DCB_POS  (12U)
#define HRPWM_BPCNBR3_EXEV7DCB      (0x00003000UL)
#define HRPWM_BPCNBR3_EXEV7DCB_0    (0x00001000UL)
#define HRPWM_BPCNBR3_EXEV7DCB_1    (0x00002000UL)
#define HRPWM_BPCNBR3_EXEV8DCB_POS  (14U)
#define HRPWM_BPCNBR3_EXEV8DCB      (0x0000C000UL)
#define HRPWM_BPCNBR3_EXEV8DCB_0    (0x00004000UL)
#define HRPWM_BPCNBR3_EXEV8DCB_1    (0x00008000UL)
#define HRPWM_BPCNBR3_EXEV9DCB_POS  (16U)
#define HRPWM_BPCNBR3_EXEV9DCB      (0x00030000UL)
#define HRPWM_BPCNBR3_EXEV9DCB_0    (0x00010000UL)
#define HRPWM_BPCNBR3_EXEV9DCB_1    (0x00020000UL)
#define HRPWM_BPCNBR3_EXEV10DCB_POS (18U)
#define HRPWM_BPCNBR3_EXEV10DCB     (0x000C0000UL)
#define HRPWM_BPCNBR3_EXEV10DCB_0   (0x00040000UL)
#define HRPWM_BPCNBR3_EXEV10DCB_1   (0x00080000UL)
#define HRPWM_BPCNBR3_CMEDCB_POS    (20U)
#define HRPWM_BPCNBR3_CMEDCB        (0x00300000UL)
#define HRPWM_BPCNBR3_CMEDCB_0      (0x00100000UL)
#define HRPWM_BPCNBR3_CMEDCB_1      (0x00200000UL)
#define HRPWM_BPCNBR3_CMFDCB_POS    (22U)
#define HRPWM_BPCNBR3_CMFDCB        (0x00C00000UL)
#define HRPWM_BPCNBR3_CMFDCB_0      (0x00400000UL)
#define HRPWM_BPCNBR3_CMFDCB_1      (0x00800000UL)
#define HRPWM_BPCNBR3_SCMADCB_POS   (24U)
#define HRPWM_BPCNBR3_SCMADCB       (0x03000000UL)
#define HRPWM_BPCNBR3_SCMADCB_0     (0x01000000UL)
#define HRPWM_BPCNBR3_SCMADCB_1     (0x02000000UL)
#define HRPWM_BPCNBR3_SCMBDCB_POS   (26U)
#define HRPWM_BPCNBR3_SCMBDCB       (0x0C000000UL)
#define HRPWM_BPCNBR3_SCMBDCB_0     (0x04000000UL)
#define HRPWM_BPCNBR3_SCMBDCB_1     (0x08000000UL)
#define HRPWM_BPCNBR3_SFTDCB_POS    (30U)
#define HRPWM_BPCNBR3_SFTDCB        (0xC0000000UL)
#define HRPWM_BPCNBR3_SFTDCB_0      (0x40000000UL)
#define HRPWM_BPCNBR3_SFTDCB_1      (0x80000000UL)

