MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_PCNBR14 register */
#define HRPWM_PCNBR14_TMEVT1UCB_POS  (0U)
#define HRPWM_PCNBR14_TMEVT1UCB      (0x00000003UL)
#define HRPWM_PCNBR14_TMEVT1UCB_0    (0x00000001UL)
#define HRPWM_PCNBR14_TMEVT1UCB_1    (0x00000002UL)
#define HRPWM_PCNBR14_TMEVT2UCB_POS  (2U)
#define HRPWM_PCNBR14_TMEVT2UCB      (0x0000000CUL)
#define HRPWM_PCNBR14_TMEVT2UCB_0    (0x00000004UL)
#define HRPWM_PCNBR14_TMEVT2UCB_1    (0x00000008UL)
#define HRPWM_PCNBR14_TMEVT3UCB_POS  (4U)
#define HRPWM_PCNBR14_TMEVT3UCB      (0x00000030UL)
#define HRPWM_PCNBR14_TMEVT3UCB_0    (0x00000010UL)
#define HRPWM_PCNBR14_TMEVT3UCB_1    (0x00000020UL)
#define HRPWM_PCNBR14_TMEVT4UCB_POS  (6U)
#define HRPWM_PCNBR14_TMEVT4UCB      (0x000000C0UL)
#define HRPWM_PCNBR14_TMEVT4UCB_0    (0x00000040UL)
#define HRPWM_PCNBR14_TMEVT4UCB_1    (0x00000080UL)
#define HRPWM_PCNBR14_TMEVT5UCB_POS  (8U)
#define HRPWM_PCNBR14_TMEVT5UCB      (0x00000300UL)
#define HRPWM_PCNBR14_TMEVT5UCB_0    (0x00000100UL)
#define HRPWM_PCNBR14_TMEVT5UCB_1    (0x00000200UL)
#define HRPWM_PCNBR14_TMEVT6UCB_POS  (10U)
#define HRPWM_PCNBR14_TMEVT6UCB      (0x00000C00UL)
#define HRPWM_PCNBR14_TMEVT6UCB_0    (0x00000400UL)
#define HRPWM_PCNBR14_TMEVT6UCB_1    (0x00000800UL)
#define HRPWM_PCNBR14_TMEVT7UCB_POS  (12U)
#define HRPWM_PCNBR14_TMEVT7UCB      (0x00003000UL)
#define HRPWM_PCNBR14_TMEVT7UCB_0    (0x00001000UL)
#define HRPWM_PCNBR14_TMEVT7UCB_1    (0x00002000UL)
#define HRPWM_PCNBR14_TMEVT8UCB_POS  (14U)
#define HRPWM_PCNBR14_TMEVT8UCB      (0x0000C000UL)
#define HRPWM_PCNBR14_TMEVT8UCB_0    (0x00004000UL)
#define HRPWM_PCNBR14_TMEVT8UCB_1    (0x00008000UL)
#define HRPWM_PCNBR14_TMEVT9UCB_POS  (16U)
#define HRPWM_PCNBR14_TMEVT9UCB      (0x00030000UL)
#define HRPWM_PCNBR14_TMEVT9UCB_0    (0x00010000UL)
#define HRPWM_PCNBR14_TMEVT9UCB_1    (0x00020000UL)
#define HRPWM_PCNBR14_TMEVT10UCB_POS (18U)
#define HRPWM_PCNBR14_TMEVT10UCB     (0x000C0000UL)
#define HRPWM_PCNBR14_TMEVT10UCB_0   (0x00040000UL)
#define HRPWM_PCNBR14_TMEVT10UCB_1   (0x00080000UL)

/* Bit definition for HRPWM_PCNBR24 register */
#define HRPWM_PCNBR24_U1OVFUCB_POS   (0U)
#define HRPWM_PCNBR24_U1OVFUCB       (0x00000003UL)
#define HRPWM_PCNBR24_U1OVFUCB_0     (0x00000001UL)
#define HRPWM_PCNBR24_U1OVFUCB_1     (0x00000002UL)
#define HRPWM_PCNBR24_U1UDFUCB_POS   (2U)
#define HRPWM_PCNBR24_U1UDFUCB       (0x0000000CUL)
#define HRPWM_PCNBR24_U1UDFUCB_0     (0x00000004UL)
#define HRPWM_PCNBR24_U1UDFUCB_1     (0x00000008UL)
#define HRPWM_PCNBR24_U1CMFUCB_POS   (4U)
#define HRPWM_PCNBR24_U1CMFUCB       (0x00000030UL)
#define HRPWM_PCNBR24_U1CMFUCB_0     (0x00000010UL)
#define HRPWM_PCNBR24_U1CMFUCB_1     (0x00000020UL)
#define HRPWM_PCNBR24_U1CMEUCB_POS   (6U)
#define HRPWM_PCNBR24_U1CMEUCB       (0x000000C0UL)
#define HRPWM_PCNBR24_U1CMEUCB_0     (0x00000040UL)
#define HRPWM_PCNBR24_U1CMEUCB_1     (0x00000080UL)
#define HRPWM_PCNBR24_U1CMBUCB_POS   (8U)
#define HRPWM_PCNBR24_U1CMBUCB       (0x00000300UL)
#define HRPWM_PCNBR24_U1CMBUCB_0     (0x00000100UL)
#define HRPWM_PCNBR24_U1CMBUCB_1     (0x00000200UL)
#define HRPWM_PCNBR24_U1CMAUCB_POS   (10U)
#define HRPWM_PCNBR24_U1CMAUCB       (0x00000C00UL)
#define HRPWM_PCNBR24_U1CMAUCB_0     (0x00000400UL)
#define HRPWM_PCNBR24_U1CMAUCB_1     (0x00000800UL)
#define HRPWM_PCNBR24_TMEVT1UCB_POS  (12U)
#define HRPWM_PCNBR24_TMEVT1UCB      (0x00003000UL)
#define HRPWM_PCNBR24_TMEVT1UCB_0    (0x00001000UL)
#define HRPWM_PCNBR24_TMEVT1UCB_1    (0x00002000UL)
#define HRPWM_PCNBR24_TMEVT2UCB_POS  (14U)
#define HRPWM_PCNBR24_TMEVT2UCB      (0x0000C000UL)
#define HRPWM_PCNBR24_TMEVT2UCB_0    (0x00004000UL)
#define HRPWM_PCNBR24_TMEVT2UCB_1    (0x00008000UL)
#define HRPWM_PCNBR24_TMEVT3UCB_POS  (16U)
#define HRPWM_PCNBR24_TMEVT3UCB      (0x00030000UL)
#define HRPWM_PCNBR24_TMEVT3UCB_0    (0x00010000UL)
#define HRPWM_PCNBR24_TMEVT3UCB_1    (0x00020000UL)
#define HRPWM_PCNBR24_TMEVT4UCB_POS  (18U)
#define HRPWM_PCNBR24_TMEVT4UCB      (0x000C0000UL)
#define HRPWM_PCNBR24_TMEVT4UCB_0    (0x00040000UL)
#define HRPWM_PCNBR24_TMEVT4UCB_1    (0x00080000UL)
#define HRPWM_PCNBR24_TMEVT5UCB_POS  (20U)
#define HRPWM_PCNBR24_TMEVT5UCB      (0x00300000UL)
#define HRPWM_PCNBR24_TMEVT5UCB_0    (0x00100000UL)
#define HRPWM_PCNBR24_TMEVT5UCB_1    (0x00200000UL)
#define HRPWM_PCNBR24_TMEVT6UCB_POS  (22U)
#define HRPWM_PCNBR24_TMEVT6UCB      (0x00C00000UL)
#define HRPWM_PCNBR24_TMEVT6UCB_0    (0x00400000UL)
#define HRPWM_PCNBR24_TMEVT6UCB_1    (0x00800000UL)
#define HRPWM_PCNBR24_TMEVT7UCB_POS  (24U)
#define HRPWM_PCNBR24_TMEVT7UCB      (0x03000000UL)
#define HRPWM_PCNBR24_TMEVT7UCB_0    (0x01000000UL)
#define HRPWM_PCNBR24_TMEVT7UCB_1    (0x02000000UL)
#define HRPWM_PCNBR24_TMEVT8UCB_POS  (26U)
#define HRPWM_PCNBR24_TMEVT8UCB      (0x0C000000UL)
#define HRPWM_PCNBR24_TMEVT8UCB_0    (0x04000000UL)
#define HRPWM_PCNBR24_TMEVT8UCB_1    (0x08000000UL)
#define HRPWM_PCNBR24_TMEVT9UCB_POS  (28U)
#define HRPWM_PCNBR24_TMEVT9UCB      (0x30000000UL)
#define HRPWM_PCNBR24_TMEVT9UCB_0    (0x10000000UL)
#define HRPWM_PCNBR24_TMEVT9UCB_1    (0x20000000UL)
#define HRPWM_PCNBR24_TMEVT10UCB_POS (30U)
#define HRPWM_PCNBR24_TMEVT10UCB     (0xC0000000UL)
#define HRPWM_PCNBR24_TMEVT10UCB_0   (0x40000000UL)
#define HRPWM_PCNBR24_TMEVT10UCB_1   (0x80000000UL)

/* Bit definition for HRPWM_BPCNBR14 register */
#define HRPWM_BPCNBR14_TMEVT1UCB_POS  (0U)
#define HRPWM_BPCNBR14_TMEVT1UCB      (0x00000003UL)
#define HRPWM_BPCNBR14_TMEVT1UCB_0    (0x00000001UL)
#define HRPWM_BPCNBR14_TMEVT1UCB_1    (0x00000002UL)
#define HRPWM_BPCNBR14_TMEVT2UCB_POS  (2U)
#define HRPWM_BPCNBR14_TMEVT2UCB      (0x0000000CUL)
#define HRPWM_BPCNBR14_TMEVT2UCB_0    (0x00000004UL)
#define HRPWM_BPCNBR14_TMEVT2UCB_1    (0x00000008UL)
#define HRPWM_BPCNBR14_TMEVT3UCB_POS  (4U)
#define HRPWM_BPCNBR14_TMEVT3UCB      (0x00000030UL)
#define HRPWM_BPCNBR14_TMEVT3UCB_0    (0x00000010UL)
#define HRPWM_BPCNBR14_TMEVT3UCB_1    (0x00000020UL)
#define HRPWM_BPCNBR14_TMEVT4UCB_POS  (6U)
#define HRPWM_BPCNBR14_TMEVT4UCB      (0x000000C0UL)
#define HRPWM_BPCNBR14_TMEVT4UCB_0    (0x00000040UL)
#define HRPWM_BPCNBR14_TMEVT4UCB_1    (0x00000080UL)
#define HRPWM_BPCNBR14_TMEVT5UCB_POS  (8U)
#define HRPWM_BPCNBR14_TMEVT5UCB      (0x00000300UL)
#define HRPWM_BPCNBR14_TMEVT5UCB_0    (0x00000100UL)
#define HRPWM_BPCNBR14_TMEVT5UCB_1    (0x00000200UL)
#define HRPWM_BPCNBR14_TMEVT6UCB_POS  (10U)
#define HRPWM_BPCNBR14_TMEVT6UCB      (0x00000C00UL)
#define HRPWM_BPCNBR14_TMEVT6UCB_0    (0x00000400UL)
#define HRPWM_BPCNBR14_TMEVT6UCB_1    (0x00000800UL)
#define HRPWM_BPCNBR14_TMEVT7UCB_POS  (12U)
#define HRPWM_BPCNBR14_TMEVT7UCB      (0x00003000UL)
#define HRPWM_BPCNBR14_TMEVT7UCB_0    (0x00001000UL)
#define HRPWM_BPCNBR14_TMEVT7UCB_1    (0x00002000UL)
#define HRPWM_BPCNBR14_TMEVT8UCB_POS  (14U)
#define HRPWM_BPCNBR14_TMEVT8UCB      (0x0000C000UL)
#define HRPWM_BPCNBR14_TMEVT8UCB_0    (0x00004000UL)
#define HRPWM_BPCNBR14_TMEVT8UCB_1    (0x00008000UL)
#define HRPWM_BPCNBR14_TMEVT9UCB_POS  (16U)
#define HRPWM_BPCNBR14_TMEVT9UCB      (0x00030000UL)
#define HRPWM_BPCNBR14_TMEVT9UCB_0    (0x00010000UL)
#define HRPWM_BPCNBR14_TMEVT9UCB_1    (0x00020000UL)
#define HRPWM_BPCNBR14_TMEVT10UCB_POS (18U)
#define HRPWM_BPCNBR14_TMEVT10UCB     (0x000C0000UL)
#define HRPWM_BPCNBR14_TMEVT10UCB_0   (0x00040000UL)
#define HRPWM_BPCNBR14_TMEVT10UCB_1   (0x00080000UL)

/* Bit definition for HRPWM_BPCNBR24 register */
#define HRPWM_BPCNBR24_U1OVFUCB_POS   (0U)
#define HRPWM_BPCNBR24_U1OVFUCB       (0x00000003UL)
#define HRPWM_BPCNBR24_U1OVFUCB_0     (0x00000001UL)
#define HRPWM_BPCNBR24_U1OVFUCB_1     (0x00000002UL)
#define HRPWM_BPCNBR24_U1UDFUCB_POS   (2U)
#define HRPWM_BPCNBR24_U1UDFUCB       (0x0000000CUL)
#define HRPWM_BPCNBR24_U1UDFUCB_0     (0x00000004UL)
#define HRPWM_BPCNBR24_U1UDFUCB_1     (0x00000008UL)
#define HRPWM_BPCNBR24_U1CMFUCB_POS   (4U)
#define HRPWM_BPCNBR24_U1CMFUCB       (0x00000030UL)
#define HRPWM_BPCNBR24_U1CMFUCB_0     (0x00000010UL)
#define HRPWM_BPCNBR24_U1CMFUCB_1     (0x00000020UL)
#define HRPWM_BPCNBR24_U1CMEUCB_POS   (6U)
#define HRPWM_BPCNBR24_U1CMEUCB       (0x000000C0UL)
#define HRPWM_BPCNBR24_U1CMEUCB_0     (0x00000040UL)
#define HRPWM_BPCNBR24_U1CMEUCB_1     (0x00000080UL)
#define HRPWM_BPCNBR24_U1CMBUCB_POS   (8U)
#define HRPWM_BPCNBR24_U1CMBUCB       (0x00000300UL)
#define HRPWM_BPCNBR24_U1CMBUCB_0     (0x00000100UL)
#define HRPWM_BPCNBR24_U1CMBUCB_1     (0x00000200UL)
#define HRPWM_BPCNBR24_U1CMAUCB_POS   (10U)
#define HRPWM_BPCNBR24_U1CMAUCB       (0x00000C00UL)
#define HRPWM_BPCNBR24_U1CMAUCB_0     (0x00000400UL)
#define HRPWM_BPCNBR24_U1CMAUCB_1     (0x00000800UL)
#define HRPWM_BPCNBR24_TMEVT1UCB_POS  (12U)
#define HRPWM_BPCNBR24_TMEVT1UCB      (0x00003000UL)
#define HRPWM_BPCNBR24_TMEVT1UCB_0    (0x00001000UL)
#define HRPWM_BPCNBR24_TMEVT1UCB_1    (0x00002000UL)
#define HRPWM_BPCNBR24_TMEVT2UCB_POS  (14U)
#define HRPWM_BPCNBR24_TMEVT2UCB      (0x0000C000UL)
#define HRPWM_BPCNBR24_TMEVT2UCB_0    (0x00004000UL)
#define HRPWM_BPCNBR24_TMEVT2UCB_1    (0x00008000UL)
#define HRPWM_BPCNBR24_TMEVT3UCB_POS  (16U)
#define HRPWM_BPCNBR24_TMEVT3UCB      (0x00030000UL)
#define HRPWM_BPCNBR24_TMEVT3UCB_0    (0x00010000UL)
#define HRPWM_BPCNBR24_TMEVT3UCB_1    (0x00020000UL)
#define HRPWM_BPCNBR24_TMEVT4UCB_POS  (18U)
#define HRPWM_BPCNBR24_TMEVT4UCB      (0x000C0000UL)
#define HRPWM_BPCNBR24_TMEVT4UCB_0    (0x00040000UL)
#define HRPWM_BPCNBR24_TMEVT4UCB_1    (0x00080000UL)
#define HRPWM_BPCNBR24_TMEVT5UCB_POS  (20U)
#define HRPWM_BPCNBR24_TMEVT5UCB      (0x00300000UL)
#define HRPWM_BPCNBR24_TMEVT5UCB_0    (0x00100000UL)
#define HRPWM_BPCNBR24_TMEVT5UCB_1    (0x00200000UL)
#define HRPWM_BPCNBR24_TMEVT6UCB_POS  (22U)
#define HRPWM_BPCNBR24_TMEVT6UCB      (0x00C00000UL)
#define HRPWM_BPCNBR24_TMEVT6UCB_0    (0x00400000UL)
#define HRPWM_BPCNBR24_TMEVT6UCB_1    (0x00800000UL)
#define HRPWM_BPCNBR24_TMEVT7UCB_POS  (24U)
#define HRPWM_BPCNBR24_TMEVT7UCB      (0x03000000UL)
#define HRPWM_BPCNBR24_TMEVT7UCB_0    (0x01000000UL)
#define HRPWM_BPCNBR24_TMEVT7UCB_1    (0x02000000UL)
#define HRPWM_BPCNBR24_TMEVT8UCB_POS  (26U)
#define HRPWM_BPCNBR24_TMEVT8UCB      (0x0C000000UL)
#define HRPWM_BPCNBR24_TMEVT8UCB_0    (0x04000000UL)
#define HRPWM_BPCNBR24_TMEVT8UCB_1    (0x08000000UL)
#define HRPWM_BPCNBR24_TMEVT9UCB_POS  (28U)
#define HRPWM_BPCNBR24_TMEVT9UCB      (0x30000000UL)
#define HRPWM_BPCNBR24_TMEVT9UCB_0    (0x10000000UL)
#define HRPWM_BPCNBR24_TMEVT9UCB_1    (0x20000000UL)
#define HRPWM_BPCNBR24_TMEVT10UCB_POS (30U)
#define HRPWM_BPCNBR24_TMEVT10UCB     (0xC0000000UL)
#define HRPWM_BPCNBR24_TMEVT10UCB_0   (0x40000000UL)
#define HRPWM_BPCNBR24_TMEVT10UCB_1   (0x80000000UL)

/* Bit definition for HRPWM_PCNBR15 register */
#define HRPWM_PCNBR15_TMEVT1DCB_POS  (0U)
#define HRPWM_PCNBR15_TMEVT1DCB      (0x00000003UL)
#define HRPWM_PCNBR15_TMEVT1DCB_0    (0x00000001UL)
#define HRPWM_PCNBR15_TMEVT1DCB_1    (0x00000002UL)
#define HRPWM_PCNBR15_TMEVT2DCB_POS  (2U)
#define HRPWM_PCNBR15_TMEVT2DCB      (0x0000000CUL)
#define HRPWM_PCNBR15_TMEVT2DCB_0    (0x00000004UL)
#define HRPWM_PCNBR15_TMEVT2DCB_1    (0x00000008UL)
#define HRPWM_PCNBR15_TMEVT3DCB_POS  (4U)
#define HRPWM_PCNBR15_TMEVT3DCB      (0x00000030UL)
#define HRPWM_PCNBR15_TMEVT3DCB_0    (0x00000010UL)
#define HRPWM_PCNBR15_TMEVT3DCB_1    (0x00000020UL)
#define HRPWM_PCNBR15_TMEVT4DCB_POS  (6U)
#define HRPWM_PCNBR15_TMEVT4DCB      (0x000000C0UL)
#define HRPWM_PCNBR15_TMEVT4DCB_0    (0x00000040UL)
#define HRPWM_PCNBR15_TMEVT4DCB_1    (0x00000080UL)
#define HRPWM_PCNBR15_TMEVT5DCB_POS  (8U)
#define HRPWM_PCNBR15_TMEVT5DCB      (0x00000300UL)
#define HRPWM_PCNBR15_TMEVT5DCB_0    (0x00000100UL)
#define HRPWM_PCNBR15_TMEVT5DCB_1    (0x00000200UL)
#define HRPWM_PCNBR15_TMEVT6DCB_POS  (10U)
#define HRPWM_PCNBR15_TMEVT6DCB      (0x00000C00UL)
#define HRPWM_PCNBR15_TMEVT6DCB_0    (0x00000400UL)
#define HRPWM_PCNBR15_TMEVT6DCB_1    (0x00000800UL)
#define HRPWM_PCNBR15_TMEVT7DCB_POS  (12U)
#define HRPWM_PCNBR15_TMEVT7DCB      (0x00003000UL)
#define HRPWM_PCNBR15_TMEVT7DCB_0    (0x00001000UL)
#define HRPWM_PCNBR15_TMEVT7DCB_1    (0x00002000UL)
#define HRPWM_PCNBR15_TMEVT8DCB_POS  (14U)
#define HRPWM_PCNBR15_TMEVT8DCB      (0x0000C000UL)
#define HRPWM_PCNBR15_TMEVT8DCB_0    (0x00004000UL)
#define HRPWM_PCNBR15_TMEVT8DCB_1    (0x00008000UL)
#define HRPWM_PCNBR15_TMEVT9DCB_POS  (16U)
#define HRPWM_PCNBR15_TMEVT9DCB      (0x00030000UL)
#define HRPWM_PCNBR15_TMEVT9DCB_0    (0x00010000UL)
#define HRPWM_PCNBR15_TMEVT9DCB_1    (0x00020000UL)
#define HRPWM_PCNBR15_TMEVT10DCB_POS (18U)
#define HRPWM_PCNBR15_TMEVT10DCB     (0x000C0000UL)
#define HRPWM_PCNBR15_TMEVT10DCB_0   (0x00040000UL)
#define HRPWM_PCNBR15_TMEVT10DCB_1   (0x00080000UL)

/* Bit definition for HRPWM_PCNBR25 register */
#define HRPWM_PCNBR25_U1OVFDCB_POS   (0U)
#define HRPWM_PCNBR25_U1OVFDCB       (0x00000003UL)
#define HRPWM_PCNBR25_U1OVFDCB_0     (0x00000001UL)
#define HRPWM_PCNBR25_U1OVFDCB_1     (0x00000002UL)
#define HRPWM_PCNBR25_U1UDFDCB_POS   (2U)
#define HRPWM_PCNBR25_U1UDFDCB       (0x0000000CUL)
#define HRPWM_PCNBR25_U1UDFDCB_0     (0x00000004UL)
#define HRPWM_PCNBR25_U1UDFDCB_1     (0x00000008UL)
#define HRPWM_PCNBR25_U1CMFDCB_POS   (4U)
#define HRPWM_PCNBR25_U1CMFDCB       (0x00000030UL)
#define HRPWM_PCNBR25_U1CMFDCB_0     (0x00000010UL)
#define HRPWM_PCNBR25_U1CMFDCB_1     (0x00000020UL)
#define HRPWM_PCNBR25_U1CMEDCB_POS   (6U)
#define HRPWM_PCNBR25_U1CMEDCB       (0x000000C0UL)
#define HRPWM_PCNBR25_U1CMEDCB_0     (0x00000040UL)
#define HRPWM_PCNBR25_U1CMEDCB_1     (0x00000080UL)
#define HRPWM_PCNBR25_U1CMBDCB_POS   (8U)
#define HRPWM_PCNBR25_U1CMBDCB       (0x00000300UL)
#define HRPWM_PCNBR25_U1CMBDCB_0     (0x00000100UL)
#define HRPWM_PCNBR25_U1CMBDCB_1     (0x00000200UL)
#define HRPWM_PCNBR25_U1CMADCB_POS   (10U)
#define HRPWM_PCNBR25_U1CMADCB       (0x00000C00UL)
#define HRPWM_PCNBR25_U1CMADCB_0     (0x00000400UL)
#define HRPWM_PCNBR25_U1CMADCB_1     (0x00000800UL)
#define HRPWM_PCNBR25_TMEVT1DCB_POS  (12U)
#define HRPWM_PCNBR25_TMEVT1DCB      (0x00003000UL)
#define HRPWM_PCNBR25_TMEVT1DCB_0    (0x00001000UL)
#define HRPWM_PCNBR25_TMEVT1DCB_1    (0x00002000UL)
#define HRPWM_PCNBR25_TMEVT2DCB_POS  (14U)
#define HRPWM_PCNBR25_TMEVT2DCB      (0x0000C000UL)
#define HRPWM_PCNBR25_TMEVT2DCB_0    (0x00004000UL)
#define HRPWM_PCNBR25_TMEVT2DCB_1    (0x00008000UL)
#define HRPWM_PCNBR25_TMEVT3DCB_POS  (16U)
#define HRPWM_PCNBR25_TMEVT3DCB      (0x00030000UL)
#define HRPWM_PCNBR25_TMEVT3DCB_0    (0x00010000UL)
#define HRPWM_PCNBR25_TMEVT3DCB_1    (0x00020000UL)
#define HRPWM_PCNBR25_TMEVT4DCB_POS  (18U)
#define HRPWM_PCNBR25_TMEVT4DCB      (0x000C0000UL)
#define HRPWM_PCNBR25_TMEVT4DCB_0    (0x00040000UL)
#define HRPWM_PCNBR25_TMEVT4DCB_1    (0x00080000UL)
#define HRPWM_PCNBR25_TMEVT5DCB_POS  (20U)
#define HRPWM_PCNBR25_TMEVT5DCB      (0x00300000UL)
#define HRPWM_PCNBR25_TMEVT5DCB_0    (0x00100000UL)
#define HRPWM_PCNBR25_TMEVT5DCB_1    (0x00200000UL)
#define HRPWM_PCNBR25_TMEVT6DCB_POS  (22U)
#define HRPWM_PCNBR25_TMEVT6DCB      (0x00C00000UL)
#define HRPWM_PCNBR25_TMEVT6DCB_0    (0x00400000UL)
#define HRPWM_PCNBR25_TMEVT6DCB_1    (0x00800000UL)
#define HRPWM_PCNBR25_TMEVT7DCB_POS  (24U)
#define HRPWM_PCNBR25_TMEVT7DCB      (0x03000000UL)
#define HRPWM_PCNBR25_TMEVT7DCB_0    (0x01000000UL)
#define HRPWM_PCNBR25_TMEVT7DCB_1    (0x02000000UL)
#define HRPWM_PCNBR25_TMEVT8DCB_POS  (26U)
#define HRPWM_PCNBR25_TMEVT8DCB      (0x0C000000UL)
#define HRPWM_PCNBR25_TMEVT8DCB_0    (0x04000000UL)
#define HRPWM_PCNBR25_TMEVT8DCB_1    (0x08000000UL)
#define HRPWM_PCNBR25_TMEVT9DCB_POS  (28U)
#define HRPWM_PCNBR25_TMEVT9DCB      (0x30000000UL)
#define HRPWM_PCNBR25_TMEVT9DCB_0    (0x10000000UL)
#define HRPWM_PCNBR25_TMEVT9DCB_1    (0x20000000UL)
#define HRPWM_PCNBR25_TMEVT10DCB_POS (30U)
#define HRPWM_PCNBR25_TMEVT10DCB     (0xC0000000UL)
#define HRPWM_PCNBR25_TMEVT10DCB_0   (0x40000000UL)
#define HRPWM_PCNBR25_TMEVT10DCB_1   (0x80000000UL)

/* Bit definition for HRPWM_BPCNBR15 register */
#define HRPWM_BPCNBR15_TMEVT1DCB_POS  (0U)
#define HRPWM_BPCNBR15_TMEVT1DCB      (0x00000003UL)
#define HRPWM_BPCNBR15_TMEVT1DCB_0    (0x00000001UL)
#define HRPWM_BPCNBR15_TMEVT1DCB_1    (0x00000002UL)
#define HRPWM_BPCNBR15_TMEVT2DCB_POS  (2U)
#define HRPWM_BPCNBR15_TMEVT2DCB      (0x0000000CUL)
#define HRPWM_BPCNBR15_TMEVT2DCB_0    (0x00000004UL)
#define HRPWM_BPCNBR15_TMEVT2DCB_1    (0x00000008UL)
#define HRPWM_BPCNBR15_TMEVT3DCB_POS  (4U)
#define HRPWM_BPCNBR15_TMEVT3DCB      (0x00000030UL)
#define HRPWM_BPCNBR15_TMEVT3DCB_0    (0x00000010UL)
#define HRPWM_BPCNBR15_TMEVT3DCB_1    (0x00000020UL)
#define HRPWM_BPCNBR15_TMEVT4DCB_POS  (6U)
#define HRPWM_BPCNBR15_TMEVT4DCB      (0x000000C0UL)
#define HRPWM_BPCNBR15_TMEVT4DCB_0    (0x00000040UL)
#define HRPWM_BPCNBR15_TMEVT4DCB_1    (0x00000080UL)
#define HRPWM_BPCNBR15_TMEVT5DCB_POS  (8U)
#define HRPWM_BPCNBR15_TMEVT5DCB      (0x00000300UL)
#define HRPWM_BPCNBR15_TMEVT5DCB_0    (0x00000100UL)
#define HRPWM_BPCNBR15_TMEVT5DCB_1    (0x00000200UL)
#define HRPWM_BPCNBR15_TMEVT6DCB_POS  (10U)
#define HRPWM_BPCNBR15_TMEVT6DCB      (0x00000C00UL)
#define HRPWM_BPCNBR15_TMEVT6DCB_0    (0x00000400UL)
#define HRPWM_BPCNBR15_TMEVT6DCB_1    (0x00000800UL)
#define HRPWM_BPCNBR15_TMEVT7DCB_POS  (12U)
#define HRPWM_BPCNBR15_TMEVT7DCB      (0x00003000UL)
#define HRPWM_BPCNBR15_TMEVT7DCB_0    (0x00001000UL)
#define HRPWM_BPCNBR15_TMEVT7DCB_1    (0x00002000UL)
#define HRPWM_BPCNBR15_TMEVT8DCB_POS  (14U)
#define HRPWM_BPCNBR15_TMEVT8DCB      (0x0000C000UL)
#define HRPWM_BPCNBR15_TMEVT8DCB_0    (0x00004000UL)
#define HRPWM_BPCNBR15_TMEVT8DCB_1    (0x00008000UL)
#define HRPWM_BPCNBR15_TMEVT9DCB_POS  (16U)
#define HRPWM_BPCNBR15_TMEVT9DCB      (0x00030000UL)
#define HRPWM_BPCNBR15_TMEVT9DCB_0    (0x00010000UL)
#define HRPWM_BPCNBR15_TMEVT9DCB_1    (0x00020000UL)
#define HRPWM_BPCNBR15_TMEVT10DCB_POS (18U)
#define HRPWM_BPCNBR15_TMEVT10DCB     (0x000C0000UL)
#define HRPWM_BPCNBR15_TMEVT10DCB_0   (0x00040000UL)
#define HRPWM_BPCNBR15_TMEVT10DCB_1   (0x00080000UL)

