MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_BPCNBR25 register */
#define HRPWM_BPCNBR25_U1OVFDCB_POS   (0U)
#define HRPWM_BPCNBR25_U1OVFDCB       (0x00000003UL)
#define HRPWM_BPCNBR25_U1OVFDCB_0     (0x00000001UL)
#define HRPWM_BPCNBR25_U1OVFDCB_1     (0x00000002UL)
#define HRPWM_BPCNBR25_U1UDFDCB_POS   (2U)
#define HRPWM_BPCNBR25_U1UDFDCB       (0x0000000CUL)
#define HRPWM_BPCNBR25_U1UDFDCB_0     (0x00000004UL)
#define HRPWM_BPCNBR25_U1UDFDCB_1     (0x00000008UL)
#define HRPWM_BPCNBR25_U1CMFDCB_POS   (4U)
#define HRPWM_BPCNBR25_U1CMFDCB       (0x00000030UL)
#define HRPWM_BPCNBR25_U1CMFDCB_0     (0x00000010UL)
#define HRPWM_BPCNBR25_U1CMFDCB_1     (0x00000020UL)
#define HRPWM_BPCNBR25_U1CMEDCB_POS   (6U)
#define HRPWM_BPCNBR25_U1CMEDCB       (0x000000C0UL)
#define HRPWM_BPCNBR25_U1CMEDCB_0     (0x00000040UL)
#define HRPWM_BPCNBR25_U1CMEDCB_1     (0x00000080UL)
#define HRPWM_BPCNBR25_U1CMBDCB_POS   (8U)
#define HRPWM_BPCNBR25_U1CMBDCB       (0x00000300UL)
#define HRPWM_BPCNBR25_U1CMBDCB_0     (0x00000100UL)
#define HRPWM_BPCNBR25_U1CMBDCB_1     (0x00000200UL)
#define HRPWM_BPCNBR25_U1CMADCB_POS   (10U)
#define HRPWM_BPCNBR25_U1CMADCB       (0x00000C00UL)
#define HRPWM_BPCNBR25_U1CMADCB_0     (0x00000400UL)
#define HRPWM_BPCNBR25_U1CMADCB_1     (0x00000800UL)
#define HRPWM_BPCNBR25_TMEVT1DCB_POS  (12U)
#define HRPWM_BPCNBR25_TMEVT1DCB      (0x00003000UL)
#define HRPWM_BPCNBR25_TMEVT1DCB_0    (0x00001000UL)
#define HRPWM_BPCNBR25_TMEVT1DCB_1    (0x00002000UL)
#define HRPWM_BPCNBR25_TMEVT2DCB_POS  (14U)
#define HRPWM_BPCNBR25_TMEVT2DCB      (0x0000C000UL)
#define HRPWM_BPCNBR25_TMEVT2DCB_0    (0x00004000UL)
#define HRPWM_BPCNBR25_TMEVT2DCB_1    (0x00008000UL)
#define HRPWM_BPCNBR25_TMEVT3DCB_POS  (16U)
#define HRPWM_BPCNBR25_TMEVT3DCB      (0x00030000UL)
#define HRPWM_BPCNBR25_TMEVT3DCB_0    (0x00010000UL)
#define HRPWM_BPCNBR25_TMEVT3DCB_1    (0x00020000UL)
#define HRPWM_BPCNBR25_TMEVT4DCB_POS  (18U)
#define HRPWM_BPCNBR25_TMEVT4DCB      (0x000C0000UL)
#define HRPWM_BPCNBR25_TMEVT4DCB_0    (0x00040000UL)
#define HRPWM_BPCNBR25_TMEVT4DCB_1    (0x00080000UL)
#define HRPWM_BPCNBR25_TMEVT5DCB_POS  (20U)
#define HRPWM_BPCNBR25_TMEVT5DCB      (0x00300000UL)
#define HRPWM_BPCNBR25_TMEVT5DCB_0    (0x00100000UL)
#define HRPWM_BPCNBR25_TMEVT5DCB_1    (0x00200000UL)
#define HRPWM_BPCNBR25_TMEVT6DCB_POS  (22U)
#define HRPWM_BPCNBR25_TMEVT6DCB      (0x00C00000UL)
#define HRPWM_BPCNBR25_TMEVT6DCB_0    (0x00400000UL)
#define HRPWM_BPCNBR25_TMEVT6DCB_1    (0x00800000UL)
#define HRPWM_BPCNBR25_TMEVT7DCB_POS  (24U)
#define HRPWM_BPCNBR25_TMEVT7DCB      (0x03000000UL)
#define HRPWM_BPCNBR25_TMEVT7DCB_0    (0x01000000UL)
#define HRPWM_BPCNBR25_TMEVT7DCB_1    (0x02000000UL)
#define HRPWM_BPCNBR25_TMEVT8DCB_POS  (26U)
#define HRPWM_BPCNBR25_TMEVT8DCB      (0x0C000000UL)
#define HRPWM_BPCNBR25_TMEVT8DCB_0    (0x04000000UL)
#define HRPWM_BPCNBR25_TMEVT8DCB_1    (0x08000000UL)
#define HRPWM_BPCNBR25_TMEVT9DCB_POS  (28U)
#define HRPWM_BPCNBR25_TMEVT9DCB      (0x30000000UL)
#define HRPWM_BPCNBR25_TMEVT9DCB_0    (0x10000000UL)
#define HRPWM_BPCNBR25_TMEVT9DCB_1    (0x20000000UL)
#define HRPWM_BPCNBR25_TMEVT10DCB_POS (30U)
#define HRPWM_BPCNBR25_TMEVT10DCB     (0xC0000000UL)
#define HRPWM_BPCNBR25_TMEVT10DCB_0   (0x40000000UL)
#define HRPWM_BPCNBR25_TMEVT10DCB_1   (0x80000000UL)

/* Bit definition for HRPWM_AOSEOUTSELR register */
#define HRPWM_AOSEOUTSELR_AOSENDLYPRT_POS (0U)
#define HRPWM_AOSEOUTSELR_AOSENDLYPRT     (0x00000001UL)
#define HRPWM_AOSEOUTSELR_AOSENVPE_POS    (1U)
#define HRPWM_AOSEOUTSELR_AOSENVPE        (0x00000002UL)
#define HRPWM_AOSEOUTSELR_AOSENCAPB_POS   (2U)
#define HRPWM_AOSEOUTSELR_AOSENCAPB       (0x00000004UL)
#define HRPWM_AOSEOUTSELR_AOSENCAPA_POS   (3U)
#define HRPWM_AOSEOUTSELR_AOSENCAPA       (0x00000008UL)
#define HRPWM_AOSEOUTSELR_AOSENUDF_POS    (4U)
#define HRPWM_AOSEOUTSELR_AOSENUDF        (0x00000010UL)
#define HRPWM_AOSEOUTSELR_AOSENOVF_POS    (5U)
#define HRPWM_AOSEOUTSELR_AOSENOVF        (0x00000020UL)
#define HRPWM_AOSEOUTSELR_AOSENF_POS      (6U)
#define HRPWM_AOSEOUTSELR_AOSENF          (0x00000040UL)
#define HRPWM_AOSEOUTSELR_AOSENE_POS      (7U)
#define HRPWM_AOSEOUTSELR_AOSENE          (0x00000080UL)
#define HRPWM_AOSEOUTSELR_AOSEND_POS      (8U)
#define HRPWM_AOSEOUTSELR_AOSEND          (0x00000100UL)
#define HRPWM_AOSEOUTSELR_AOSENC_POS      (9U)
#define HRPWM_AOSEOUTSELR_AOSENC          (0x00000200UL)
#define HRPWM_AOSEOUTSELR_AOSENB_POS      (10U)
#define HRPWM_AOSEOUTSELR_AOSENB          (0x00000400UL)
#define HRPWM_AOSEOUTSELR_AOSENA_POS      (11U)
#define HRPWM_AOSEOUTSELR_AOSENA          (0x00000800UL)
#define HRPWM_AOSEOUTSELR_AOSENSCMB_POS   (12U)
#define HRPWM_AOSEOUTSELR_AOSENSCMB       (0x00001000UL)
#define HRPWM_AOSEOUTSELR_AOSENSCMA_POS   (13U)
#define HRPWM_AOSEOUTSELR_AOSENSCMA       (0x00002000UL)

/* Bit definition for HRPWM_BAOSEOUTSELR register */
#define HRPWM_BAOSEOUTSELR_AOSENDLYPRT_POS (0U)
#define HRPWM_BAOSEOUTSELR_AOSENDLYPRT     (0x00000001UL)
#define HRPWM_BAOSEOUTSELR_AOSENVPE_POS    (1U)
#define HRPWM_BAOSEOUTSELR_AOSENVPE        (0x00000002UL)
#define HRPWM_BAOSEOUTSELR_AOSENCAPB_POS   (2U)
#define HRPWM_BAOSEOUTSELR_AOSENCAPB       (0x00000004UL)
#define HRPWM_BAOSEOUTSELR_AOSENCAPA_POS   (3U)
#define HRPWM_BAOSEOUTSELR_AOSENCAPA       (0x00000008UL)
#define HRPWM_BAOSEOUTSELR_AOSENUDF_POS    (4U)
#define HRPWM_BAOSEOUTSELR_AOSENUDF        (0x00000010UL)
#define HRPWM_BAOSEOUTSELR_AOSENOVF_POS    (5U)
#define HRPWM_BAOSEOUTSELR_AOSENOVF        (0x00000020UL)
#define HRPWM_BAOSEOUTSELR_AOSENF_POS      (6U)
#define HRPWM_BAOSEOUTSELR_AOSENF          (0x00000040UL)
#define HRPWM_BAOSEOUTSELR_AOSENE_POS      (7U)
#define HRPWM_BAOSEOUTSELR_AOSENE          (0x00000080UL)
#define HRPWM_BAOSEOUTSELR_AOSEND_POS      (8U)
#define HRPWM_BAOSEOUTSELR_AOSEND          (0x00000100UL)
#define HRPWM_BAOSEOUTSELR_AOSENC_POS      (9U)
#define HRPWM_BAOSEOUTSELR_AOSENC          (0x00000200UL)
#define HRPWM_BAOSEOUTSELR_AOSENB_POS      (10U)
#define HRPWM_BAOSEOUTSELR_AOSENB          (0x00000400UL)
#define HRPWM_BAOSEOUTSELR_AOSENA_POS      (11U)
#define HRPWM_BAOSEOUTSELR_AOSENA          (0x00000800UL)
#define HRPWM_BAOSEOUTSELR_AOSENSCMB_POS   (12U)
#define HRPWM_BAOSEOUTSELR_AOSENSCMB       (0x00001000UL)
#define HRPWM_BAOSEOUTSELR_AOSENSCMA_POS   (13U)
#define HRPWM_BAOSEOUTSELR_AOSENSCMA       (0x00002000UL)

/* Bit definition for HRPWM_ICONR register */
#define HRPWM_ICONR_INTENA_POS    (0U)
#define HRPWM_ICONR_INTENA        (0x00000001UL)
#define HRPWM_ICONR_INTENB_POS    (1U)
#define HRPWM_ICONR_INTENB        (0x00000002UL)
#define HRPWM_ICONR_INTENC_POS    (2U)
#define HRPWM_ICONR_INTENC        (0x00000004UL)
#define HRPWM_ICONR_INTEND_POS    (3U)
#define HRPWM_ICONR_INTEND        (0x00000008UL)
#define HRPWM_ICONR_INTENE_POS    (4U)
#define HRPWM_ICONR_INTENE        (0x00000010UL)
#define HRPWM_ICONR_INTENF_POS    (5U)
#define HRPWM_ICONR_INTENF        (0x00000020UL)
#define HRPWM_ICONR_INTENOVF_POS  (6U)
#define HRPWM_ICONR_INTENOVF      (0x00000040UL)
#define HRPWM_ICONR_INTENUDF_POS  (7U)
#define HRPWM_ICONR_INTENUDF      (0x00000080UL)
#define HRPWM_ICONR_INTENCAPA_POS (14U)
#define HRPWM_ICONR_INTENCAPA     (0x00004000UL)
#define HRPWM_ICONR_INTENCAPB_POS (15U)
#define HRPWM_ICONR_INTENCAPB     (0x00008000UL)
#define HRPWM_ICONR_INTENSAU_POS  (16U)
#define HRPWM_ICONR_INTENSAU      (0x00010000UL)
#define HRPWM_ICONR_INTENSAD_POS  (17U)
#define HRPWM_ICONR_INTENSAD      (0x00020000UL)
#define HRPWM_ICONR_INTENSBU_POS  (18U)
#define HRPWM_ICONR_INTENSBU      (0x00040000UL)
#define HRPWM_ICONR_INTENSBD_POS  (19U)
#define HRPWM_ICONR_INTENSBD      (0x00080000UL)
#define HRPWM_ICONR_INTENVPE_POS  (24U)
#define HRPWM_ICONR_INTENVPE      (0x01000000UL)

