MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_BICONR register */
#define HRPWM_BICONR_INTENA_POS    (0U)
#define HRPWM_BICONR_INTENA        (0x00000001UL)
#define HRPWM_BICONR_INTENB_POS    (1U)
#define HRPWM_BICONR_INTENB        (0x00000002UL)
#define HRPWM_BICONR_INTENC_POS    (2U)
#define HRPWM_BICONR_INTENC        (0x00000004UL)
#define HRPWM_BICONR_INTEND_POS    (3U)
#define HRPWM_BICONR_INTEND        (0x00000008UL)
#define HRPWM_BICONR_INTENE_POS    (4U)
#define HRPWM_BICONR_INTENE        (0x00000010UL)
#define HRPWM_BICONR_INTENF_POS    (5U)
#define HRPWM_BICONR_INTENF        (0x00000020UL)
#define HRPWM_BICONR_INTENOVF_POS  (6U)
#define HRPWM_BICONR_INTENOVF      (0x00000040UL)
#define HRPWM_BICONR_NTENUDF_POS   (7U)
#define HRPWM_BICONR_NTENUDF       (0x00000080UL)
#define HRPWM_BICONR_INTENCAPA_POS (14U)
#define HRPWM_BICONR_INTENCAPA     (0x00004000UL)
#define HRPWM_BICONR_INTENCAPB_POS (15U)
#define HRPWM_BICONR_INTENCAPB     (0x00008000UL)
#define HRPWM_BICONR_INTENSAU_POS  (16U)
#define HRPWM_BICONR_INTENSAU      (0x00010000UL)
#define HRPWM_BICONR_INTENSAD_POS  (17U)
#define HRPWM_BICONR_INTENSAD      (0x00020000UL)
#define HRPWM_BICONR_INTENSBU_POS  (18U)
#define HRPWM_BICONR_INTENSBU      (0x00040000UL)
#define HRPWM_BICONR_INTENSBD_POS  (19U)
#define HRPWM_BICONR_INTENSBD      (0x00080000UL)
#define HRPWM_BICONR_INTENVPE_POS  (24U)
#define HRPWM_BICONR_INTENVPE      (0x01000000UL)

/* Bit definition for HRPWM_DCONR register */
#define HRPWM_DCONR_DTCEN_POS   (0U)
#define HRPWM_DCONR_DTCEN       (0x00000001UL)
#define HRPWM_DCONR_SEPA_POS    (1U)
#define HRPWM_DCONR_SEPA        (0x00000002UL)
#define HRPWM_DCONR_DTBENU_POS  (4U)
#define HRPWM_DCONR_DTBENU      (0x00000010UL)
#define HRPWM_DCONR_DTBEND_POS  (5U)
#define HRPWM_DCONR_DTBEND      (0x00000020UL)
#define HRPWM_DCONR_DTBTRU_POS  (6U)
#define HRPWM_DCONR_DTBTRU      (0x00000040UL)
#define HRPWM_DCONR_DTBTRD_POS  (7U)
#define HRPWM_DCONR_DTBTRD      (0x00000080UL)
#define HRPWM_DCONR_SDTR_POS    (8U)
#define HRPWM_DCONR_SDTR        (0x00000100UL)
#define HRPWM_DCONR_SDTF_POS    (9U)
#define HRPWM_DCONR_SDTF        (0x00000200UL)
#define HRPWM_DCONR_DTBENSD_POS (10U)
#define HRPWM_DCONR_DTBENSD     (0x00000400UL)
#define HRPWM_DCONR_DTFLK_POS   (12U)
#define HRPWM_DCONR_DTFLK       (0x00001000UL)
#define HRPWM_DCONR_DTRLK_POS   (13U)
#define HRPWM_DCONR_DTRLK       (0x00002000UL)
#define HRPWM_DCONR_DTFSLK_POS  (14U)
#define HRPWM_DCONR_DTFSLK      (0x00004000UL)
#define HRPWM_DCONR_DTRSLK_POS  (15U)
#define HRPWM_DCONR_DTRSLK      (0x00008000UL)

/* Bit definition for HRPWM_BDCONR register */
#define HRPWM_BDCONR_SDTR_POS (8U)
#define HRPWM_BDCONR_SDTR     (0x00000100UL)
#define HRPWM_BDCONR_SDTF_POS (9U)
#define HRPWM_BDCONR_SDTF     (0x00000200UL)

/* Bit definition for HRPWM_GCONR1 register */
#define HRPWM_GCONR1_INVCAEN_POS  (0U)
#define HRPWM_GCONR1_INVCAEN      (0x00000001UL)
#define HRPWM_GCONR1_INVCBEN_POS  (1U)
#define HRPWM_GCONR1_INVCBEN      (0x00000002UL)
#define HRPWM_GCONR1_SWAPEN_POS   (2U)
#define HRPWM_GCONR1_SWAPEN       (0x00000004UL)
#define HRPWM_GCONR1_SWAPMD_POS   (3U)
#define HRPWM_GCONR1_SWAPMD       (0x00000008UL)
#define HRPWM_GCONR1_HALF_POS     (4U)
#define HRPWM_GCONR1_HALF         (0x00000010UL)
#define HRPWM_GCONR1_PRDLK_POS    (5U)
#define HRPWM_GCONR1_PRDLK        (0x00000020UL)
#define HRPWM_GCONR1_EEFM_POS     (6U)
#define HRPWM_GCONR1_EEFM         (0x00000040UL)
#define HRPWM_GCONR1_EEFREF_POS   (7U)
#define HRPWM_GCONR1_EEFREF       (0x00000180UL)
#define HRPWM_GCONR1_EEFREF_0     (0x00000080UL)
#define HRPWM_GCONR1_EEFREF_1     (0x00000100UL)
#define HRPWM_GCONR1_PRDSEL_POS   (9U)
#define HRPWM_GCONR1_PRDSEL       (0x00000600UL)
#define HRPWM_GCONR1_PRDSEL_0     (0x00000200UL)
#define HRPWM_GCONR1_PRDSEL_1     (0x00000400UL)
#define HRPWM_GCONR1_CMSCAUEN_POS (16U)
#define HRPWM_GCONR1_CMSCAUEN     (0x00010000UL)
#define HRPWM_GCONR1_CMSCADEN_POS (17U)
#define HRPWM_GCONR1_CMSCADEN     (0x00020000UL)
#define HRPWM_GCONR1_CMSCBUEN_POS (18U)
#define HRPWM_GCONR1_CMSCBUEN     (0x00040000UL)
#define HRPWM_GCONR1_CMSCBDEN_POS (19U)
#define HRPWM_GCONR1_CMSCBDEN     (0x00080000UL)
#define HRPWM_GCONR1_BFSEL_POS    (20U)
#define HRPWM_GCONR1_BFSEL        (0x01F00000UL)

/* Bit definition for HRPWM_BGCONR1 register */
#define HRPWM_BGCONR1_INVCAEN_POS  (0U)
#define HRPWM_BGCONR1_INVCAEN      (0x00000001UL)
#define HRPWM_BGCONR1_INVCBEN_POS  (1U)
#define HRPWM_BGCONR1_INVCBEN      (0x00000002UL)
#define HRPWM_BGCONR1_SWAPEN_POS   (2U)
#define HRPWM_BGCONR1_SWAPEN       (0x00000004UL)
#define HRPWM_BGCONR1_SWAPMD_POS   (3U)
#define HRPWM_BGCONR1_SWAPMD       (0x00000008UL)
#define HRPWM_BGCONR1_HALF_POS     (4U)
#define HRPWM_BGCONR1_HALF         (0x00000010UL)
#define HRPWM_BGCONR1_PRDLK_POS    (5U)
#define HRPWM_BGCONR1_PRDLK        (0x00000020UL)
#define HRPWM_BGCONR1_EEFM_POS     (6U)
#define HRPWM_BGCONR1_EEFM         (0x00000040UL)
#define HRPWM_BGCONR1_EEFREF_POS   (7U)
#define HRPWM_BGCONR1_EEFREF       (0x00000180UL)
#define HRPWM_BGCONR1_EEFREF_0     (0x00000080UL)
#define HRPWM_BGCONR1_EEFREF_1     (0x00000100UL)
#define HRPWM_BGCONR1_PRDSEL_POS   (9U)
#define HRPWM_BGCONR1_PRDSEL       (0x00000600UL)
#define HRPWM_BGCONR1_PRDSEL_0     (0x00000200UL)
#define HRPWM_BGCONR1_PRDSEL_1     (0x00000400UL)
#define HRPWM_BGCONR1_CMSCAUEN_POS (16U)
#define HRPWM_BGCONR1_CMSCAUEN     (0x00010000UL)
#define HRPWM_BGCONR1_CMSCADEN_POS (17U)
#define HRPWM_BGCONR1_CMSCADEN     (0x00020000UL)
#define HRPWM_BGCONR1_CMSCBUEN_POS (18U)
#define HRPWM_BGCONR1_CMSCBUEN     (0x00040000UL)
#define HRPWM_BGCONR1_CMSCBDEN_POS (19U)
#define HRPWM_BGCONR1_CMSCBDEN     (0x00080000UL)
#define HRPWM_BGCONR1_BFSEL0_POS   (20U)
#define HRPWM_BGCONR1_BFSEL0       (0x00100000UL)
#define HRPWM_BGCONR1_BFSEL1_POS   (21U)
#define HRPWM_BGCONR1_BFSEL1       (0x00200000UL)
#define HRPWM_BGCONR1_BFSEL2_POS   (22U)
#define HRPWM_BGCONR1_BFSEL2       (0x00400000UL)
#define HRPWM_BGCONR1_BFSEL3_POS   (23U)
#define HRPWM_BGCONR1_BFSEL3       (0x00800000UL)
#define HRPWM_BGCONR1_BFSEL4_POS   (24U)
#define HRPWM_BGCONR1_BFSEL4       (0x01000000UL)

/* Bit definition for HRPWM_GCONR register */
#define HRPWM_GCONR_START_POS      (0U)
#define HRPWM_GCONR_START          (0x00000001UL)
#define HRPWM_GCONR_MODE_POS       (2U)
#define HRPWM_GCONR_MODE           (0x00000004UL)
#define HRPWM_GCONR_RETRIG_POS     (3U)
#define HRPWM_GCONR_RETRIG         (0x00000008UL)
#define HRPWM_GCONR_CKDIV_POS      (4U)
#define HRPWM_GCONR_CKDIV          (0x000000F0UL)
#define HRPWM_GCONR_OVSTP_POS      (8U)
#define HRPWM_GCONR_OVSTP          (0x00000100UL)
#define HRPWM_GCONR_TRGCALASEN_POS (13U)
#define HRPWM_GCONR_TRGCALASEN     (0x00002000UL)
#define HRPWM_GCONR_TRGCALMDEN_POS (14U)
#define HRPWM_GCONR_TRGCALMDEN     (0x00004000UL)
#define HRPWM_GCONR_TRGCALASMD_POS (15U)
#define HRPWM_GCONR_TRGCALASMD     (0x00008000UL)
#define HRPWM_GCONR_TRGCALMDMD_POS (16U)
#define HRPWM_GCONR_TRGCALMDMD     (0x00070000UL)
#define HRPWM_GCONR_STAAOSMUX_POS  (20U)
#define HRPWM_GCONR_STAAOSMUX      (0x00700000UL)
#define HRPWM_GCONR_CLRAOSMUX_POS  (23U)
#define HRPWM_GCONR_CLRAOSMUX      (0x03800000UL)
#define HRPWM_GCONR_CAPAOSMUX_POS  (26U)
#define HRPWM_GCONR_CAPAOSMUX      (0x1C000000UL)
#define HRPWM_GCONR_CAPBOSMUX_POS  (29U)
#define HRPWM_GCONR_CAPBOSMUX      (0xE0000000UL)

