MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_BCONR1 register */
#define HRPWM_BCONR1_BENAE_POS     (0U)
#define HRPWM_BCONR1_BENAE         (0x00000001UL)
#define HRPWM_BCONR1_BTRUAE_POS    (2U)
#define HRPWM_BCONR1_BTRUAE        (0x00000004UL)
#define HRPWM_BCONR1_BTRDAE_POS    (3U)
#define HRPWM_BCONR1_BTRDAE        (0x00000008UL)
#define HRPWM_BCONR1_BENBF_POS     (4U)
#define HRPWM_BCONR1_BENBF         (0x00000010UL)
#define HRPWM_BCONR1_BTRUBF_POS    (6U)
#define HRPWM_BCONR1_BTRUBF        (0x00000040UL)
#define HRPWM_BCONR1_BTRDBF_POS    (7U)
#define HRPWM_BCONR1_BTRDBF        (0x00000080UL)
#define HRPWM_BCONR1_BENP_POS      (8U)
#define HRPWM_BCONR1_BENP          (0x00000100UL)
#define HRPWM_BCONR1_BTRUP_POS     (10U)
#define HRPWM_BCONR1_BTRUP         (0x00000400UL)
#define HRPWM_BCONR1_BTRDP_POS     (11U)
#define HRPWM_BCONR1_BTRDP         (0x00000800UL)
#define HRPWM_BCONR1_BENVPE_POS    (12U)
#define HRPWM_BCONR1_BENVPE        (0x00001000UL)
#define HRPWM_BCONR1_BTRUVPE_POS   (14U)
#define HRPWM_BCONR1_BTRUVPE       (0x00004000UL)
#define HRPWM_BCONR1_BTRDVPE_POS   (15U)
#define HRPWM_BCONR1_BTRDVPE       (0x00008000UL)
#define HRPWM_BCONR1_BENSPA_POS    (16U)
#define HRPWM_BCONR1_BENSPA        (0x00010000UL)
#define HRPWM_BCONR1_BTRUSPA_POS   (18U)
#define HRPWM_BCONR1_BTRUSPA       (0x00040000UL)
#define HRPWM_BCONR1_BTRDSPA_POS   (19U)
#define HRPWM_BCONR1_BTRDSPA       (0x00080000UL)
#define HRPWM_BCONR1_BENSPB_POS    (20U)
#define HRPWM_BCONR1_BENSPB        (0x00100000UL)
#define HRPWM_BCONR1_BTRUSPB_POS   (22U)
#define HRPWM_BCONR1_BTRUSPB       (0x00400000UL)
#define HRPWM_BCONR1_BTRDSPB_POS   (23U)
#define HRPWM_BCONR1_BTRDSPB       (0x00800000UL)
#define HRPWM_BCONR1_BENPCN_POS    (27U)
#define HRPWM_BCONR1_BENPCN        (0x08000000UL)
#define HRPWM_BCONR1_BTRUPCN_POS   (28U)
#define HRPWM_BCONR1_BTRUPCN       (0x10000000UL)
#define HRPWM_BCONR1_BTRDPCN_POS   (29U)
#define HRPWM_BCONR1_BTRDPCN       (0x20000000UL)
#define HRPWM_BCONR1_BTRU0VPE_POS  (30U)
#define HRPWM_BCONR1_BTRU0VPE      (0x40000000UL)
#define HRPWM_BCONR1_BTRU0PVPE_POS (31U)
#define HRPWM_BCONR1_BTRU0PVPE     (0x80000000UL)

/* Bit definition for HRPWM_BCONR2 register */
#define HRPWM_BCONR2_BENEEFOFF_POS    (0U)
#define HRPWM_BCONR2_BENEEFOFF        (0x00000001UL)
#define HRPWM_BCONR2_BTRUEEFOFF_POS   (1U)
#define HRPWM_BCONR2_BTRUEEFOFF       (0x00000002UL)
#define HRPWM_BCONR2_BTRDEEFOFF_POS   (2U)
#define HRPWM_BCONR2_BTRDEEFOFF       (0x00000004UL)
#define HRPWM_BCONR2_BENEEFWIN_POS    (3U)
#define HRPWM_BCONR2_BENEEFWIN        (0x00000008UL)
#define HRPWM_BCONR2_BTRUEEFWIN_POS   (4U)
#define HRPWM_BCONR2_BTRUEEFWIN       (0x00000010UL)
#define HRPWM_BCONR2_BTRDEEFWIN_POS   (5U)
#define HRPWM_BCONR2_BTRDEEFWIN       (0x00000020UL)
#define HRPWM_BCONR2_BTRU0EEFOFF_POS  (6U)
#define HRPWM_BCONR2_BTRU0EEFOFF      (0x00000040UL)
#define HRPWM_BCONR2_BTRU0EEFWIN_POS  (7U)
#define HRPWM_BCONR2_BTRU0EEFWIN      (0x00000080UL)
#define HRPWM_BCONR2_BTRU0PEEFOFF_POS (8U)
#define HRPWM_BCONR2_BTRU0PEEFOFF     (0x00000100UL)
#define HRPWM_BCONR2_BTRU0PEEFWIN_POS (9U)
#define HRPWM_BCONR2_BTRU0PEEFWIN     (0x00000200UL)
#define HRPWM_BCONR2_BENCTL_POS       (12U)
#define HRPWM_BCONR2_BENCTL           (0x00001000UL)
#define HRPWM_BCONR2_BTRUCTL_POS      (13U)
#define HRPWM_BCONR2_BTRUCTL          (0x00002000UL)
#define HRPWM_BCONR2_BTRDCTL_POS      (14U)
#define HRPWM_BCONR2_BTRDCTL          (0x00004000UL)
#define HRPWM_BCONR2_BTRU0AE_POS      (16U)
#define HRPWM_BCONR2_BTRU0AE          (0x00010000UL)
#define HRPWM_BCONR2_BTRU0BF_POS      (17U)
#define HRPWM_BCONR2_BTRU0BF          (0x00020000UL)
#define HRPWM_BCONR2_BTRU0P_POS       (18U)
#define HRPWM_BCONR2_BTRU0P           (0x00040000UL)
#define HRPWM_BCONR2_BTRU0SPA_POS     (19U)
#define HRPWM_BCONR2_BTRU0SPA         (0x00080000UL)
#define HRPWM_BCONR2_BTRU0SPB_POS     (20U)
#define HRPWM_BCONR2_BTRU0SPB         (0x00100000UL)
#define HRPWM_BCONR2_BTRU0DT_POS      (21U)
#define HRPWM_BCONR2_BTRU0DT          (0x00200000UL)
#define HRPWM_BCONR2_BTRU0CTL_POS     (22U)
#define HRPWM_BCONR2_BTRU0CTL         (0x00400000UL)
#define HRPWM_BCONR2_BTRU0PAE_POS     (23U)
#define HRPWM_BCONR2_BTRU0PAE         (0x00800000UL)
#define HRPWM_BCONR2_BTRU0PBF_POS     (24U)
#define HRPWM_BCONR2_BTRU0PBF         (0x01000000UL)
#define HRPWM_BCONR2_BTRU0PP_POS      (25U)
#define HRPWM_BCONR2_BTRU0PP          (0x02000000UL)
#define HRPWM_BCONR2_BTRU0PSPA_POS    (26U)
#define HRPWM_BCONR2_BTRU0PSPA        (0x04000000UL)
#define HRPWM_BCONR2_BTRU0PSPB_POS    (27U)
#define HRPWM_BCONR2_BTRU0PSPB        (0x08000000UL)
#define HRPWM_BCONR2_BTRU0PDT_POS     (28U)
#define HRPWM_BCONR2_BTRU0PDT         (0x10000000UL)
#define HRPWM_BCONR2_BTRU0PCTL_POS    (29U)
#define HRPWM_BCONR2_BTRU0PCTL        (0x20000000UL)
#define HRPWM_BCONR2_BTRU0PCN_POS     (30U)
#define HRPWM_BCONR2_BTRU0PCN         (0x40000000UL)
#define HRPWM_BCONR2_BTRU0PPCN_POS    (31U)
#define HRPWM_BCONR2_BTRU0PPCN        (0x80000000UL)

/* Bit definition for HRPWM_GBCR register */
#define HRPWM_GBCR_U1U_POS         (0U)
#define HRPWM_GBCR_U1U             (0x00000001UL)
#define HRPWM_GBCR_U2U_POS         (1U)
#define HRPWM_GBCR_U2U             (0x00000002UL)
#define HRPWM_GBCR_U3U_POS         (2U)
#define HRPWM_GBCR_U3U             (0x00000004UL)
#define HRPWM_GBCR_U4U_POS         (3U)
#define HRPWM_GBCR_U4U             (0x00000008UL)
#define HRPWM_GBCR_U5U_POS         (4U)
#define HRPWM_GBCR_U5U             (0x00000010UL)
#define HRPWM_GBCR_U6U_POS         (5U)
#define HRPWM_GBCR_U6U             (0x00000020UL)
#define HRPWM_GBCR_U7U_POS         (6U)
#define HRPWM_GBCR_U7U             (0x00000040UL)
#define HRPWM_GBCR_U8U_POS         (7U)
#define HRPWM_GBCR_U8U             (0x00000080UL)
#define HRPWM_GBCR_UPDGAT_POS      (12U)
#define HRPWM_GBCR_UPDGAT          (0x0000F000UL)
#define HRPWM_GBCR_VPEU_POS        (16U)
#define HRPWM_GBCR_VPEU            (0x00010000UL)
#define HRPWM_GBCR_UDFU_POS        (17U)
#define HRPWM_GBCR_UDFU            (0x00020000UL)
#define HRPWM_GBCR_OVFU_POS        (18U)
#define HRPWM_GBCR_OVFU            (0x00040000UL)
#define HRPWM_GBCR_RSYNCMD_POS     (19U)
#define HRPWM_GBCR_RSYNCMD         (0x00180000UL)
#define HRPWM_GBCR_RSYNCMD_0       (0x00080000UL)
#define HRPWM_GBCR_RSYNCMD_1       (0x00100000UL)
#define HRPWM_GBCR_STPU_POS        (21U)
#define HRPWM_GBCR_STPU            (0x00200000UL)
#define HRPWM_GBCR_GBEN_POS        (22U)
#define HRPWM_GBCR_GBEN            (0x00400000UL)
#define HRPWM_GBCR_SBTRUSFTMD_POS  (23U)
#define HRPWM_GBCR_SBTRUSFTMD      (0x00800000UL)
#define HRPWM_GBCR_GBENHDCLREN_POS (24U)
#define HRPWM_GBCR_GBENHDCLREN     (0x01000000UL)

/* Bit definition for HRPWM_GBCFG register */
#define HRPWM_GBCFG_GCMAER_POS      (0U)
#define HRPWM_GBCFG_GCMAER          (0x00000001UL)
#define HRPWM_GBCFG_GCMBFR_POS      (1U)
#define HRPWM_GBCFG_GCMBFR          (0x00000002UL)
#define HRPWM_GBCFG_PERAR_POS       (2U)
#define HRPWM_GBCFG_PERAR           (0x00000004UL)
#define HRPWM_GBCFG_SCMAR_POS       (3U)
#define HRPWM_GBCFG_SCMAR           (0x00000008UL)
#define HRPWM_GBCFG_SCMBR_POS       (4U)
#define HRPWM_GBCFG_SCMBR           (0x00000010UL)
#define HRPWM_GBCFG_EEFOFFSETAR_POS (5U)
#define HRPWM_GBCFG_EEFOFFSETAR     (0x00000020UL)
#define HRPWM_GBCFG_EEFWINAR_POS    (6U)
#define HRPWM_GBCFG_EEFWINAR        (0x00000040UL)
#define HRPWM_GBCFG_DTAR_POS        (7U)
#define HRPWM_GBCFG_DTAR            (0x00000080UL)
#define HRPWM_GBCFG_CTLR_POS        (8U)
#define HRPWM_GBCFG_CTLR            (0x00000100UL)
#define HRPWM_GBCFG_PHSCMPAR_POS    (9U)
#define HRPWM_GBCFG_PHSCMPAR        (0x00000200UL)
#define HRPWM_GBCFG_VPER_POS        (10U)
#define HRPWM_GBCFG_VPER            (0x00000400UL)
#define HRPWM_GBCFG_PCN_POS         (12U)
#define HRPWM_GBCFG_PCN             (0x00001000UL)

/* Bit definition for HRPWM_IDLECR register */
#define HRPWM_IDLECR_IDLEBMA_POS     (0U)
#define HRPWM_IDLECR_IDLEBMA         (0x00000001UL)
#define HRPWM_IDLECR_IDLESA_POS      (1U)
#define HRPWM_IDLECR_IDLESA          (0x00000002UL)
#define HRPWM_IDLECR_DIDLA_POS       (2U)
#define HRPWM_IDLECR_DIDLA           (0x00000004UL)
#define HRPWM_IDLECR_DLYCHA_POS      (3U)
#define HRPWM_IDLECR_DLYCHA          (0x00000008UL)
#define HRPWM_IDLECR_CHPA_POS        (4U)
#define HRPWM_IDLECR_CHPA            (0x00000010UL)
#define HRPWM_IDLECR_DLYPRTEN_POS    (8U)
#define HRPWM_IDLECR_DLYPRTEN        (0x00000100UL)
#define HRPWM_IDLECR_DLYEVSEL_POS    (9U)
#define HRPWM_IDLECR_DLYEVSEL        (0x00000E00UL)
#define HRPWM_IDLECR_DLYSTRG_POS     (12U)
#define HRPWM_IDLECR_DLYSTRG         (0x00001000UL)
#define HRPWM_IDLECR_IDLEBMB_POS     (16U)
#define HRPWM_IDLECR_IDLEBMB         (0x00010000UL)
#define HRPWM_IDLECR_IDLESB_POS      (17U)
#define HRPWM_IDLECR_IDLESB          (0x00020000UL)
#define HRPWM_IDLECR_DIDLB_POS       (18U)
#define HRPWM_IDLECR_DIDLB           (0x00040000UL)
#define HRPWM_IDLECR_DLYCHB_POS      (19U)
#define HRPWM_IDLECR_DLYCHB          (0x00080000UL)
#define HRPWM_IDLECR_CHPB_POS        (20U)
#define HRPWM_IDLECR_CHPB            (0x00100000UL)
#define HRPWM_IDLECR_BIDLE_POS       (21U)
#define HRPWM_IDLECR_BIDLE           (0x00200000UL)
#define HRPWM_IDLECR_BIAR_POS        (22U)
#define HRPWM_IDLECR_BIAR            (0x00400000UL)
#define HRPWM_IDLECR_INTENDLYPRT_POS (24U)
#define HRPWM_IDLECR_INTENDLYPRT     (0x01000000UL)
#define HRPWM_IDLECR_FOLLOW_POS      (25U)
#define HRPWM_IDLECR_FOLLOW          (0x02000000UL)

/* Bit definition for HRPWM_CHPCR register */
#define HRPWM_CHPCR_CARFRQ_POS (0U)
#define HRPWM_CHPCR_CARFRQ     (0x0000000FUL)
#define HRPWM_CHPCR_CARDTY_POS (4U)
#define HRPWM_CHPCR_CARDTY     (0x00000070UL)
#define HRPWM_CHPCR_STRPW_POS  (7U)
#define HRPWM_CHPCR_STRPW      (0x00000780UL)

