MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_STFLR1 register */
#define HRPWM_STFLR1_CMAF_POS    (0U)
#define HRPWM_STFLR1_CMAF        (0x00000001UL)
#define HRPWM_STFLR1_CMBF_POS    (1U)
#define HRPWM_STFLR1_CMBF        (0x00000002UL)
#define HRPWM_STFLR1_CMCF_POS    (2U)
#define HRPWM_STFLR1_CMCF        (0x00000004UL)
#define HRPWM_STFLR1_CMDF_POS    (3U)
#define HRPWM_STFLR1_CMDF        (0x00000008UL)
#define HRPWM_STFLR1_CMEF_POS    (4U)
#define HRPWM_STFLR1_CMEF        (0x00000010UL)
#define HRPWM_STFLR1_CMFF_POS    (5U)
#define HRPWM_STFLR1_CMFF        (0x00000020UL)
#define HRPWM_STFLR1_OVFF_POS    (6U)
#define HRPWM_STFLR1_OVFF        (0x00000040UL)
#define HRPWM_STFLR1_UDFF_POS    (7U)
#define HRPWM_STFLR1_UDFF        (0x00000080UL)
#define HRPWM_STFLR1_CMSAUF_POS  (9U)
#define HRPWM_STFLR1_CMSAUF      (0x00000200UL)
#define HRPWM_STFLR1_CMSADF_POS  (10U)
#define HRPWM_STFLR1_CMSADF      (0x00000400UL)
#define HRPWM_STFLR1_CMSBUF_POS  (11U)
#define HRPWM_STFLR1_CMSBUF      (0x00000800UL)
#define HRPWM_STFLR1_CMSBDF_POS  (12U)
#define HRPWM_STFLR1_CMSBDF      (0x00001000UL)
#define HRPWM_STFLR1_VPEF_POS    (16U)
#define HRPWM_STFLR1_VPEF        (0x00010000UL)
#define HRPWM_STFLR1_VPERNUM_POS (21U)
#define HRPWM_STFLR1_VPERNUM     (0x03E00000UL)
#define HRPWM_STFLR1_CAPAF_POS   (26U)
#define HRPWM_STFLR1_CAPAF       (0x04000000UL)
#define HRPWM_STFLR1_CAPBF_POS   (27U)
#define HRPWM_STFLR1_CAPBF       (0x08000000UL)
#define HRPWM_STFLR1_DIRF_POS    (31U)
#define HRPWM_STFLR1_DIRF        (0x80000000UL)

/* Bit definition for HRPWM_STFLR2 register */
#define HRPWM_STFLR2_DLYIDLEA_POS (0U)
#define HRPWM_STFLR2_DLYIDLEA     (0x00000001UL)
#define HRPWM_STFLR2_DLYIDLEB_POS (1U)
#define HRPWM_STFLR2_DLYIDLEB     (0x00000002UL)
#define HRPWM_STFLR2_DLYPRT_POS   (2U)
#define HRPWM_STFLR2_DLYPRT       (0x00000004UL)
#define HRPWM_STFLR2_CPPSTAT_POS  (3U)
#define HRPWM_STFLR2_CPPSTAT      (0x00000008UL)
#define HRPWM_STFLR2_OASTAT_POS   (4U)
#define HRPWM_STFLR2_OASTAT       (0x00000010UL)
#define HRPWM_STFLR2_OBSTAT_POS   (5U)
#define HRPWM_STFLR2_OBSTAT       (0x00000020UL)
#define HRPWM_STFLR2_IPPSTAT_POS  (6U)
#define HRPWM_STFLR2_IPPSTAT      (0x00000040UL)
#define HRPWM_STFLR2_PHSCMP6F_POS (8U)
#define HRPWM_STFLR2_PHSCMP6F     (0x00000100UL)
#define HRPWM_STFLR2_PHSCMP7F_POS (9U)
#define HRPWM_STFLR2_PHSCMP7F     (0x00000200UL)
#define HRPWM_STFLR2_PHSCMP1F_POS (11U)
#define HRPWM_STFLR2_PHSCMP1F     (0x00000800UL)
#define HRPWM_STFLR2_PHSCMP2F_POS (12U)
#define HRPWM_STFLR2_PHSCMP2F     (0x00001000UL)
#define HRPWM_STFLR2_PHSCMP3F_POS (13U)
#define HRPWM_STFLR2_PHSCMP3F     (0x00002000UL)
#define HRPWM_STFLR2_PHSCMP4F_POS (14U)
#define HRPWM_STFLR2_PHSCMP4F     (0x00004000UL)
#define HRPWM_STFLR2_PHSCMP5F_POS (15U)
#define HRPWM_STFLR2_PHSCMP5F     (0x00008000UL)
#define HRPWM_STFLR2_OSTOVF_POS   (16U)
#define HRPWM_STFLR2_OSTOVF       (0x00010000UL)

/* Bit definition for HRPWM_HSTAR1 register */
#define HRPWM_HSTAR1_HSTAGCMA7_POS (0U)
#define HRPWM_HSTAR1_HSTAGCMA7     (0x00000001UL)
#define HRPWM_HSTAR1_HSTAGCMB7_POS (1U)
#define HRPWM_HSTAR1_HSTAGCMB7     (0x00000002UL)
#define HRPWM_HSTAR1_HSTAGCMA8_POS (2U)
#define HRPWM_HSTAR1_HSTAGCMA8     (0x00000004UL)
#define HRPWM_HSTAR1_HSTAGCMB8_POS (3U)
#define HRPWM_HSTAR1_HSTAGCMB8     (0x00000008UL)
#define HRPWM_HSTAR1_STAS_POS      (7U)
#define HRPWM_HSTAR1_STAS          (0x00000080UL)
#define HRPWM_HSTAR1_HSTA8_POS     (8U)
#define HRPWM_HSTAR1_HSTA8         (0x00000100UL)
#define HRPWM_HSTAR1_HSTA9_POS     (9U)
#define HRPWM_HSTAR1_HSTA9         (0x00000200UL)
#define HRPWM_HSTAR1_HSTA10_POS    (10U)
#define HRPWM_HSTAR1_HSTA10        (0x00000400UL)
#define HRPWM_HSTAR1_HSTA11_POS    (11U)
#define HRPWM_HSTAR1_HSTA11        (0x00000800UL)
#define HRPWM_HSTAR1_HSTASCMB7_POS (12U)
#define HRPWM_HSTAR1_HSTASCMB7     (0x00001000UL)
#define HRPWM_HSTAR1_HSTASCMB8_POS (13U)
#define HRPWM_HSTAR1_HSTASCMB8     (0x00002000UL)
#define HRPWM_HSTAR1_HSTA16_POS    (16U)
#define HRPWM_HSTAR1_HSTA16        (0x00010000UL)
#define HRPWM_HSTAR1_HSTA17_POS    (17U)
#define HRPWM_HSTAR1_HSTA17        (0x00020000UL)
#define HRPWM_HSTAR1_HSTA18_POS    (18U)
#define HRPWM_HSTAR1_HSTA18        (0x00040000UL)
#define HRPWM_HSTAR1_HSTA19_POS    (19U)
#define HRPWM_HSTAR1_HSTA19        (0x00080000UL)
#define HRPWM_HSTAR1_HSTA20_POS    (20U)
#define HRPWM_HSTAR1_HSTA20        (0x00100000UL)
#define HRPWM_HSTAR1_HSTA21_POS    (21U)
#define HRPWM_HSTAR1_HSTA21        (0x00200000UL)
#define HRPWM_HSTAR1_HSTA22_POS    (22U)
#define HRPWM_HSTAR1_HSTA22        (0x00400000UL)
#define HRPWM_HSTAR1_HSTA23_POS    (23U)
#define HRPWM_HSTAR1_HSTA23        (0x00800000UL)
#define HRPWM_HSTAR1_HSTAGCMF2_POS (24U)
#define HRPWM_HSTAR1_HSTAGCMF2     (0x01000000UL)
#define HRPWM_HSTAR1_HSTAGCMF3_POS (25U)
#define HRPWM_HSTAR1_HSTAGCMF3     (0x02000000UL)
#define HRPWM_HSTAR1_HSTAGCMF4_POS (26U)
#define HRPWM_HSTAR1_HSTAGCMF4     (0x04000000UL)
#define HRPWM_HSTAR1_HSTAGCMF5_POS (27U)
#define HRPWM_HSTAR1_HSTAGCMF5     (0x08000000UL)
#define HRPWM_HSTAR1_HSTAGCMF6_POS (28U)
#define HRPWM_HSTAR1_HSTAGCMF6     (0x10000000UL)
#define HRPWM_HSTAR1_HSTAGCMF7_POS (29U)
#define HRPWM_HSTAR1_HSTAGCMF7     (0x20000000UL)
#define HRPWM_HSTAR1_HSTAGCMF8_POS (30U)
#define HRPWM_HSTAR1_HSTAGCMF8     (0x40000000UL)

/* Bit definition for HRPWM_HSTAR2 register */
#define HRPWM_HSTAR2_HSTAEXEV1_POS  (0U)
#define HRPWM_HSTAR2_HSTAEXEV1      (0x00000001UL)
#define HRPWM_HSTAR2_HSTAEXEV2_POS  (1U)
#define HRPWM_HSTAR2_HSTAEXEV2      (0x00000002UL)
#define HRPWM_HSTAR2_HSTAEXEV3_POS  (2U)
#define HRPWM_HSTAR2_HSTAEXEV3      (0x00000004UL)
#define HRPWM_HSTAR2_HSTAEXEV4_POS  (3U)
#define HRPWM_HSTAR2_HSTAEXEV4      (0x00000008UL)
#define HRPWM_HSTAR2_HSTAEXEV5_POS  (4U)
#define HRPWM_HSTAR2_HSTAEXEV5      (0x00000010UL)
#define HRPWM_HSTAR2_HSTAEXEV6_POS  (5U)
#define HRPWM_HSTAR2_HSTAEXEV6      (0x00000020UL)
#define HRPWM_HSTAR2_HSTAEXEV7_POS  (6U)
#define HRPWM_HSTAR2_HSTAEXEV7      (0x00000040UL)
#define HRPWM_HSTAR2_HSTAEXEV8_POS  (7U)
#define HRPWM_HSTAR2_HSTAEXEV8      (0x00000080UL)
#define HRPWM_HSTAR2_HSTAEXEV9_POS  (8U)
#define HRPWM_HSTAR2_HSTAEXEV9      (0x00000100UL)
#define HRPWM_HSTAR2_HSTAEXEV10_POS (9U)
#define HRPWM_HSTAR2_HSTAEXEV10     (0x00000200UL)
#define HRPWM_HSTAR2_HSTAGCMA1_POS  (10U)
#define HRPWM_HSTAR2_HSTAGCMA1      (0x00000400UL)
#define HRPWM_HSTAR2_HSTAGCMB1_POS  (11U)
#define HRPWM_HSTAR2_HSTAGCMB1      (0x00000800UL)
#define HRPWM_HSTAR2_HSTAGCMA2_POS  (12U)
#define HRPWM_HSTAR2_HSTAGCMA2      (0x00001000UL)
#define HRPWM_HSTAR2_HSTAGCMB2_POS  (13U)
#define HRPWM_HSTAR2_HSTAGCMB2      (0x00002000UL)
#define HRPWM_HSTAR2_HSTAGCMA3_POS  (14U)
#define HRPWM_HSTAR2_HSTAGCMA3      (0x00004000UL)
#define HRPWM_HSTAR2_HSTAGCMB3_POS  (15U)
#define HRPWM_HSTAR2_HSTAGCMB3      (0x00008000UL)
#define HRPWM_HSTAR2_HSTAGCMA4_POS  (16U)
#define HRPWM_HSTAR2_HSTAGCMA4      (0x00010000UL)
#define HRPWM_HSTAR2_HSTAGCMB4_POS  (17U)
#define HRPWM_HSTAR2_HSTAGCMB4      (0x00020000UL)
#define HRPWM_HSTAR2_HSTAGCMA5_POS  (18U)
#define HRPWM_HSTAR2_HSTAGCMA5      (0x00040000UL)
#define HRPWM_HSTAR2_HSTAGCMB5_POS  (19U)
#define HRPWM_HSTAR2_HSTAGCMB5      (0x00080000UL)
#define HRPWM_HSTAR2_HSTAGCMA6_POS  (20U)
#define HRPWM_HSTAR2_HSTAGCMA6      (0x00100000UL)
#define HRPWM_HSTAR2_HSTAGCMB6_POS  (21U)
#define HRPWM_HSTAR2_HSTAGCMB6      (0x00200000UL)
#define HRPWM_HSTAR2_HSTASCMA1_POS  (22U)
#define HRPWM_HSTAR2_HSTASCMA1      (0x00400000UL)
#define HRPWM_HSTAR2_HSTASCMB2_POS  (23U)
#define HRPWM_HSTAR2_HSTASCMB2      (0x00800000UL)
#define HRPWM_HSTAR2_HSTASCMB3_POS  (24U)
#define HRPWM_HSTAR2_HSTASCMB3      (0x01000000UL)
#define HRPWM_HSTAR2_HSTASCMB4_POS  (25U)
#define HRPWM_HSTAR2_HSTASCMB4      (0x02000000UL)
#define HRPWM_HSTAR2_HSTASCMB5_POS  (26U)
#define HRPWM_HSTAR2_HSTASCMB5      (0x04000000UL)
#define HRPWM_HSTAR2_HSTASCMB6_POS  (27U)
#define HRPWM_HSTAR2_HSTASCMB6      (0x08000000UL)
#define HRPWM_HSTAR2_HSTAGCME1_POS  (28U)
#define HRPWM_HSTAR2_HSTAGCME1      (0x10000000UL)
#define HRPWM_HSTAR2_HSTAGCMF1_POS  (29U)
#define HRPWM_HSTAR2_HSTAGCMF1      (0x20000000UL)
#define HRPWM_HSTAR2_HSTAOVF1_POS   (30U)
#define HRPWM_HSTAR2_HSTAOVF1       (0x40000000UL)
#define HRPWM_HSTAR2_HSTAUDF1_POS   (31U)
#define HRPWM_HSTAR2_HSTAUDF1       (0x80000000UL)

/* Bit definition for HRPWM_HCLRR1 register */
#define HRPWM_HCLRR1_HCLEGCMA7_POS (0U)
#define HRPWM_HCLRR1_HCLEGCMA7     (0x00000001UL)
#define HRPWM_HCLRR1_HCLEGCMB7_POS (1U)
#define HRPWM_HCLRR1_HCLEGCMB7     (0x00000002UL)
#define HRPWM_HCLRR1_HCLEGCMA8_POS (2U)
#define HRPWM_HCLRR1_HCLEGCMA8     (0x00000004UL)
#define HRPWM_HCLRR1_HCLEGCMB8_POS (3U)
#define HRPWM_HCLRR1_HCLEGCMB8     (0x00000008UL)
#define HRPWM_HCLRR1_HCLEGCMA9_POS (4U)
#define HRPWM_HCLRR1_HCLEGCMA9     (0x00000010UL)
#define HRPWM_HCLRR1_HCLEGCMB9_POS (5U)
#define HRPWM_HCLRR1_HCLEGCMB9     (0x00000020UL)
#define HRPWM_HCLRR1_CLES_POS      (7U)
#define HRPWM_HCLRR1_CLES          (0x00000080UL)
#define HRPWM_HCLRR1_HCLE8_POS     (8U)
#define HRPWM_HCLRR1_HCLE8         (0x00000100UL)
#define HRPWM_HCLRR1_HCLE9_POS     (9U)
#define HRPWM_HCLRR1_HCLE9         (0x00000200UL)
#define HRPWM_HCLRR1_HCLE10_POS    (10U)
#define HRPWM_HCLRR1_HCLE10        (0x00000400UL)
#define HRPWM_HCLRR1_HCLE11_POS    (11U)
#define HRPWM_HCLRR1_HCLE11        (0x00000800UL)
#define HRPWM_HCLRR1_HCLESCMB7_POS (12U)
#define HRPWM_HCLRR1_HCLESCMB7     (0x00001000UL)
#define HRPWM_HCLRR1_HCLESCMB8_POS (13U)
#define HRPWM_HCLRR1_HCLESCMB8     (0x00002000UL)
#define HRPWM_HCLRR1_HCLE16_POS    (16U)
#define HRPWM_HCLRR1_HCLE16        (0x00010000UL)
#define HRPWM_HCLRR1_HCLE17_POS    (17U)
#define HRPWM_HCLRR1_HCLE17        (0x00020000UL)
#define HRPWM_HCLRR1_HCLE18_POS    (18U)
#define HRPWM_HCLRR1_HCLE18        (0x00040000UL)
#define HRPWM_HCLRR1_HCLE19_POS    (19U)
#define HRPWM_HCLRR1_HCLE19        (0x00080000UL)
#define HRPWM_HCLRR1_HCLE20_POS    (20U)
#define HRPWM_HCLRR1_HCLE20        (0x00100000UL)
#define HRPWM_HCLRR1_HCLE21_POS    (21U)
#define HRPWM_HCLRR1_HCLE21        (0x00200000UL)
#define HRPWM_HCLRR1_HCLE22_POS    (22U)
#define HRPWM_HCLRR1_HCLE22        (0x00400000UL)
#define HRPWM_HCLRR1_HCLE23_POS    (23U)
#define HRPWM_HCLRR1_HCLE23        (0x00800000UL)
#define HRPWM_HCLRR1_HCLEGCMF2_POS (24U)
#define HRPWM_HCLRR1_HCLEGCMF2     (0x01000000UL)
#define HRPWM_HCLRR1_HCLEGCMF3_POS (25U)
#define HRPWM_HCLRR1_HCLEGCMF3     (0x02000000UL)
#define HRPWM_HCLRR1_HCLEGCMF4_POS (26U)
#define HRPWM_HCLRR1_HCLEGCMF4     (0x04000000UL)
#define HRPWM_HCLRR1_HCLEGCMF5_POS (27U)
#define HRPWM_HCLRR1_HCLEGCMF5     (0x08000000UL)
#define HRPWM_HCLRR1_HCLEGCMF6_POS (28U)
#define HRPWM_HCLRR1_HCLEGCMF6     (0x10000000UL)
#define HRPWM_HCLRR1_HCLEGCMF7_POS (29U)
#define HRPWM_HCLRR1_HCLEGCMF7     (0x20000000UL)
#define HRPWM_HCLRR1_HCLEGCMF8_POS (30U)
#define HRPWM_HCLRR1_HCLEGCMF8     (0x40000000UL)

