MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_HCLRR2 register */
#define HRPWM_HCLRR2_HCLEEXEV1_POS  (0U)
#define HRPWM_HCLRR2_HCLEEXEV1      (0x00000001UL)
#define HRPWM_HCLRR2_HCLEEXEV2_POS  (1U)
#define HRPWM_HCLRR2_HCLEEXEV2      (0x00000002UL)
#define HRPWM_HCLRR2_HCLEEXEV3_POS  (2U)
#define HRPWM_HCLRR2_HCLEEXEV3      (0x00000004UL)
#define HRPWM_HCLRR2_HCLEEXEV4_POS  (3U)
#define HRPWM_HCLRR2_HCLEEXEV4      (0x00000008UL)
#define HRPWM_HCLRR2_HCLEEXEV5_POS  (4U)
#define HRPWM_HCLRR2_HCLEEXEV5      (0x00000010UL)
#define HRPWM_HCLRR2_HCLEEXEV6_POS  (5U)
#define HRPWM_HCLRR2_HCLEEXEV6      (0x00000020UL)
#define HRPWM_HCLRR2_HCLEEXEV7_POS  (6U)
#define HRPWM_HCLRR2_HCLEEXEV7      (0x00000040UL)
#define HRPWM_HCLRR2_HCLEEXEV8_POS  (7U)
#define HRPWM_HCLRR2_HCLEEXEV8      (0x00000080UL)
#define HRPWM_HCLRR2_HCLEEXEV9_POS  (8U)
#define HRPWM_HCLRR2_HCLEEXEV9      (0x00000100UL)
#define HRPWM_HCLRR2_HCLEEXEV10_POS (9U)
#define HRPWM_HCLRR2_HCLEEXEV10     (0x00000200UL)
#define HRPWM_HCLRR2_HCLEGCMA1_POS  (10U)
#define HRPWM_HCLRR2_HCLEGCMA1      (0x00000400UL)
#define HRPWM_HCLRR2_HCLEGCMB1_POS  (11U)
#define HRPWM_HCLRR2_HCLEGCMB1      (0x00000800UL)
#define HRPWM_HCLRR2_HCLEGCMA2_POS  (12U)
#define HRPWM_HCLRR2_HCLEGCMA2      (0x00001000UL)
#define HRPWM_HCLRR2_HCLEGCMB2_POS  (13U)
#define HRPWM_HCLRR2_HCLEGCMB2      (0x00002000UL)
#define HRPWM_HCLRR2_HCLEGCMA3_POS  (14U)
#define HRPWM_HCLRR2_HCLEGCMA3      (0x00004000UL)
#define HRPWM_HCLRR2_HCLEGCMB3_POS  (15U)
#define HRPWM_HCLRR2_HCLEGCMB3      (0x00008000UL)
#define HRPWM_HCLRR2_HCLEGCMA4_POS  (16U)
#define HRPWM_HCLRR2_HCLEGCMA4      (0x00010000UL)
#define HRPWM_HCLRR2_HCLEGCMB4_POS  (17U)
#define HRPWM_HCLRR2_HCLEGCMB4      (0x00020000UL)
#define HRPWM_HCLRR2_HCLEGCMA5_POS  (18U)
#define HRPWM_HCLRR2_HCLEGCMA5      (0x00040000UL)
#define HRPWM_HCLRR2_HCLEGCMB5_POS  (19U)
#define HRPWM_HCLRR2_HCLEGCMB5      (0x00080000UL)
#define HRPWM_HCLRR2_HCLEGCMA6_POS  (20U)
#define HRPWM_HCLRR2_HCLEGCMA6      (0x00100000UL)
#define HRPWM_HCLRR2_HCLEGCMB6_POS  (21U)
#define HRPWM_HCLRR2_HCLEGCMB6      (0x00200000UL)
#define HRPWM_HCLRR2_HCLESCMB1_POS  (22U)
#define HRPWM_HCLRR2_HCLESCMB1      (0x00400000UL)
#define HRPWM_HCLRR2_HCLESCMB2_POS  (23U)
#define HRPWM_HCLRR2_HCLESCMB2      (0x00800000UL)
#define HRPWM_HCLRR2_HCLESCMB3_POS  (24U)
#define HRPWM_HCLRR2_HCLESCMB3      (0x01000000UL)
#define HRPWM_HCLRR2_HCLESCMB4_POS  (25U)
#define HRPWM_HCLRR2_HCLESCMB4      (0x02000000UL)
#define HRPWM_HCLRR2_HCLESCMB5_POS  (26U)
#define HRPWM_HCLRR2_HCLESCMB5      (0x04000000UL)
#define HRPWM_HCLRR2_HCLESCMB6_POS  (27U)
#define HRPWM_HCLRR2_HCLESCMB6      (0x08000000UL)
#define HRPWM_HCLRR2_HCLEGCME1_POS  (28U)
#define HRPWM_HCLRR2_HCLEGCME1      (0x10000000UL)
#define HRPWM_HCLRR2_HCLEGCMF1_POS  (29U)
#define HRPWM_HCLRR2_HCLEGCMF1      (0x20000000UL)
#define HRPWM_HCLRR2_HCLEOVF1_POS   (30U)
#define HRPWM_HCLRR2_HCLEOVF1       (0x40000000UL)
#define HRPWM_HCLRR2_HCLEUDF1_POS   (31U)
#define HRPWM_HCLRR2_HCLEUDF1       (0x80000000UL)

/* Bit definition for HRPWM_HCPAR1 register */
#define HRPWM_HCPAR1_HCPAGCMA6_POS (0U)
#define HRPWM_HCPAR1_HCPAGCMA6     (0x00000001UL)
#define HRPWM_HCPAR1_HCPAGCMB6_POS (1U)
#define HRPWM_HCPAR1_HCPAGCMB6     (0x00000002UL)
#define HRPWM_HCPAR1_HCPAR6_POS    (2U)
#define HRPWM_HCPAR1_HCPAR6        (0x00000004UL)
#define HRPWM_HCPAR1_HCPAF6_POS    (3U)
#define HRPWM_HCPAR1_HCPAF6        (0x00000008UL)
#define HRPWM_HCPAR1_HCPAGCMA7_POS (4U)
#define HRPWM_HCPAR1_HCPAGCMA7     (0x00000010UL)
#define HRPWM_HCPAR1_HCPAGCMB7_POS (5U)
#define HRPWM_HCPAR1_HCPAGCMB7     (0x00000020UL)
#define HRPWM_HCPAR1_HCPAR7_POS    (6U)
#define HRPWM_HCPAR1_HCPAR7        (0x00000040UL)
#define HRPWM_HCPAR1_HCPAF7_POS    (7U)
#define HRPWM_HCPAR1_HCPAF7        (0x00000080UL)
#define HRPWM_HCPAR1_HCPA8_POS     (8U)
#define HRPWM_HCPAR1_HCPA8         (0x00000100UL)
#define HRPWM_HCPAR1_HCPA9_POS     (9U)
#define HRPWM_HCPAR1_HCPA9         (0x00000200UL)
#define HRPWM_HCPAR1_HCPA10_POS    (10U)
#define HRPWM_HCPAR1_HCPA10        (0x00000400UL)
#define HRPWM_HCPAR1_HCPA11_POS    (11U)
#define HRPWM_HCPAR1_HCPA11        (0x00000800UL)
#define HRPWM_HCPAR1_HCPA16_POS    (16U)
#define HRPWM_HCPAR1_HCPA16        (0x00010000UL)
#define HRPWM_HCPAR1_HCPA17_POS    (17U)
#define HRPWM_HCPAR1_HCPA17        (0x00020000UL)
#define HRPWM_HCPAR1_HCPA18_POS    (18U)
#define HRPWM_HCPAR1_HCPA18        (0x00040000UL)
#define HRPWM_HCPAR1_HCPA19_POS    (19U)
#define HRPWM_HCPAR1_HCPA19        (0x00080000UL)
#define HRPWM_HCPAR1_HCPA20_POS    (20U)
#define HRPWM_HCPAR1_HCPA20        (0x00100000UL)
#define HRPWM_HCPAR1_HCPA21_POS    (21U)
#define HRPWM_HCPAR1_HCPA21        (0x00200000UL)
#define HRPWM_HCPAR1_HCPA22_POS    (22U)
#define HRPWM_HCPAR1_HCPA22        (0x00400000UL)
#define HRPWM_HCPAR1_HCPA23_POS    (23U)
#define HRPWM_HCPAR1_HCPA23        (0x00800000UL)
#define HRPWM_HCPAR1_HCPAGCMA8_POS (24U)
#define HRPWM_HCPAR1_HCPAGCMA8     (0x01000000UL)
#define HRPWM_HCPAR1_HCPAGCMB8_POS (25U)
#define HRPWM_HCPAR1_HCPAGCMB8     (0x02000000UL)
#define HRPWM_HCPAR1_HCPAR8_POS    (26U)
#define HRPWM_HCPAR1_HCPAR8        (0x04000000UL)
#define HRPWM_HCPAR1_HCPAF8_POS    (27U)
#define HRPWM_HCPAR1_HCPAF8        (0x08000000UL)

/* Bit definition for HRPWM_HCPAR2 register */
#define HRPWM_HCPAR2_HCPAEEV1_POS  (0U)
#define HRPWM_HCPAR2_HCPAEEV1      (0x00000001UL)
#define HRPWM_HCPAR2_HCPAEEV2_POS  (1U)
#define HRPWM_HCPAR2_HCPAEEV2      (0x00000002UL)
#define HRPWM_HCPAR2_HCPAEEV3_POS  (2U)
#define HRPWM_HCPAR2_HCPAEEV3      (0x00000004UL)
#define HRPWM_HCPAR2_HCPAEEV4_POS  (3U)
#define HRPWM_HCPAR2_HCPAEEV4      (0x00000008UL)
#define HRPWM_HCPAR2_HCPAEEV5_POS  (4U)
#define HRPWM_HCPAR2_HCPAEEV5      (0x00000010UL)
#define HRPWM_HCPAR2_HCPAEEV6_POS  (5U)
#define HRPWM_HCPAR2_HCPAEEV6      (0x00000020UL)
#define HRPWM_HCPAR2_HCPAEEV7_POS  (6U)
#define HRPWM_HCPAR2_HCPAEEV7      (0x00000040UL)
#define HRPWM_HCPAR2_HCPAEEV8_POS  (7U)
#define HRPWM_HCPAR2_HCPAEEV8      (0x00000080UL)
#define HRPWM_HCPAR2_HCPAEEV9_POS  (8U)
#define HRPWM_HCPAR2_HCPAEEV9      (0x00000100UL)
#define HRPWM_HCPAR2_HCPAEEV10_POS (9U)
#define HRPWM_HCPAR2_HCPAEEV10     (0x00000200UL)
#define HRPWM_HCPAR2_HCPAEN_POS    (10U)
#define HRPWM_HCPAR2_HCPAEN        (0x00000400UL)
#define HRPWM_HCPAR2_HCPAGCMA1_POS (12U)
#define HRPWM_HCPAR2_HCPAGCMA1     (0x00001000UL)
#define HRPWM_HCPAR2_HCPAGCMB1_POS (13U)
#define HRPWM_HCPAR2_HCPAGCMB1     (0x00002000UL)
#define HRPWM_HCPAR2_HCPAR1_POS    (14U)
#define HRPWM_HCPAR2_HCPAR1        (0x00004000UL)
#define HRPWM_HCPAR2_HCPAF1_POS    (15U)
#define HRPWM_HCPAR2_HCPAF1        (0x00008000UL)
#define HRPWM_HCPAR2_HCPAGCMA2_POS (16U)
#define HRPWM_HCPAR2_HCPAGCMA2     (0x00010000UL)
#define HRPWM_HCPAR2_HCPAGCMB2_POS (17U)
#define HRPWM_HCPAR2_HCPAGCMB2     (0x00020000UL)
#define HRPWM_HCPAR2_HCPAR2_POS    (18U)
#define HRPWM_HCPAR2_HCPAR2        (0x00040000UL)
#define HRPWM_HCPAR2_HCPAF2_POS    (19U)
#define HRPWM_HCPAR2_HCPAF2        (0x00080000UL)
#define HRPWM_HCPAR2_HCPAGCMA3_POS (20U)
#define HRPWM_HCPAR2_HCPAGCMA3     (0x00100000UL)
#define HRPWM_HCPAR2_HCPAGCMB3_POS (21U)
#define HRPWM_HCPAR2_HCPAGCMB3     (0x00200000UL)
#define HRPWM_HCPAR2_HCPAR3_POS    (22U)
#define HRPWM_HCPAR2_HCPAR3        (0x00400000UL)
#define HRPWM_HCPAR2_HCPAF3_POS    (23U)
#define HRPWM_HCPAR2_HCPAF3        (0x00800000UL)
#define HRPWM_HCPAR2_HCPAGCMA4_POS (24U)
#define HRPWM_HCPAR2_HCPAGCMA4     (0x01000000UL)
#define HRPWM_HCPAR2_HCPAGCMB4_POS (25U)
#define HRPWM_HCPAR2_HCPAGCMB4     (0x02000000UL)
#define HRPWM_HCPAR2_HCPAR4_POS    (26U)
#define HRPWM_HCPAR2_HCPAR4        (0x04000000UL)
#define HRPWM_HCPAR2_HCPAF4_POS    (27U)
#define HRPWM_HCPAR2_HCPAF4        (0x08000000UL)
#define HRPWM_HCPAR2_HCPAGCMA5_POS (28U)
#define HRPWM_HCPAR2_HCPAGCMA5     (0x10000000UL)
#define HRPWM_HCPAR2_HCPAGCMB5_POS (29U)
#define HRPWM_HCPAR2_HCPAGCMB5     (0x20000000UL)
#define HRPWM_HCPAR2_HCPAR5_POS    (30U)
#define HRPWM_HCPAR2_HCPAR5        (0x40000000UL)
#define HRPWM_HCPAR2_HCPAF5_POS    (31U)
#define HRPWM_HCPAR2_HCPAF5        (0x80000000UL)

/* Bit definition for HRPWM_HCPBR1 register */
#define HRPWM_HCPBR1_HCPBGCMA6_POS (0U)
#define HRPWM_HCPBR1_HCPBGCMA6     (0x00000001UL)
#define HRPWM_HCPBR1_HCPBGCMB6_POS (1U)
#define HRPWM_HCPBR1_HCPBGCMB6     (0x00000002UL)
#define HRPWM_HCPBR1_HCPBR6_POS    (2U)
#define HRPWM_HCPBR1_HCPBR6        (0x00000004UL)
#define HRPWM_HCPBR1_HCPBF6_POS    (3U)
#define HRPWM_HCPBR1_HCPBF6        (0x00000008UL)
#define HRPWM_HCPBR1_HCPBGCMA7_POS (4U)
#define HRPWM_HCPBR1_HCPBGCMA7     (0x00000010UL)
#define HRPWM_HCPBR1_HCPBGCMB7_POS (5U)
#define HRPWM_HCPBR1_HCPBGCMB7     (0x00000020UL)
#define HRPWM_HCPBR1_HCPBR7_POS    (6U)
#define HRPWM_HCPBR1_HCPBR7        (0x00000040UL)
#define HRPWM_HCPBR1_HCPBF7_POS    (7U)
#define HRPWM_HCPBR1_HCPBF7        (0x00000080UL)
#define HRPWM_HCPBR1_HCPB8_POS     (8U)
#define HRPWM_HCPBR1_HCPB8         (0x00000100UL)
#define HRPWM_HCPBR1_HCPB9_POS     (9U)
#define HRPWM_HCPBR1_HCPB9         (0x00000200UL)
#define HRPWM_HCPBR1_HCPB10_POS    (10U)
#define HRPWM_HCPBR1_HCPB10        (0x00000400UL)
#define HRPWM_HCPBR1_HCPB11_POS    (11U)
#define HRPWM_HCPBR1_HCPB11        (0x00000800UL)
#define HRPWM_HCPBR1_HCPB16_POS    (16U)
#define HRPWM_HCPBR1_HCPB16        (0x00010000UL)
#define HRPWM_HCPBR1_HCPB17_POS    (17U)
#define HRPWM_HCPBR1_HCPB17        (0x00020000UL)
#define HRPWM_HCPBR1_HCPB18_POS    (18U)
#define HRPWM_HCPBR1_HCPB18        (0x00040000UL)
#define HRPWM_HCPBR1_HCPB19_POS    (19U)
#define HRPWM_HCPBR1_HCPB19        (0x00080000UL)
#define HRPWM_HCPBR1_HCPB20_POS    (20U)
#define HRPWM_HCPBR1_HCPB20        (0x00100000UL)
#define HRPWM_HCPBR1_HCPB21_POS    (21U)
#define HRPWM_HCPBR1_HCPB21        (0x00200000UL)
#define HRPWM_HCPBR1_HCPB22_POS    (22U)
#define HRPWM_HCPBR1_HCPB22        (0x00400000UL)
#define HRPWM_HCPBR1_HCPB23_POS    (23U)
#define HRPWM_HCPBR1_HCPB23        (0x00800000UL)
#define HRPWM_HCPBR1_HCPBGCMA8_POS (24U)
#define HRPWM_HCPBR1_HCPBGCMA8     (0x01000000UL)
#define HRPWM_HCPBR1_HCPBGCMB8_POS (25U)
#define HRPWM_HCPBR1_HCPBGCMB8     (0x02000000UL)
#define HRPWM_HCPBR1_HCPBR8_POS    (26U)
#define HRPWM_HCPBR1_HCPBR8        (0x04000000UL)
#define HRPWM_HCPBR1_HCPBF8_POS    (27U)
#define HRPWM_HCPBR1_HCPBF8        (0x08000000UL)

/* Bit definition for HRPWM_HCPBR2 register */
#define HRPWM_HCPBR2_HCPBEEV1_POS  (0U)
#define HRPWM_HCPBR2_HCPBEEV1      (0x00000001UL)
#define HRPWM_HCPBR2_HCPBEEV2_POS  (1U)
#define HRPWM_HCPBR2_HCPBEEV2      (0x00000002UL)
#define HRPWM_HCPBR2_HCPBEEV3_POS  (2U)
#define HRPWM_HCPBR2_HCPBEEV3      (0x00000004UL)
#define HRPWM_HCPBR2_HCPBEEV4_POS  (3U)
#define HRPWM_HCPBR2_HCPBEEV4      (0x00000008UL)
#define HRPWM_HCPBR2_HCPBEEV5_POS  (4U)
#define HRPWM_HCPBR2_HCPBEEV5      (0x00000010UL)
#define HRPWM_HCPBR2_HCPBEEV6_POS  (5U)
#define HRPWM_HCPBR2_HCPBEEV6      (0x00000020UL)
#define HRPWM_HCPBR2_HCPBEEV7_POS  (6U)
#define HRPWM_HCPBR2_HCPBEEV7      (0x00000040UL)
#define HRPWM_HCPBR2_HCPBEEV8_POS  (7U)
#define HRPWM_HCPBR2_HCPBEEV8      (0x00000080UL)
#define HRPWM_HCPBR2_HCPBEEV9_POS  (8U)
#define HRPWM_HCPBR2_HCPBEEV9      (0x00000100UL)
#define HRPWM_HCPBR2_HCPBEEV10_POS (9U)
#define HRPWM_HCPBR2_HCPBEEV10     (0x00000200UL)
#define HRPWM_HCPBR2_HCPBEN_POS    (10U)
#define HRPWM_HCPBR2_HCPBEN        (0x00000400UL)
#define HRPWM_HCPBR2_HCPBGCMA1_POS (12U)
#define HRPWM_HCPBR2_HCPBGCMA1     (0x00001000UL)
#define HRPWM_HCPBR2_HCPBGCMB1_POS (13U)
#define HRPWM_HCPBR2_HCPBGCMB1     (0x00002000UL)
#define HRPWM_HCPBR2_HCPBR1_POS    (14U)
#define HRPWM_HCPBR2_HCPBR1        (0x00004000UL)
#define HRPWM_HCPBR2_HCPBF1_POS    (15U)
#define HRPWM_HCPBR2_HCPBF1        (0x00008000UL)
#define HRPWM_HCPBR2_HCPBGCMA2_POS (16U)
#define HRPWM_HCPBR2_HCPBGCMA2     (0x00010000UL)
#define HRPWM_HCPBR2_HCPBGCMB2_POS (17U)
#define HRPWM_HCPBR2_HCPBGCMB2     (0x00020000UL)
#define HRPWM_HCPBR2_HCPBR2_POS    (18U)
#define HRPWM_HCPBR2_HCPBR2        (0x00040000UL)
#define HRPWM_HCPBR2_HCPBF2_POS    (19U)
#define HRPWM_HCPBR2_HCPBF2        (0x00080000UL)
#define HRPWM_HCPBR2_HCPBGCMA3_POS (20U)
#define HRPWM_HCPBR2_HCPBGCMA3     (0x00100000UL)
#define HRPWM_HCPBR2_HCPBGCMB3_POS (21U)
#define HRPWM_HCPBR2_HCPBGCMB3     (0x00200000UL)
#define HRPWM_HCPBR2_HCPBR3_POS    (22U)
#define HRPWM_HCPBR2_HCPBR3        (0x00400000UL)
#define HRPWM_HCPBR2_HCPBF3_POS    (23U)
#define HRPWM_HCPBR2_HCPBF3        (0x00800000UL)
#define HRPWM_HCPBR2_HCPBGCMA4_POS (24U)
#define HRPWM_HCPBR2_HCPBGCMA4     (0x01000000UL)
#define HRPWM_HCPBR2_HCPBGCMB4_POS (25U)
#define HRPWM_HCPBR2_HCPBGCMB4     (0x02000000UL)
#define HRPWM_HCPBR2_HCPBR4_POS    (26U)
#define HRPWM_HCPBR2_HCPBR4        (0x04000000UL)
#define HRPWM_HCPBR2_HCPBF4_POS    (27U)
#define HRPWM_HCPBR2_HCPBF4        (0x08000000UL)
#define HRPWM_HCPBR2_HCPBGCMA5_POS (28U)
#define HRPWM_HCPBR2_HCPBGCMA5     (0x10000000UL)
#define HRPWM_HCPBR2_HCPBGCMB5_POS (29U)
#define HRPWM_HCPBR2_HCPBGCMB5     (0x20000000UL)
#define HRPWM_HCPBR2_HCPBR5_POS    (30U)
#define HRPWM_HCPBR2_HCPBR5        (0x40000000UL)
#define HRPWM_HCPBR2_HCPBF5_POS    (31U)
#define HRPWM_HCPBR2_HCPBF5        (0x80000000UL)

/* Bit definition for HRPWM_EEFLTCR1 register */
#define HRPWM_EEFLTCR1_EE1LAT_POS   (0U)
#define HRPWM_EEFLTCR1_EE1LAT       (0x00000001UL)
#define HRPWM_EEFLTCR1_EE1FM_POS    (1U)
#define HRPWM_EEFLTCR1_EE1FM        (0x0000001EUL)
#define HRPWM_EEFLTCR1_EE1TMO_POS   (5U)
#define HRPWM_EEFLTCR1_EE1TMO       (0x00000020UL)
#define HRPWM_EEFLTCR1_EE2LAT_POS   (6U)
#define HRPWM_EEFLTCR1_EE2LAT       (0x00000040UL)
#define HRPWM_EEFLTCR1_EE2FM_POS    (7U)
#define HRPWM_EEFLTCR1_EE2FM        (0x00000780UL)
#define HRPWM_EEFLTCR1_EE2TMO_POS   (11U)
#define HRPWM_EEFLTCR1_EE2TMO       (0x00000800UL)
#define HRPWM_EEFLTCR1_EE3LAT_POS   (12U)
#define HRPWM_EEFLTCR1_EE3LAT       (0x00001000UL)
#define HRPWM_EEFLTCR1_EE3FM_POS    (13U)
#define HRPWM_EEFLTCR1_EE3FM        (0x0001E000UL)
#define HRPWM_EEFLTCR1_EE3TMO_POS   (17U)
#define HRPWM_EEFLTCR1_EE3TMO       (0x00020000UL)
#define HRPWM_EEFLTCR1_EE4LAT_POS   (18U)
#define HRPWM_EEFLTCR1_EE4LAT       (0x00040000UL)
#define HRPWM_EEFLTCR1_EE4FM_POS    (19U)
#define HRPWM_EEFLTCR1_EE4FM        (0x00780000UL)
#define HRPWM_EEFLTCR1_EE4TMO_POS   (23U)
#define HRPWM_EEFLTCR1_EE4TMO       (0x00800000UL)
#define HRPWM_EEFLTCR1_EE5LAT_POS   (24U)
#define HRPWM_EEFLTCR1_EE5LAT       (0x01000000UL)
#define HRPWM_EEFLTCR1_EE5FM_POS    (25U)
#define HRPWM_EEFLTCR1_EE5FM        (0x1E000000UL)
#define HRPWM_EEFLTCR1_EE5TMO_POS   (29U)
#define HRPWM_EEFLTCR1_EE5TMO       (0x20000000UL)
#define HRPWM_EEFLTCR1_EEINTPOL_POS (30U)
#define HRPWM_EEFLTCR1_EEINTPOL     (0x40000000UL)

/* Bit definition for HRPWM_EEFLTCR2 register */
#define HRPWM_EEFLTCR2_EE6LAT_POS  (0U)
#define HRPWM_EEFLTCR2_EE6LAT      (0x00000001UL)
#define HRPWM_EEFLTCR2_EE6FM_POS   (1U)
#define HRPWM_EEFLTCR2_EE6FM       (0x0000001EUL)
#define HRPWM_EEFLTCR2_EE6TMO_POS  (5U)
#define HRPWM_EEFLTCR2_EE6TMO      (0x00000020UL)
#define HRPWM_EEFLTCR2_EE7LAT_POS  (6U)
#define HRPWM_EEFLTCR2_EE7LAT      (0x00000040UL)
#define HRPWM_EEFLTCR2_EE7FM_POS   (7U)
#define HRPWM_EEFLTCR2_EE7FM       (0x00000780UL)
#define HRPWM_EEFLTCR2_EE7TMO_POS  (11U)
#define HRPWM_EEFLTCR2_EE7TMO      (0x00000800UL)
#define HRPWM_EEFLTCR2_EE8LAT_POS  (12U)
#define HRPWM_EEFLTCR2_EE8LAT      (0x00001000UL)
#define HRPWM_EEFLTCR2_EE8FM_POS   (13U)
#define HRPWM_EEFLTCR2_EE8FM       (0x0001E000UL)
#define HRPWM_EEFLTCR2_EE8TMO_POS  (17U)
#define HRPWM_EEFLTCR2_EE8TMO      (0x00020000UL)
#define HRPWM_EEFLTCR2_EE9LAT_POS  (18U)
#define HRPWM_EEFLTCR2_EE9LAT      (0x00040000UL)
#define HRPWM_EEFLTCR2_EE9FM_POS   (19U)
#define HRPWM_EEFLTCR2_EE9FM       (0x00780000UL)
#define HRPWM_EEFLTCR2_EE9TMO_POS  (23U)
#define HRPWM_EEFLTCR2_EE9TMO      (0x00800000UL)
#define HRPWM_EEFLTCR2_EE10LAT_POS (24U)
#define HRPWM_EEFLTCR2_EE10LAT     (0x01000000UL)
#define HRPWM_EEFLTCR2_EE10FM_POS  (25U)
#define HRPWM_EEFLTCR2_EE10FM      (0x1E000000UL)
#define HRPWM_EEFLTCR2_EE10TMO_POS (29U)
#define HRPWM_EEFLTCR2_EE10TMO     (0x20000000UL)

/* Bit definition for HRPWM_EEFLTCR3 register */
#define HRPWM_EEFLTCR3_EEVACE_POS   (0U)
#define HRPWM_EEFLTCR3_EEVACE       (0x00000001UL)
#define HRPWM_EEFLTCR3_EEVACRES_POS (1U)
#define HRPWM_EEFLTCR3_EEVACRES     (0x00000002UL)
#define HRPWM_EEFLTCR3_EEVARSTM_POS (2U)
#define HRPWM_EEFLTCR3_EEVARSTM     (0x00000004UL)
#define HRPWM_EEFLTCR3_EEVASEL_POS  (4U)
#define HRPWM_EEFLTCR3_EEVASEL      (0x000000F0UL)
#define HRPWM_EEFLTCR3_EEVACNT_POS  (8U)
#define HRPWM_EEFLTCR3_EEVACNT      (0x00003F00UL)

/* Bit definition for HRPWM_LINKCR1 register */
#define HRPWM_LINKCR1_PRDLINK_POS    (0U)
#define HRPWM_LINKCR1_PRDLINK        (0x0000000FUL)
#define HRPWM_LINKCR1_GCMALINK_POS   (4U)
#define HRPWM_LINKCR1_GCMALINK       (0x000000F0UL)
#define HRPWM_LINKCR1_GCMBLINK_POS   (8U)
#define HRPWM_LINKCR1_GCMBLINK       (0x00000F00UL)
#define HRPWM_LINKCR1_GCMELINK_POS   (12U)
#define HRPWM_LINKCR1_GCMELINK       (0x0000F000UL)
#define HRPWM_LINKCR1_GCMFLINK_POS   (16U)
#define HRPWM_LINKCR1_GCMFLINK       (0x000F0000UL)
#define HRPWM_LINKCR1_SCMALINK_POS   (20U)
#define HRPWM_LINKCR1_SCMALINK       (0x00F00000UL)
#define HRPWM_LINKCR1_SCMBLINK_POS   (24U)
#define HRPWM_LINKCR1_SCMBLINK       (0x0F000000UL)
#define HRPWM_LINKCR1_OFFWINLINK_POS (28U)
#define HRPWM_LINKCR1_OFFWINLINK     (0xF0000000UL)

/* Bit definition for HRPWM_CR register */
#define HRPWM_CR_EN_POS       (3U)
#define HRPWM_CR_EN           (0x00000008UL)
#define HRPWM_CR_DACSYNC1_POS (4U)
#define HRPWM_CR_DACSYNC1     (0x00000030UL)
#define HRPWM_CR_DACSYNC1_0   (0x00000010UL)
#define HRPWM_CR_DACSYNC1_1   (0x00000020UL)
#define HRPWM_CR_DACSYNC2_POS (8U)
#define HRPWM_CR_DACSYNC2     (0x00000300UL)
#define HRPWM_CR_DACSYNC2_0   (0x00000100UL)
#define HRPWM_CR_DACSYNC2_1   (0x00000200UL)
#define HRPWM_CR_DACSRC_POS   (12U)
#define HRPWM_CR_DACSRC       (0x00007000UL)
#define HRPWM_CR_RAMPEN_POS   (16U)
#define HRPWM_CR_RAMPEN       (0x00010000UL)
#define HRPWM_CR_RAMPRS_POS   (17U)
#define HRPWM_CR_RAMPRS       (0x00060000UL)
#define HRPWM_CR_RAMPRS_0     (0x00020000UL)
#define HRPWM_CR_RAMPRS_1     (0x00040000UL)
#define HRPWM_CR_RAMPSS_POS   (19U)
#define HRPWM_CR_RAMPSS       (0x00080000UL)
#define HRPWM_CR_INTLVD_POS   (20U)
#define HRPWM_CR_INTLVD       (0x00300000UL)
#define HRPWM_CR_INTLVD_0     (0x00100000UL)
#define HRPWM_CR_INTLVD_1     (0x00200000UL)
#define HRPWM_CR_PSHPLL_POS   (22U)
#define HRPWM_CR_PSHPLL       (0x00400000UL)
#define HRPWM_CR_TRGHLF_POS   (23U)
#define HRPWM_CR_TRGHLF       (0x00800000UL)
#define HRPWM_CR_GTGCMF_POS   (24U)
#define HRPWM_CR_GTGCMF       (0x01000000UL)
#define HRPWM_CR_GTGCMB_POS   (25U)
#define HRPWM_CR_GTGCMB       (0x02000000UL)
#define HRPWM_CR_DELGCMA_POS  (26U)
#define HRPWM_CR_DELGCMA      (0x0C000000UL)
#define HRPWM_CR_DELGCMA_0    (0x04000000UL)
#define HRPWM_CR_DELGCMA_1    (0x08000000UL)
#define HRPWM_CR_DELGCME_POS  (28U)
#define HRPWM_CR_DELGCME      (0x30000000UL)
#define HRPWM_CR_DELGCME_0    (0x10000000UL)
#define HRPWM_CR_DELGCME_1    (0x20000000UL)

/* Bit definition for HRPWM_PHSCTL register */
#define HRPWM_PHSCTL_PHSEN_POS    (0U)
#define HRPWM_PHSCTL_PHSEN        (0x00000001UL)
#define HRPWM_PHSCTL_PHCMPSEL_POS (1U)
#define HRPWM_PHSCTL_PHCMPSEL     (0x0000000EUL)
#define HRPWM_PHSCTL_PHSFORCA_POS (6U)
#define HRPWM_PHSCTL_PHSFORCA     (0x00000040UL)
#define HRPWM_PHSCTL_PHSFORCB_POS (7U)
#define HRPWM_PHSCTL_PHSFORCB     (0x00000080UL)
#define HRPWM_PHSCTL_BENPHS_POS   (8U)
#define HRPWM_PHSCTL_BENPHS       (0x00000100UL)
#define HRPWM_PHSCTL_BTRUPHS_POS  (9U)
#define HRPWM_PHSCTL_BTRUPHS      (0x00000200UL)
#define HRPWM_PHSCTL_BTRDPHS_POS  (10U)
#define HRPWM_PHSCTL_BTRDPHS      (0x00000400UL)
#define HRPWM_PHSCTL_MINTLVD_POS  (12U)
#define HRPWM_PHSCTL_MINTLVD      (0x0000F000UL)

