MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_LINKCR2 register */
#define HRPWM_LINKCR2_DTULINK_POS (0U)
#define HRPWM_LINKCR2_DTULINK     (0x0000000FUL)
#define HRPWM_LINKCR2_DTDLINK_POS (4U)
#define HRPWM_LINKCR2_DTDLINK     (0x000000F0UL)

/* Bit definition for HRPWM_TRGCALDATR register */
#define HRPWM_TRGCALDATR_TRGCALDAT (0x0001FFFFUL)

/* Bit definition for HRPWM_UDIRCFG register */
#define HRPWM_UDIRCFG_EEV1_POS  (0U)
#define HRPWM_UDIRCFG_EEV1      (0x00000001UL)
#define HRPWM_UDIRCFG_EEV2_POS  (1U)
#define HRPWM_UDIRCFG_EEV2      (0x00000002UL)
#define HRPWM_UDIRCFG_EEV3_POS  (2U)
#define HRPWM_UDIRCFG_EEV3      (0x00000004UL)
#define HRPWM_UDIRCFG_EEV4_POS  (3U)
#define HRPWM_UDIRCFG_EEV4      (0x00000008UL)
#define HRPWM_UDIRCFG_EEV5_POS  (4U)
#define HRPWM_UDIRCFG_EEV5      (0x00000010UL)
#define HRPWM_UDIRCFG_EEV6_POS  (5U)
#define HRPWM_UDIRCFG_EEV6      (0x00000020UL)
#define HRPWM_UDIRCFG_EEV7_POS  (6U)
#define HRPWM_UDIRCFG_EEV7      (0x00000040UL)
#define HRPWM_UDIRCFG_EEV8_POS  (7U)
#define HRPWM_UDIRCFG_EEV8      (0x00000080UL)
#define HRPWM_UDIRCFG_EEV9_POS  (8U)
#define HRPWM_UDIRCFG_EEV9      (0x00000100UL)
#define HRPWM_UDIRCFG_EEV10_POS (9U)
#define HRPWM_UDIRCFG_EEV10     (0x00000200UL)

/* Bit definition for HRPWM_DDIRCFG register */
#define HRPWM_DDIRCFG_EEV1_POS  (0U)
#define HRPWM_DDIRCFG_EEV1      (0x00000001UL)
#define HRPWM_DDIRCFG_EEV2_POS  (1U)
#define HRPWM_DDIRCFG_EEV2      (0x00000002UL)
#define HRPWM_DDIRCFG_EEV3_POS  (2U)
#define HRPWM_DDIRCFG_EEV3      (0x00000004UL)
#define HRPWM_DDIRCFG_EEV4_POS  (3U)
#define HRPWM_DDIRCFG_EEV4      (0x00000008UL)
#define HRPWM_DDIRCFG_EEV5_POS  (4U)
#define HRPWM_DDIRCFG_EEV5      (0x00000010UL)
#define HRPWM_DDIRCFG_EEV6_POS  (5U)
#define HRPWM_DDIRCFG_EEV6      (0x00000020UL)
#define HRPWM_DDIRCFG_EEV7_POS  (6U)
#define HRPWM_DDIRCFG_EEV7      (0x00000040UL)
#define HRPWM_DDIRCFG_EEV8_POS  (7U)
#define HRPWM_DDIRCFG_EEV8      (0x00000080UL)
#define HRPWM_DDIRCFG_EEV9_POS  (8U)
#define HRPWM_DDIRCFG_EEV9      (0x00000100UL)
#define HRPWM_DDIRCFG_EEV10_POS (9U)
#define HRPWM_DDIRCFG_EEV10     (0x00000200UL)

/* Bit definition for HRPWM_TRIPOUTSEL register */
#define HRPWM_TRIPOUTSEL_EMBEVT0_POS (0U)
#define HRPWM_TRIPOUTSEL_EMBEVT0     (0x00000001UL)
#define HRPWM_TRIPOUTSEL_EMBEVT1_POS (1U)
#define HRPWM_TRIPOUTSEL_EMBEVT1     (0x00000002UL)
#define HRPWM_TRIPOUTSEL_EMBEVT2_POS (2U)
#define HRPWM_TRIPOUTSEL_EMBEVT2     (0x00000004UL)
#define HRPWM_TRIPOUTSEL_EMBEVT3_POS (3U)
#define HRPWM_TRIPOUTSEL_EMBEVT3     (0x00000008UL)
#define HRPWM_TRIPOUTSEL_EMBEVT4_POS (4U)
#define HRPWM_TRIPOUTSEL_EMBEVT4     (0x00000010UL)
#define HRPWM_TRIPOUTSEL_EMBEVT5_POS (5U)
#define HRPWM_TRIPOUTSEL_EMBEVT5     (0x00000020UL)
#define HRPWM_TRIPOUTSEL_EMBEVT6_POS (6U)
#define HRPWM_TRIPOUTSEL_EMBEVT6     (0x00000040UL)
#define HRPWM_TRIPOUTSEL_EMBEVT7_POS (7U)
#define HRPWM_TRIPOUTSEL_EMBEVT7     (0x00000080UL)
#define HRPWM_TRIPOUTSEL_EEV1_POS    (9U)
#define HRPWM_TRIPOUTSEL_EEV1        (0x00000200UL)
#define HRPWM_TRIPOUTSEL_EEV2_POS    (10U)
#define HRPWM_TRIPOUTSEL_EEV2        (0x00000400UL)
#define HRPWM_TRIPOUTSEL_EEV3_POS    (11U)
#define HRPWM_TRIPOUTSEL_EEV3        (0x00000800UL)
#define HRPWM_TRIPOUTSEL_EEV4_POS    (12U)
#define HRPWM_TRIPOUTSEL_EEV4        (0x00001000UL)
#define HRPWM_TRIPOUTSEL_EEV5_POS    (13U)
#define HRPWM_TRIPOUTSEL_EEV5        (0x00002000UL)

/* Bit definition for HRPWM_DECTL register */
#define HRPWM_DECTL_ENABLE_POS     (0U)
#define HRPWM_DECTL_ENABLE         (0x00000001UL)
#define HRPWM_DECTL_MODE_POS       (1U)
#define HRPWM_DECTL_MODE           (0x00000002UL)
#define HRPWM_DECTL_REENTRYDLY_POS (8U)
#define HRPWM_DECTL_REENTRYDLY     (0x0000FF00UL)

/* Bit definition for HRPWM_DECOMPSEL register */
#define HRPWM_DECOMPSEL_TRIPL_POS (0U)
#define HRPWM_DECOMPSEL_TRIPL     (0x0000003FUL)
#define HRPWM_DECOMPSEL_TRIPH_POS (8U)
#define HRPWM_DECOMPSEL_TRIPH     (0x00003F00UL)

/* Bit definition for HRPWM_DEACTCTL register */
#define HRPWM_DEACTCTL_PWMA_POS       (0U)
#define HRPWM_DEACTCTL_PWMA           (0x00000003UL)
#define HRPWM_DEACTCTL_PWMA_0         (0x00000001UL)
#define HRPWM_DEACTCTL_PWMA_1         (0x00000002UL)
#define HRPWM_DEACTCTL_TRIPSELA_POS   (2U)
#define HRPWM_DEACTCTL_TRIPSELA       (0x00000004UL)
#define HRPWM_DEACTCTL_PWMB_POS       (4U)
#define HRPWM_DEACTCTL_PWMB           (0x00000030UL)
#define HRPWM_DEACTCTL_PWMB_0         (0x00000010UL)
#define HRPWM_DEACTCTL_PWMB_1         (0x00000020UL)
#define HRPWM_DEACTCTL_TRIPSELB_POS   (6U)
#define HRPWM_DEACTCTL_TRIPSELB       (0x00000040UL)
#define HRPWM_DEACTCTL_TRIPENABLE_POS (16U)
#define HRPWM_DEACTCTL_TRIPENABLE     (0x00010000UL)

/* Bit definition for HRPWM_DESTAT register */
#define HRPWM_DESTAT_DEACTIVE (0x00000001UL)

/* Bit definition for HRPWM_DEFRC register */
#define HRPWM_DEFRC_DEACTIVE (0x00000001UL)

/* Bit definition for HRPWM_DECLR register */
#define HRPWM_DECLR_DEACTIVE (0x00000001UL)

/* Bit definition for HRPWM_DEMONCNT register */
#define HRPWM_DEMONCNT_CNT (0x0000FFFFUL)

/* Bit definition for HRPWM_DEMONCTL register */
#define HRPWM_DEMONCTL_ENABLE (0x00000001UL)

/* Bit definition for HRPWM_DEMONSTEP register */
#define HRPWM_DEMONSTEP_INCSTEP_POS (0U)
#define HRPWM_DEMONSTEP_INCSTEP     (0x000000FFUL)
#define HRPWM_DEMONSTEP_DECSTEP_POS (16U)
#define HRPWM_DEMONSTEP_DECSTEP     (0x00FF0000UL)

/* Bit definition for HRPWM_DEMONRHRES register */
#define HRPWM_DEMONRHRES_THRESHOLD (0x0000FFFFUL)

/* Bit definition for HRPWM_MINDBCFG register */
#define HRPWM_MINDBCFG_ENABLEA_POS   (0U)
#define HRPWM_MINDBCFG_ENABLEA       (0x00000001UL)
#define HRPWM_MINDBCFG_INVERTA_POS   (2U)
#define HRPWM_MINDBCFG_INVERTA       (0x00000004UL)
#define HRPWM_MINDBCFG_SELBLOCKA_POS (3U)
#define HRPWM_MINDBCFG_SELBLOCKA     (0x00000008UL)
#define HRPWM_MINDBCFG_SELA_POS      (4U)
#define HRPWM_MINDBCFG_SELA          (0x000000F0UL)
#define HRPWM_MINDBCFG_POLSELA_POS   (12U)
#define HRPWM_MINDBCFG_POLSELA       (0x00001000UL)
#define HRPWM_MINDBCFG_ENABLEB_POS   (16U)
#define HRPWM_MINDBCFG_ENABLEB       (0x00010000UL)
#define HRPWM_MINDBCFG_INVERTB_POS   (18U)
#define HRPWM_MINDBCFG_INVERTB       (0x00040000UL)
#define HRPWM_MINDBCFG_SELBLOCKB_POS (19U)
#define HRPWM_MINDBCFG_SELBLOCKB     (0x00080000UL)
#define HRPWM_MINDBCFG_SELB_POS      (20U)
#define HRPWM_MINDBCFG_SELB          (0x00F00000UL)
#define HRPWM_MINDBCFG_POLSELB_POS   (28U)
#define HRPWM_MINDBCFG_POLSELB       (0x10000000UL)

/* Bit definition for HRPWM_MINDBDLY register */
#define HRPWM_MINDBDLY_DELAYA_POS (0U)
#define HRPWM_MINDBDLY_DELAYA     (0x0000FFFFUL)
#define HRPWM_MINDBDLY_DELAYB_POS (16U)
#define HRPWM_MINDBDLY_DELAYB     (0xFFFF0000UL)

/* Bit definition for HRPWM_LUTCTLA register */
#define HRPWM_LUTCTLA_BYPASS_POS  (0U)
#define HRPWM_LUTCTLA_BYPASS      (0x00000001UL)
#define HRPWM_LUTCTLA_SELXBAR_POS (4U)
#define HRPWM_LUTCTLA_SELXBAR     (0x000000F0UL)
#define HRPWM_LUTCTLA_LUTDEC_POS  (16U)
#define HRPWM_LUTCTLA_LUTDEC      (0x00FF0000UL)

