MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_LUTCTLB register */
#define HRPWM_LUTCTLB_BYPASS_POS  (0U)
#define HRPWM_LUTCTLB_BYPASS      (0x00000001UL)
#define HRPWM_LUTCTLB_SELXBAR_POS (4U)
#define HRPWM_LUTCTLB_SELXBAR     (0x000000F0UL)
#define HRPWM_LUTCTLB_LUTDEC_POS  (16U)
#define HRPWM_LUTCTLB_LUTDEC      (0x00FF0000UL)

/*******************************************************************************
                Bit definition for Peripheral HRPWM_COMMON
 *******************************************************************************/
/* Bit definition for HRPWM_COMMON_CALCR register */
#define HRPWM_COMMON_CALCR_CAL_POS    (0U)
#define HRPWM_COMMON_CALCR_CAL        (0x00000001UL)
#define HRPWM_COMMON_CALCR_CALEN_POS  (1U)
#define HRPWM_COMMON_CALCR_CALEN      (0x00000002UL)
#define HRPWM_COMMON_CALCR_CALPRD_POS (2U)
#define HRPWM_COMMON_CALCR_CALPRD     (0x0000003CUL)
#define HRPWM_COMMON_CALCR_CALENF_POS (8U)
#define HRPWM_COMMON_CALCR_CALENF     (0x00000100UL)
#define HRPWM_COMMON_CALCR_ERRF_POS   (9U)
#define HRPWM_COMMON_CALCR_ERRF       (0x00000200UL)
#define HRPWM_COMMON_CALCR_CALIE_POS  (10U)
#define HRPWM_COMMON_CALCR_CALIE      (0x00000400UL)

/* Bit definition for HRPWM_COMMON_GLAOSSELR7 register */
#define HRPWM_COMMON_GLAOSSELR7_GLAOSSEL7_POS  (0U)
#define HRPWM_COMMON_GLAOSSELR7_GLAOSSEL7      (0x0000001FUL)
#define HRPWM_COMMON_GLAOSSELR7_GLAOSSEL8_POS  (5U)
#define HRPWM_COMMON_GLAOSSELR7_GLAOSSEL8      (0x000003E0UL)
#define HRPWM_COMMON_GLAOSSELR7_GLAOSSEL9_POS  (10U)
#define HRPWM_COMMON_GLAOSSELR7_GLAOSSEL9      (0x00007C00UL)
#define HRPWM_COMMON_GLAOSSELR7_GLAOSSEL10_POS (16U)
#define HRPWM_COMMON_GLAOSSELR7_GLAOSSEL10     (0x001F0000UL)

/* Bit definition for HRPWM_COMMON_GLAOSSELR6 register */
#define HRPWM_COMMON_GLAOSSELR6_CMSA4_POS (0U)
#define HRPWM_COMMON_GLAOSSELR6_CMSA4     (0x00000001UL)
#define HRPWM_COMMON_GLAOSSELR6_CMSB4_POS (1U)
#define HRPWM_COMMON_GLAOSSELR6_CMSB4     (0x00000002UL)
#define HRPWM_COMMON_GLAOSSELR6_OVF4_POS  (2U)
#define HRPWM_COMMON_GLAOSSELR6_OVF4      (0x00000004UL)
#define HRPWM_COMMON_GLAOSSELR6_UDF4_POS  (3U)
#define HRPWM_COMMON_GLAOSSELR6_UDF4      (0x00000008UL)
#define HRPWM_COMMON_GLAOSSELR6_CMSA5_POS (4U)
#define HRPWM_COMMON_GLAOSSELR6_CMSA5     (0x00000010UL)
#define HRPWM_COMMON_GLAOSSELR6_CMSB5_POS (5U)
#define HRPWM_COMMON_GLAOSSELR6_CMSB5     (0x00000020UL)
#define HRPWM_COMMON_GLAOSSELR6_OVF5_POS  (6U)
#define HRPWM_COMMON_GLAOSSELR6_OVF5      (0x00000040UL)
#define HRPWM_COMMON_GLAOSSELR6_UDF5_POS  (7U)
#define HRPWM_COMMON_GLAOSSELR6_UDF5      (0x00000080UL)
#define HRPWM_COMMON_GLAOSSELR6_CMSA6_POS (8U)
#define HRPWM_COMMON_GLAOSSELR6_CMSA6     (0x00000100UL)
#define HRPWM_COMMON_GLAOSSELR6_CMSB6_POS (9U)
#define HRPWM_COMMON_GLAOSSELR6_CMSB6     (0x00000200UL)
#define HRPWM_COMMON_GLAOSSELR6_OVF6_POS  (10U)
#define HRPWM_COMMON_GLAOSSELR6_OVF6      (0x00000400UL)
#define HRPWM_COMMON_GLAOSSELR6_UDF6_POS  (11U)
#define HRPWM_COMMON_GLAOSSELR6_UDF6      (0x00000800UL)
#define HRPWM_COMMON_GLAOSSELR6_CMSA7_POS (12U)
#define HRPWM_COMMON_GLAOSSELR6_CMSA7     (0x00001000UL)
#define HRPWM_COMMON_GLAOSSELR6_CMSB7_POS (13U)
#define HRPWM_COMMON_GLAOSSELR6_CMSB7     (0x00002000UL)
#define HRPWM_COMMON_GLAOSSELR6_OVF7_POS  (14U)
#define HRPWM_COMMON_GLAOSSELR6_OVF7      (0x00004000UL)
#define HRPWM_COMMON_GLAOSSELR6_UDF7_POS  (15U)
#define HRPWM_COMMON_GLAOSSELR6_UDF7      (0x00008000UL)
#define HRPWM_COMMON_GLAOSSELR6_CMSA8_POS (16U)
#define HRPWM_COMMON_GLAOSSELR6_CMSA8     (0x00010000UL)
#define HRPWM_COMMON_GLAOSSELR6_CMSB8_POS (17U)
#define HRPWM_COMMON_GLAOSSELR6_CMSB8     (0x00020000UL)
#define HRPWM_COMMON_GLAOSSELR6_OVF8_POS  (18U)
#define HRPWM_COMMON_GLAOSSELR6_OVF8      (0x00040000UL)
#define HRPWM_COMMON_GLAOSSELR6_UDF8_POS  (19U)
#define HRPWM_COMMON_GLAOSSELR6_UDF8      (0x00080000UL)
#define HRPWM_COMMON_GLAOSSELR6_EEV3_POS  (24U)
#define HRPWM_COMMON_GLAOSSELR6_EEV3      (0x01000000UL)
#define HRPWM_COMMON_GLAOSSELR6_EEV4_POS  (25U)
#define HRPWM_COMMON_GLAOSSELR6_EEV4      (0x02000000UL)
#define HRPWM_COMMON_GLAOSSELR6_EEV5_POS  (26U)
#define HRPWM_COMMON_GLAOSSELR6_EEV5      (0x04000000UL)
#define HRPWM_COMMON_GLAOSSELR6_EEV6_POS  (27U)
#define HRPWM_COMMON_GLAOSSELR6_EEV6      (0x08000000UL)
#define HRPWM_COMMON_GLAOSSELR6_EEV7_POS  (28U)
#define HRPWM_COMMON_GLAOSSELR6_EEV7      (0x10000000UL)
#define HRPWM_COMMON_GLAOSSELR6_EEV8_POS  (29U)
#define HRPWM_COMMON_GLAOSSELR6_EEV8      (0x20000000UL)
#define HRPWM_COMMON_GLAOSSELR6_EEV9_POS  (30U)
#define HRPWM_COMMON_GLAOSSELR6_EEV9      (0x40000000UL)
#define HRPWM_COMMON_GLAOSSELR6_EEV10_POS (31U)
#define HRPWM_COMMON_GLAOSSELR6_EEV10     (0x80000000UL)

/* Bit definition for HRPWM_COMMON_GLAOSSELR5 register */
#define HRPWM_COMMON_GLAOSSELR5_CMSA4_POS (0U)
#define HRPWM_COMMON_GLAOSSELR5_CMSA4     (0x00000001UL)
#define HRPWM_COMMON_GLAOSSELR5_CMSB4_POS (1U)
#define HRPWM_COMMON_GLAOSSELR5_CMSB4     (0x00000002UL)
#define HRPWM_COMMON_GLAOSSELR5_OVF4_POS  (2U)
#define HRPWM_COMMON_GLAOSSELR5_OVF4      (0x00000004UL)
#define HRPWM_COMMON_GLAOSSELR5_UDF4_POS  (3U)
#define HRPWM_COMMON_GLAOSSELR5_UDF4      (0x00000008UL)
#define HRPWM_COMMON_GLAOSSELR5_CMSA5_POS (4U)
#define HRPWM_COMMON_GLAOSSELR5_CMSA5     (0x00000010UL)
#define HRPWM_COMMON_GLAOSSELR5_CMSB5_POS (5U)
#define HRPWM_COMMON_GLAOSSELR5_CMSB5     (0x00000020UL)
#define HRPWM_COMMON_GLAOSSELR5_OVF5_POS  (6U)
#define HRPWM_COMMON_GLAOSSELR5_OVF5      (0x00000040UL)
#define HRPWM_COMMON_GLAOSSELR5_UDF5_POS  (7U)
#define HRPWM_COMMON_GLAOSSELR5_UDF5      (0x00000080UL)
#define HRPWM_COMMON_GLAOSSELR5_CMSA6_POS (8U)
#define HRPWM_COMMON_GLAOSSELR5_CMSA6     (0x00000100UL)
#define HRPWM_COMMON_GLAOSSELR5_CMSB6_POS (9U)
#define HRPWM_COMMON_GLAOSSELR5_CMSB6     (0x00000200UL)
#define HRPWM_COMMON_GLAOSSELR5_OVF6_POS  (10U)
#define HRPWM_COMMON_GLAOSSELR5_OVF6      (0x00000400UL)
#define HRPWM_COMMON_GLAOSSELR5_UDF6_POS  (11U)
#define HRPWM_COMMON_GLAOSSELR5_UDF6      (0x00000800UL)
#define HRPWM_COMMON_GLAOSSELR5_CMSA7_POS (12U)
#define HRPWM_COMMON_GLAOSSELR5_CMSA7     (0x00001000UL)
#define HRPWM_COMMON_GLAOSSELR5_CMSB7_POS (13U)
#define HRPWM_COMMON_GLAOSSELR5_CMSB7     (0x00002000UL)
#define HRPWM_COMMON_GLAOSSELR5_OVF7_POS  (14U)
#define HRPWM_COMMON_GLAOSSELR5_OVF7      (0x00004000UL)
#define HRPWM_COMMON_GLAOSSELR5_UDF7_POS  (15U)
#define HRPWM_COMMON_GLAOSSELR5_UDF7      (0x00008000UL)
#define HRPWM_COMMON_GLAOSSELR5_CMSA8_POS (16U)
#define HRPWM_COMMON_GLAOSSELR5_CMSA8     (0x00010000UL)
#define HRPWM_COMMON_GLAOSSELR5_CMSB8_POS (17U)
#define HRPWM_COMMON_GLAOSSELR5_CMSB8     (0x00020000UL)
#define HRPWM_COMMON_GLAOSSELR5_OVF8_POS  (18U)
#define HRPWM_COMMON_GLAOSSELR5_OVF8      (0x00040000UL)
#define HRPWM_COMMON_GLAOSSELR5_UDF8_POS  (19U)
#define HRPWM_COMMON_GLAOSSELR5_UDF8      (0x00080000UL)
#define HRPWM_COMMON_GLAOSSELR5_EEV3_POS  (24U)
#define HRPWM_COMMON_GLAOSSELR5_EEV3      (0x01000000UL)
#define HRPWM_COMMON_GLAOSSELR5_EEV4_POS  (25U)
#define HRPWM_COMMON_GLAOSSELR5_EEV4      (0x02000000UL)
#define HRPWM_COMMON_GLAOSSELR5_EEV5_POS  (26U)
#define HRPWM_COMMON_GLAOSSELR5_EEV5      (0x04000000UL)
#define HRPWM_COMMON_GLAOSSELR5_EEV6_POS  (27U)
#define HRPWM_COMMON_GLAOSSELR5_EEV6      (0x08000000UL)
#define HRPWM_COMMON_GLAOSSELR5_EEV7_POS  (28U)
#define HRPWM_COMMON_GLAOSSELR5_EEV7      (0x10000000UL)
#define HRPWM_COMMON_GLAOSSELR5_EEV8_POS  (29U)
#define HRPWM_COMMON_GLAOSSELR5_EEV8      (0x20000000UL)
#define HRPWM_COMMON_GLAOSSELR5_EEV9_POS  (30U)
#define HRPWM_COMMON_GLAOSSELR5_EEV9      (0x40000000UL)
#define HRPWM_COMMON_GLAOSSELR5_EEV10_POS (31U)
#define HRPWM_COMMON_GLAOSSELR5_EEV10     (0x80000000UL)

/* Bit definition for HRPWM_COMMON_GLAOSSELR4 register */
#define HRPWM_COMMON_GLAOSSELR4_CMSA4_POS (0U)
#define HRPWM_COMMON_GLAOSSELR4_CMSA4     (0x00000001UL)
#define HRPWM_COMMON_GLAOSSELR4_CMSB4_POS (1U)
#define HRPWM_COMMON_GLAOSSELR4_CMSB4     (0x00000002UL)
#define HRPWM_COMMON_GLAOSSELR4_OVF4_POS  (2U)
#define HRPWM_COMMON_GLAOSSELR4_OVF4      (0x00000004UL)
#define HRPWM_COMMON_GLAOSSELR4_UDF4_POS  (3U)
#define HRPWM_COMMON_GLAOSSELR4_UDF4      (0x00000008UL)
#define HRPWM_COMMON_GLAOSSELR4_CMSA5_POS (4U)
#define HRPWM_COMMON_GLAOSSELR4_CMSA5     (0x00000010UL)
#define HRPWM_COMMON_GLAOSSELR4_CMSB5_POS (5U)
#define HRPWM_COMMON_GLAOSSELR4_CMSB5     (0x00000020UL)
#define HRPWM_COMMON_GLAOSSELR4_OVF5_POS  (6U)
#define HRPWM_COMMON_GLAOSSELR4_OVF5      (0x00000040UL)
#define HRPWM_COMMON_GLAOSSELR4_UDF5_POS  (7U)
#define HRPWM_COMMON_GLAOSSELR4_UDF5      (0x00000080UL)
#define HRPWM_COMMON_GLAOSSELR4_CMSA6_POS (8U)
#define HRPWM_COMMON_GLAOSSELR4_CMSA6     (0x00000100UL)
#define HRPWM_COMMON_GLAOSSELR4_CMSB6_POS (9U)
#define HRPWM_COMMON_GLAOSSELR4_CMSB6     (0x00000200UL)
#define HRPWM_COMMON_GLAOSSELR4_OVF6_POS  (10U)
#define HRPWM_COMMON_GLAOSSELR4_OVF6      (0x00000400UL)
#define HRPWM_COMMON_GLAOSSELR4_UDF6_POS  (11U)
#define HRPWM_COMMON_GLAOSSELR4_UDF6      (0x00000800UL)
#define HRPWM_COMMON_GLAOSSELR4_CMSA7_POS (12U)
#define HRPWM_COMMON_GLAOSSELR4_CMSA7     (0x00001000UL)
#define HRPWM_COMMON_GLAOSSELR4_CMSB7_POS (13U)
#define HRPWM_COMMON_GLAOSSELR4_CMSB7     (0x00002000UL)
#define HRPWM_COMMON_GLAOSSELR4_OVF7_POS  (14U)
#define HRPWM_COMMON_GLAOSSELR4_OVF7      (0x00004000UL)
#define HRPWM_COMMON_GLAOSSELR4_UDF7_POS  (15U)
#define HRPWM_COMMON_GLAOSSELR4_UDF7      (0x00008000UL)
#define HRPWM_COMMON_GLAOSSELR4_CMSA8_POS (16U)
#define HRPWM_COMMON_GLAOSSELR4_CMSA8     (0x00010000UL)
#define HRPWM_COMMON_GLAOSSELR4_CMSB8_POS (17U)
#define HRPWM_COMMON_GLAOSSELR4_CMSB8     (0x00020000UL)
#define HRPWM_COMMON_GLAOSSELR4_OVF8_POS  (18U)
#define HRPWM_COMMON_GLAOSSELR4_OVF8      (0x00040000UL)
#define HRPWM_COMMON_GLAOSSELR4_UDF8_POS  (19U)
#define HRPWM_COMMON_GLAOSSELR4_UDF8      (0x00080000UL)
#define HRPWM_COMMON_GLAOSSELR4_EEV3_POS  (24U)
#define HRPWM_COMMON_GLAOSSELR4_EEV3      (0x01000000UL)
#define HRPWM_COMMON_GLAOSSELR4_EEV4_POS  (25U)
#define HRPWM_COMMON_GLAOSSELR4_EEV4      (0x02000000UL)
#define HRPWM_COMMON_GLAOSSELR4_EEV5_POS  (26U)
#define HRPWM_COMMON_GLAOSSELR4_EEV5      (0x04000000UL)
#define HRPWM_COMMON_GLAOSSELR4_EEV6_POS  (27U)
#define HRPWM_COMMON_GLAOSSELR4_EEV6      (0x08000000UL)
#define HRPWM_COMMON_GLAOSSELR4_EEV7_POS  (28U)
#define HRPWM_COMMON_GLAOSSELR4_EEV7      (0x10000000UL)
#define HRPWM_COMMON_GLAOSSELR4_EEV8_POS  (29U)
#define HRPWM_COMMON_GLAOSSELR4_EEV8      (0x20000000UL)
#define HRPWM_COMMON_GLAOSSELR4_EEV9_POS  (30U)
#define HRPWM_COMMON_GLAOSSELR4_EEV9      (0x40000000UL)
#define HRPWM_COMMON_GLAOSSELR4_EEV10_POS (31U)
#define HRPWM_COMMON_GLAOSSELR4_EEV10     (0x80000000UL)

/* Bit definition for HRPWM_COMMON_GLAOSSELR3 register */
#define HRPWM_COMMON_GLAOSSELR3_CMSA1_POS (0U)
#define HRPWM_COMMON_GLAOSSELR3_CMSA1     (0x00000001UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSB1_POS (1U)
#define HRPWM_COMMON_GLAOSSELR3_CMSB1     (0x00000002UL)
#define HRPWM_COMMON_GLAOSSELR3_OVF1_POS  (2U)
#define HRPWM_COMMON_GLAOSSELR3_OVF1      (0x00000004UL)
#define HRPWM_COMMON_GLAOSSELR3_UDF1_POS  (3U)
#define HRPWM_COMMON_GLAOSSELR3_UDF1      (0x00000008UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSA2_POS (4U)
#define HRPWM_COMMON_GLAOSSELR3_CMSA2     (0x00000010UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSB2_POS (5U)
#define HRPWM_COMMON_GLAOSSELR3_CMSB2     (0x00000020UL)
#define HRPWM_COMMON_GLAOSSELR3_OVF2_POS  (6U)
#define HRPWM_COMMON_GLAOSSELR3_OVF2      (0x00000040UL)
#define HRPWM_COMMON_GLAOSSELR3_UDF2_POS  (7U)
#define HRPWM_COMMON_GLAOSSELR3_UDF2      (0x00000080UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSA3_POS (8U)
#define HRPWM_COMMON_GLAOSSELR3_CMSA3     (0x00000100UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSB3_POS (9U)
#define HRPWM_COMMON_GLAOSSELR3_CMSB3     (0x00000200UL)
#define HRPWM_COMMON_GLAOSSELR3_OVF3_POS  (10U)
#define HRPWM_COMMON_GLAOSSELR3_OVF3      (0x00000400UL)
#define HRPWM_COMMON_GLAOSSELR3_UDF3_POS  (11U)
#define HRPWM_COMMON_GLAOSSELR3_UDF3      (0x00000800UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSA4_POS (12U)
#define HRPWM_COMMON_GLAOSSELR3_CMSA4     (0x00001000UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSB4_POS (13U)
#define HRPWM_COMMON_GLAOSSELR3_CMSB4     (0x00002000UL)
#define HRPWM_COMMON_GLAOSSELR3_OVF4_POS  (14U)
#define HRPWM_COMMON_GLAOSSELR3_OVF4      (0x00004000UL)
#define HRPWM_COMMON_GLAOSSELR3_UDF4_POS  (15U)
#define HRPWM_COMMON_GLAOSSELR3_UDF4      (0x00008000UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSA5_POS (16U)
#define HRPWM_COMMON_GLAOSSELR3_CMSA5     (0x00010000UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSB5_POS (17U)
#define HRPWM_COMMON_GLAOSSELR3_CMSB5     (0x00020000UL)
#define HRPWM_COMMON_GLAOSSELR3_OVF5_POS  (18U)
#define HRPWM_COMMON_GLAOSSELR3_OVF5      (0x00040000UL)
#define HRPWM_COMMON_GLAOSSELR3_UDF5_POS  (19U)
#define HRPWM_COMMON_GLAOSSELR3_UDF5      (0x00080000UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSA6_POS (20U)
#define HRPWM_COMMON_GLAOSSELR3_CMSA6     (0x00100000UL)
#define HRPWM_COMMON_GLAOSSELR3_CMSB6_POS (21U)
#define HRPWM_COMMON_GLAOSSELR3_CMSB6     (0x00200000UL)
#define HRPWM_COMMON_GLAOSSELR3_OVF6_POS  (22U)
#define HRPWM_COMMON_GLAOSSELR3_OVF6      (0x00400000UL)
#define HRPWM_COMMON_GLAOSSELR3_UDF6_POS  (23U)
#define HRPWM_COMMON_GLAOSSELR3_UDF6      (0x00800000UL)
#define HRPWM_COMMON_GLAOSSELR3_EEV1_POS  (24U)
#define HRPWM_COMMON_GLAOSSELR3_EEV1      (0x01000000UL)
#define HRPWM_COMMON_GLAOSSELR3_EEV2_POS  (25U)
#define HRPWM_COMMON_GLAOSSELR3_EEV2      (0x02000000UL)
#define HRPWM_COMMON_GLAOSSELR3_EEV3_POS  (26U)
#define HRPWM_COMMON_GLAOSSELR3_EEV3      (0x04000000UL)
#define HRPWM_COMMON_GLAOSSELR3_EEV4_POS  (27U)
#define HRPWM_COMMON_GLAOSSELR3_EEV4      (0x08000000UL)
#define HRPWM_COMMON_GLAOSSELR3_EEV5_POS  (28U)
#define HRPWM_COMMON_GLAOSSELR3_EEV5      (0x10000000UL)
#define HRPWM_COMMON_GLAOSSELR3_EEV6_POS  (29U)
#define HRPWM_COMMON_GLAOSSELR3_EEV6      (0x20000000UL)
#define HRPWM_COMMON_GLAOSSELR3_EEV7_POS  (30U)
#define HRPWM_COMMON_GLAOSSELR3_EEV7      (0x40000000UL)
#define HRPWM_COMMON_GLAOSSELR3_EEV8_POS  (31U)
#define HRPWM_COMMON_GLAOSSELR3_EEV8      (0x80000000UL)

/* Bit definition for HRPWM_COMMON_GLAOSSELR2 register */
#define HRPWM_COMMON_GLAOSSELR2_CMSA1_POS (0U)
#define HRPWM_COMMON_GLAOSSELR2_CMSA1     (0x00000001UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSB1_POS (1U)
#define HRPWM_COMMON_GLAOSSELR2_CMSB1     (0x00000002UL)
#define HRPWM_COMMON_GLAOSSELR2_OVF1_POS  (2U)
#define HRPWM_COMMON_GLAOSSELR2_OVF1      (0x00000004UL)
#define HRPWM_COMMON_GLAOSSELR2_UDF1_POS  (3U)
#define HRPWM_COMMON_GLAOSSELR2_UDF1      (0x00000008UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSA2_POS (4U)
#define HRPWM_COMMON_GLAOSSELR2_CMSA2     (0x00000010UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSB2_POS (5U)
#define HRPWM_COMMON_GLAOSSELR2_CMSB2     (0x00000020UL)
#define HRPWM_COMMON_GLAOSSELR2_OVF2_POS  (6U)
#define HRPWM_COMMON_GLAOSSELR2_OVF2      (0x00000040UL)
#define HRPWM_COMMON_GLAOSSELR2_UDF2_POS  (7U)
#define HRPWM_COMMON_GLAOSSELR2_UDF2      (0x00000080UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSA3_POS (8U)
#define HRPWM_COMMON_GLAOSSELR2_CMSA3     (0x00000100UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSB3_POS (9U)
#define HRPWM_COMMON_GLAOSSELR2_CMSB3     (0x00000200UL)
#define HRPWM_COMMON_GLAOSSELR2_OVF3_POS  (10U)
#define HRPWM_COMMON_GLAOSSELR2_OVF3      (0x00000400UL)
#define HRPWM_COMMON_GLAOSSELR2_UDF3_POS  (11U)
#define HRPWM_COMMON_GLAOSSELR2_UDF3      (0x00000800UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSA4_POS (12U)
#define HRPWM_COMMON_GLAOSSELR2_CMSA4     (0x00001000UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSB4_POS (13U)
#define HRPWM_COMMON_GLAOSSELR2_CMSB4     (0x00002000UL)
#define HRPWM_COMMON_GLAOSSELR2_OVF4_POS  (14U)
#define HRPWM_COMMON_GLAOSSELR2_OVF4      (0x00004000UL)
#define HRPWM_COMMON_GLAOSSELR2_UDF4_POS  (15U)
#define HRPWM_COMMON_GLAOSSELR2_UDF4      (0x00008000UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSA5_POS (16U)
#define HRPWM_COMMON_GLAOSSELR2_CMSA5     (0x00010000UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSB5_POS (17U)
#define HRPWM_COMMON_GLAOSSELR2_CMSB5     (0x00020000UL)
#define HRPWM_COMMON_GLAOSSELR2_OVF5_POS  (18U)
#define HRPWM_COMMON_GLAOSSELR2_OVF5      (0x00040000UL)
#define HRPWM_COMMON_GLAOSSELR2_UDF5_POS  (19U)
#define HRPWM_COMMON_GLAOSSELR2_UDF5      (0x00080000UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSA6_POS (20U)
#define HRPWM_COMMON_GLAOSSELR2_CMSA6     (0x00100000UL)
#define HRPWM_COMMON_GLAOSSELR2_CMSB6_POS (21U)
#define HRPWM_COMMON_GLAOSSELR2_CMSB6     (0x00200000UL)
#define HRPWM_COMMON_GLAOSSELR2_OVF6_POS  (22U)
#define HRPWM_COMMON_GLAOSSELR2_OVF6      (0x00400000UL)
#define HRPWM_COMMON_GLAOSSELR2_UDF6_POS  (23U)
#define HRPWM_COMMON_GLAOSSELR2_UDF6      (0x00800000UL)
#define HRPWM_COMMON_GLAOSSELR2_EEV1_POS  (24U)
#define HRPWM_COMMON_GLAOSSELR2_EEV1      (0x01000000UL)
#define HRPWM_COMMON_GLAOSSELR2_EEV2_POS  (25U)
#define HRPWM_COMMON_GLAOSSELR2_EEV2      (0x02000000UL)
#define HRPWM_COMMON_GLAOSSELR2_EEV3_POS  (26U)
#define HRPWM_COMMON_GLAOSSELR2_EEV3      (0x04000000UL)
#define HRPWM_COMMON_GLAOSSELR2_EEV4_POS  (27U)
#define HRPWM_COMMON_GLAOSSELR2_EEV4      (0x08000000UL)
#define HRPWM_COMMON_GLAOSSELR2_EEV5_POS  (28U)
#define HRPWM_COMMON_GLAOSSELR2_EEV5      (0x10000000UL)
#define HRPWM_COMMON_GLAOSSELR2_EEV6_POS  (29U)
#define HRPWM_COMMON_GLAOSSELR2_EEV6      (0x20000000UL)
#define HRPWM_COMMON_GLAOSSELR2_EEV7_POS  (30U)
#define HRPWM_COMMON_GLAOSSELR2_EEV7      (0x40000000UL)
#define HRPWM_COMMON_GLAOSSELR2_EEV8_POS  (31U)
#define HRPWM_COMMON_GLAOSSELR2_EEV8      (0x80000000UL)

/* Bit definition for HRPWM_COMMON_GLAOSSELR1 register */
#define HRPWM_COMMON_GLAOSSELR1_CMSA1_POS (0U)
#define HRPWM_COMMON_GLAOSSELR1_CMSA1     (0x00000001UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSB1_POS (1U)
#define HRPWM_COMMON_GLAOSSELR1_CMSB1     (0x00000002UL)
#define HRPWM_COMMON_GLAOSSELR1_OVF1_POS  (2U)
#define HRPWM_COMMON_GLAOSSELR1_OVF1      (0x00000004UL)
#define HRPWM_COMMON_GLAOSSELR1_UDF1_POS  (3U)
#define HRPWM_COMMON_GLAOSSELR1_UDF1      (0x00000008UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSA2_POS (4U)
#define HRPWM_COMMON_GLAOSSELR1_CMSA2     (0x00000010UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSB2_POS (5U)
#define HRPWM_COMMON_GLAOSSELR1_CMSB2     (0x00000020UL)
#define HRPWM_COMMON_GLAOSSELR1_OVF2_POS  (6U)
#define HRPWM_COMMON_GLAOSSELR1_OVF2      (0x00000040UL)
#define HRPWM_COMMON_GLAOSSELR1_UDF2_POS  (7U)
#define HRPWM_COMMON_GLAOSSELR1_UDF2      (0x00000080UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSA3_POS (8U)
#define HRPWM_COMMON_GLAOSSELR1_CMSA3     (0x00000100UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSB3_POS (9U)
#define HRPWM_COMMON_GLAOSSELR1_CMSB3     (0x00000200UL)
#define HRPWM_COMMON_GLAOSSELR1_OVF3_POS  (10U)
#define HRPWM_COMMON_GLAOSSELR1_OVF3      (0x00000400UL)
#define HRPWM_COMMON_GLAOSSELR1_UDF3_POS  (11U)
#define HRPWM_COMMON_GLAOSSELR1_UDF3      (0x00000800UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSA4_POS (12U)
#define HRPWM_COMMON_GLAOSSELR1_CMSA4     (0x00001000UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSB4_POS (13U)
#define HRPWM_COMMON_GLAOSSELR1_CMSB4     (0x00002000UL)
#define HRPWM_COMMON_GLAOSSELR1_OVF4_POS  (14U)
#define HRPWM_COMMON_GLAOSSELR1_OVF4      (0x00004000UL)
#define HRPWM_COMMON_GLAOSSELR1_UDF4_POS  (15U)
#define HRPWM_COMMON_GLAOSSELR1_UDF4      (0x00008000UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSA5_POS (16U)
#define HRPWM_COMMON_GLAOSSELR1_CMSA5     (0x00010000UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSB5_POS (17U)
#define HRPWM_COMMON_GLAOSSELR1_CMSB5     (0x00020000UL)
#define HRPWM_COMMON_GLAOSSELR1_OVF5_POS  (18U)
#define HRPWM_COMMON_GLAOSSELR1_OVF5      (0x00040000UL)
#define HRPWM_COMMON_GLAOSSELR1_UDF5_POS  (19U)
#define HRPWM_COMMON_GLAOSSELR1_UDF5      (0x00080000UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSA6_POS (20U)
#define HRPWM_COMMON_GLAOSSELR1_CMSA6     (0x00100000UL)
#define HRPWM_COMMON_GLAOSSELR1_CMSB6_POS (21U)
#define HRPWM_COMMON_GLAOSSELR1_CMSB6     (0x00200000UL)
#define HRPWM_COMMON_GLAOSSELR1_OVF6_POS  (22U)
#define HRPWM_COMMON_GLAOSSELR1_OVF6      (0x00400000UL)
#define HRPWM_COMMON_GLAOSSELR1_UDF6_POS  (23U)
#define HRPWM_COMMON_GLAOSSELR1_UDF6      (0x00800000UL)
#define HRPWM_COMMON_GLAOSSELR1_EEV1_POS  (24U)
#define HRPWM_COMMON_GLAOSSELR1_EEV1      (0x01000000UL)
#define HRPWM_COMMON_GLAOSSELR1_EEV2_POS  (25U)
#define HRPWM_COMMON_GLAOSSELR1_EEV2      (0x02000000UL)
#define HRPWM_COMMON_GLAOSSELR1_EEV3_POS  (26U)
#define HRPWM_COMMON_GLAOSSELR1_EEV3      (0x04000000UL)
#define HRPWM_COMMON_GLAOSSELR1_EEV4_POS  (27U)
#define HRPWM_COMMON_GLAOSSELR1_EEV4      (0x08000000UL)
#define HRPWM_COMMON_GLAOSSELR1_EEV5_POS  (28U)
#define HRPWM_COMMON_GLAOSSELR1_EEV5      (0x10000000UL)
#define HRPWM_COMMON_GLAOSSELR1_EEV6_POS  (29U)
#define HRPWM_COMMON_GLAOSSELR1_EEV6      (0x20000000UL)
#define HRPWM_COMMON_GLAOSSELR1_EEV7_POS  (30U)
#define HRPWM_COMMON_GLAOSSELR1_EEV7      (0x40000000UL)
#define HRPWM_COMMON_GLAOSSELR1_EEV8_POS  (31U)
#define HRPWM_COMMON_GLAOSSELR1_EEV8      (0x80000000UL)

