MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_COMMON_GLAOSUR1 register */
#define HRPWM_COMMON_GLAOSUR1_GLAOSU1_POS (0U)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU1     (0x0000000FUL)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU2_POS (4U)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU2     (0x000000F0UL)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU3_POS (8U)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU3     (0x00000F00UL)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU4_POS (12U)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU4     (0x0000F000UL)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU5_POS (16U)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU5     (0x000F0000UL)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU6_POS (20U)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU6     (0x00F00000UL)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU7_POS (24U)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU7     (0x0F000000UL)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU8_POS (28U)
#define HRPWM_COMMON_GLAOSUR1_GLAOSU8     (0xF0000000UL)

/* Bit definition for HRPWM_COMMON_GLAOSUR2 register */
#define HRPWM_COMMON_GLAOSUR2_GLAOSU9_POS  (0U)
#define HRPWM_COMMON_GLAOSUR2_GLAOSU9      (0x0000000FUL)
#define HRPWM_COMMON_GLAOSUR2_GLAOSU10_POS (4U)
#define HRPWM_COMMON_GLAOSUR2_GLAOSU10     (0x000000F0UL)

/* Bit definition for HRPWM_COMMON_GLAOSPSCR1 register */
#define HRPWM_COMMON_GLAOSPSCR1_PSC1_POS (0U)
#define HRPWM_COMMON_GLAOSPSCR1_PSC1     (0x0000001FUL)
#define HRPWM_COMMON_GLAOSPSCR1_PSC2_POS (6U)
#define HRPWM_COMMON_GLAOSPSCR1_PSC2     (0x000007C0UL)
#define HRPWM_COMMON_GLAOSPSCR1_PSC3_POS (12U)
#define HRPWM_COMMON_GLAOSPSCR1_PSC3     (0x0001F000UL)
#define HRPWM_COMMON_GLAOSPSCR1_PSC4_POS (18U)
#define HRPWM_COMMON_GLAOSPSCR1_PSC4     (0x007C0000UL)
#define HRPWM_COMMON_GLAOSPSCR1_PSC5_POS (24U)
#define HRPWM_COMMON_GLAOSPSCR1_PSC5     (0x1F000000UL)

/* Bit definition for HRPWM_COMMON_GLAOSPSCR2 register */
#define HRPWM_COMMON_GLAOSPSCR2_PSC6_POS  (0U)
#define HRPWM_COMMON_GLAOSPSCR2_PSC6      (0x0000001FUL)
#define HRPWM_COMMON_GLAOSPSCR2_PSC7_POS  (6U)
#define HRPWM_COMMON_GLAOSPSCR2_PSC7      (0x000007C0UL)
#define HRPWM_COMMON_GLAOSPSCR2_PSC8_POS  (12U)
#define HRPWM_COMMON_GLAOSPSCR2_PSC8      (0x0001F000UL)
#define HRPWM_COMMON_GLAOSPSCR2_PSC9_POS  (18U)
#define HRPWM_COMMON_GLAOSPSCR2_PSC9      (0x007C0000UL)
#define HRPWM_COMMON_GLAOSPSCR2_PSC10_POS (24U)
#define HRPWM_COMMON_GLAOSPSCR2_PSC10     (0x1F000000UL)

/* Bit definition for HRPWM_COMMON_SFTSRR register */
#define HRPWM_COMMON_SFTSRR_SFTSRA1_POS (0U)
#define HRPWM_COMMON_SFTSRR_SFTSRA1     (0x00000001UL)
#define HRPWM_COMMON_SFTSRR_SFTSRA2_POS (1U)
#define HRPWM_COMMON_SFTSRR_SFTSRA2     (0x00000002UL)
#define HRPWM_COMMON_SFTSRR_SFTSRA3_POS (2U)
#define HRPWM_COMMON_SFTSRR_SFTSRA3     (0x00000004UL)
#define HRPWM_COMMON_SFTSRR_SFTSRA4_POS (3U)
#define HRPWM_COMMON_SFTSRR_SFTSRA4     (0x00000008UL)
#define HRPWM_COMMON_SFTSRR_SFTSRA5_POS (4U)
#define HRPWM_COMMON_SFTSRR_SFTSRA5     (0x00000010UL)
#define HRPWM_COMMON_SFTSRR_SFTSRA6_POS (5U)
#define HRPWM_COMMON_SFTSRR_SFTSRA6     (0x00000020UL)
#define HRPWM_COMMON_SFTSRR_SFTSRA7_POS (6U)
#define HRPWM_COMMON_SFTSRR_SFTSRA7     (0x00000040UL)
#define HRPWM_COMMON_SFTSRR_SFTSRA8_POS (7U)
#define HRPWM_COMMON_SFTSRR_SFTSRA8     (0x00000080UL)
#define HRPWM_COMMON_SFTSRR_SFTSRB1_POS (16U)
#define HRPWM_COMMON_SFTSRR_SFTSRB1     (0x00010000UL)
#define HRPWM_COMMON_SFTSRR_SFTSRB2_POS (17U)
#define HRPWM_COMMON_SFTSRR_SFTSRB2     (0x00020000UL)
#define HRPWM_COMMON_SFTSRR_SFTSRB3_POS (18U)
#define HRPWM_COMMON_SFTSRR_SFTSRB3     (0x00040000UL)
#define HRPWM_COMMON_SFTSRR_SFTSRB4_POS (19U)
#define HRPWM_COMMON_SFTSRR_SFTSRB4     (0x00080000UL)
#define HRPWM_COMMON_SFTSRR_SFTSRB5_POS (20U)
#define HRPWM_COMMON_SFTSRR_SFTSRB5     (0x00100000UL)
#define HRPWM_COMMON_SFTSRR_SFTSRB6_POS (21U)
#define HRPWM_COMMON_SFTSRR_SFTSRB6     (0x00200000UL)
#define HRPWM_COMMON_SFTSRR_SFTSRB7_POS (22U)
#define HRPWM_COMMON_SFTSRR_SFTSRB7     (0x00400000UL)
#define HRPWM_COMMON_SFTSRR_SFTSRB8_POS (23U)
#define HRPWM_COMMON_SFTSRR_SFTSRB8     (0x00800000UL)

/* Bit definition for HRPWM_COMMON_SCAPR register */
#define HRPWM_COMMON_SCAPR_SCAP1A_POS (0U)
#define HRPWM_COMMON_SCAPR_SCAP1A     (0x00000001UL)
#define HRPWM_COMMON_SCAPR_SCAP1B_POS (1U)
#define HRPWM_COMMON_SCAPR_SCAP1B     (0x00000002UL)
#define HRPWM_COMMON_SCAPR_SCAP2A_POS (2U)
#define HRPWM_COMMON_SCAPR_SCAP2A     (0x00000004UL)
#define HRPWM_COMMON_SCAPR_SCAP2B_POS (3U)
#define HRPWM_COMMON_SCAPR_SCAP2B     (0x00000008UL)
#define HRPWM_COMMON_SCAPR_SCAP3A_POS (4U)
#define HRPWM_COMMON_SCAPR_SCAP3A     (0x00000010UL)
#define HRPWM_COMMON_SCAPR_SCAP3B_POS (5U)
#define HRPWM_COMMON_SCAPR_SCAP3B     (0x00000020UL)
#define HRPWM_COMMON_SCAPR_SCAP4A_POS (6U)
#define HRPWM_COMMON_SCAPR_SCAP4A     (0x00000040UL)
#define HRPWM_COMMON_SCAPR_SCAP4B_POS (7U)
#define HRPWM_COMMON_SCAPR_SCAP4B     (0x00000080UL)
#define HRPWM_COMMON_SCAPR_SCAP5A_POS (8U)
#define HRPWM_COMMON_SCAPR_SCAP5A     (0x00000100UL)
#define HRPWM_COMMON_SCAPR_SCAP5B_POS (9U)
#define HRPWM_COMMON_SCAPR_SCAP5B     (0x00000200UL)
#define HRPWM_COMMON_SCAPR_SCAP6A_POS (10U)
#define HRPWM_COMMON_SCAPR_SCAP6A     (0x00000400UL)
#define HRPWM_COMMON_SCAPR_SCAP6B_POS (11U)
#define HRPWM_COMMON_SCAPR_SCAP6B     (0x00000800UL)
#define HRPWM_COMMON_SCAPR_SCAP7A_POS (12U)
#define HRPWM_COMMON_SCAPR_SCAP7A     (0x00001000UL)
#define HRPWM_COMMON_SCAPR_SCAP7B_POS (13U)
#define HRPWM_COMMON_SCAPR_SCAP7B     (0x00002000UL)
#define HRPWM_COMMON_SCAPR_SCAP8A_POS (14U)
#define HRPWM_COMMON_SCAPR_SCAP8A     (0x00004000UL)
#define HRPWM_COMMON_SCAPR_SCAP8B_POS (15U)
#define HRPWM_COMMON_SCAPR_SCAP8B     (0x00008000UL)

/* Bit definition for HRPWM_COMMON_SSTAIDLR register */
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL1A_POS (0U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL1A     (0x00000001UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL1B_POS (1U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL1B     (0x00000002UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL2A_POS (2U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL2A     (0x00000004UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL2B_POS (3U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL2B     (0x00000008UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL3A_POS (4U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL3A     (0x00000010UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL3B_POS (5U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL3B     (0x00000020UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL4A_POS (6U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL4A     (0x00000040UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL4B_POS (7U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL4B     (0x00000080UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL5A_POS (8U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL5A     (0x00000100UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL5B_POS (9U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL5B     (0x00000200UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL6A_POS (10U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL6A     (0x00000400UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL6B_POS (11U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL6B     (0x00000800UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL7A_POS (12U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL7A     (0x00001000UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL7B_POS (13U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL7B     (0x00002000UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL8A_POS (14U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL8A     (0x00004000UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL8B_POS (15U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL8B     (0x00008000UL)

/* Bit definition for HRPWM_COMMON_SSTARUNR1 register */
#define HRPWM_COMMON_SSTARUNR1_SSTARUN1A_POS (0U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN1A     (0x00000001UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN1B_POS (1U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN1B     (0x00000002UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN2A_POS (2U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN2A     (0x00000004UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN2B_POS (3U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN2B     (0x00000008UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN3A_POS (4U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN3A     (0x00000010UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN3B_POS (5U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN3B     (0x00000020UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN4A_POS (6U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN4A     (0x00000040UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN4B_POS (7U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN4B     (0x00000080UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN5A_POS (8U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN5A     (0x00000100UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN5B_POS (9U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN5B     (0x00000200UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN6A_POS (10U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN6A     (0x00000400UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN6B_POS (11U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN6B     (0x00000800UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN7A_POS (12U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN7A     (0x00001000UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN7B_POS (13U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN7B     (0x00002000UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN8A_POS (14U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN8A     (0x00004000UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN8B_POS (15U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN8B     (0x00008000UL)

