MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_COMMON_SSTARUNR2 register */
#define HRPWM_COMMON_SSTARUNR2_SSTARUN1A2_POS (0U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN1A2     (0x00000001UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN1B2_POS (1U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN1B2     (0x00000002UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN2A2_POS (2U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN2A2     (0x00000004UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN2B2_POS (3U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN2B2     (0x00000008UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN3A2_POS (4U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN3A2     (0x00000010UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN3B2_POS (5U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN3B2     (0x00000020UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN4A2_POS (6U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN4A2     (0x00000040UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN4B2_POS (7U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN4B2     (0x00000080UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN5A2_POS (8U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN5A2     (0x00000100UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN5B2_POS (9U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN5B2     (0x00000200UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN6A2_POS (10U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN6A2     (0x00000400UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN6B2_POS (11U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN6B2     (0x00000800UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN7A2_POS (12U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN7A2     (0x00001000UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN7B2_POS (13U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN7B2     (0x00002000UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN8A2_POS (14U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN8A2     (0x00004000UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN8B2_POS (15U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN8B2     (0x00008000UL)

/* Bit definition for HRPWM_COMMON_SSTADIDLR register */
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU1_POS (0U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU1     (0x00000001UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU2_POS (1U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU2     (0x00000002UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU3_POS (2U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU3     (0x00000004UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU4_POS (3U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU4     (0x00000008UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU5_POS (4U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU5     (0x00000010UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU6_POS (5U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU6     (0x00000020UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU7_POS (6U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU7     (0x00000040UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU8_POS (7U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU8     (0x00000080UL)

/* Bit definition for HRPWM_COMMON_GCTLR register */
#define HRPWM_COMMON_GCTLR_BKDLY1_POS (4U)
#define HRPWM_COMMON_GCTLR_BKDLY1     (0x00000010UL)
#define HRPWM_COMMON_GCTLR_BKDLY2_POS (5U)
#define HRPWM_COMMON_GCTLR_BKDLY2     (0x00000020UL)
#define HRPWM_COMMON_GCTLR_BKDLY3_POS (6U)
#define HRPWM_COMMON_GCTLR_BKDLY3     (0x00000040UL)
#define HRPWM_COMMON_GCTLR_BKDLY4_POS (7U)
#define HRPWM_COMMON_GCTLR_BKDLY4     (0x00000080UL)
#define HRPWM_COMMON_GCTLR_BKDLY5_POS (8U)
#define HRPWM_COMMON_GCTLR_BKDLY5     (0x00000100UL)
#define HRPWM_COMMON_GCTLR_BKDLY6_POS (9U)
#define HRPWM_COMMON_GCTLR_BKDLY6     (0x00000200UL)
#define HRPWM_COMMON_GCTLR_BKDLY7_POS (10U)
#define HRPWM_COMMON_GCTLR_BKDLY7     (0x00000400UL)
#define HRPWM_COMMON_GCTLR_BKDLY8_POS (11U)
#define HRPWM_COMMON_GCTLR_BKDLY8     (0x00000800UL)

/* Bit definition for HRPWM_COMMON_GBCONR register */
#define HRPWM_COMMON_GBCONR_BTRU1EN_POS  (0U)
#define HRPWM_COMMON_GBCONR_BTRU1EN      (0x00000001UL)
#define HRPWM_COMMON_GBCONR_BTRU2EN_POS  (1U)
#define HRPWM_COMMON_GBCONR_BTRU2EN      (0x00000002UL)
#define HRPWM_COMMON_GBCONR_BTRU3EN_POS  (2U)
#define HRPWM_COMMON_GBCONR_BTRU3EN      (0x00000004UL)
#define HRPWM_COMMON_GBCONR_BTRU4EN_POS  (3U)
#define HRPWM_COMMON_GBCONR_BTRU4EN      (0x00000008UL)
#define HRPWM_COMMON_GBCONR_BTRU5EN_POS  (4U)
#define HRPWM_COMMON_GBCONR_BTRU5EN      (0x00000010UL)
#define HRPWM_COMMON_GBCONR_BTRU6EN_POS  (5U)
#define HRPWM_COMMON_GBCONR_BTRU6EN      (0x00000020UL)
#define HRPWM_COMMON_GBCONR_BTRU7EN_POS  (6U)
#define HRPWM_COMMON_GBCONR_BTRU7EN      (0x00000040UL)
#define HRPWM_COMMON_GBCONR_BTRU8EN_POS  (7U)
#define HRPWM_COMMON_GBCONR_BTRU8EN      (0x00000080UL)
#define HRPWM_COMMON_GBCONR_BTRU1SFT_POS (16U)
#define HRPWM_COMMON_GBCONR_BTRU1SFT     (0x00010000UL)
#define HRPWM_COMMON_GBCONR_BTRU2SFT_POS (17U)
#define HRPWM_COMMON_GBCONR_BTRU2SFT     (0x00020000UL)
#define HRPWM_COMMON_GBCONR_BTRU3SFT_POS (18U)
#define HRPWM_COMMON_GBCONR_BTRU3SFT     (0x00040000UL)
#define HRPWM_COMMON_GBCONR_BTRU4SFT_POS (19U)
#define HRPWM_COMMON_GBCONR_BTRU4SFT     (0x00080000UL)
#define HRPWM_COMMON_GBCONR_BTRU5SFT_POS (20U)
#define HRPWM_COMMON_GBCONR_BTRU5SFT     (0x00100000UL)
#define HRPWM_COMMON_GBCONR_BTRU6SFT_POS (21U)
#define HRPWM_COMMON_GBCONR_BTRU6SFT     (0x00200000UL)
#define HRPWM_COMMON_GBCONR_BTRU7SFT_POS (22U)
#define HRPWM_COMMON_GBCONR_BTRU7SFT     (0x00400000UL)
#define HRPWM_COMMON_GBCONR_BTRU8SFT_POS (23U)
#define HRPWM_COMMON_GBCONR_BTRU8SFT     (0x00800000UL)
#define HRPWM_COMMON_GBCONR_OSTBTRU1_POS (30U)
#define HRPWM_COMMON_GBCONR_OSTBTRU1     (0x40000000UL)
#define HRPWM_COMMON_GBCONR_OSTENU1_POS  (31U)
#define HRPWM_COMMON_GBCONR_OSTENU1      (0x80000000UL)

/* Bit definition for HRPWM_COMMON_GBSFLR register */
#define HRPWM_COMMON_GBSFLR_U1BTRENF_POS (0U)
#define HRPWM_COMMON_GBSFLR_U1BTRENF     (0x00000001UL)
#define HRPWM_COMMON_GBSFLR_U2BTRENF_POS (1U)
#define HRPWM_COMMON_GBSFLR_U2BTRENF     (0x00000002UL)
#define HRPWM_COMMON_GBSFLR_U3BTRENF_POS (2U)
#define HRPWM_COMMON_GBSFLR_U3BTRENF     (0x00000004UL)
#define HRPWM_COMMON_GBSFLR_U4BTRENF_POS (3U)
#define HRPWM_COMMON_GBSFLR_U4BTRENF     (0x00000008UL)
#define HRPWM_COMMON_GBSFLR_U5BTRENF_POS (4U)
#define HRPWM_COMMON_GBSFLR_U5BTRENF     (0x00000010UL)
#define HRPWM_COMMON_GBSFLR_U6BTRENF_POS (5U)
#define HRPWM_COMMON_GBSFLR_U6BTRENF     (0x00000020UL)
#define HRPWM_COMMON_GBSFLR_U7BTRENF_POS (6U)
#define HRPWM_COMMON_GBSFLR_U7BTRENF     (0x00000040UL)
#define HRPWM_COMMON_GBSFLR_U8BTRENF_POS (7U)
#define HRPWM_COMMON_GBSFLR_U8BTRENF     (0x00000080UL)

