MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_COMMON_BMCR register */
#define HRPWM_COMMON_BMCR_BMEN_POS         (0U)
#define HRPWM_COMMON_BMCR_BMEN             (0x00000001UL)
#define HRPWM_COMMON_BMCR_BMCTN_POS        (1U)
#define HRPWM_COMMON_BMCR_BMCTN            (0x00000002UL)
#define HRPWM_COMMON_BMCR_BMCLKS_POS       (2U)
#define HRPWM_COMMON_BMCR_BMCLKS           (0x0000003CUL)
#define HRPWM_COMMON_BMCR_BMPSC_POS        (6U)
#define HRPWM_COMMON_BMCR_BMPSC            (0x000003C0UL)
#define HRPWM_COMMON_BMCR_BMTMR1_POS       (10U)
#define HRPWM_COMMON_BMCR_BMTMR1           (0x00000400UL)
#define HRPWM_COMMON_BMCR_BMTMR2_POS       (11U)
#define HRPWM_COMMON_BMCR_BMTMR2           (0x00000800UL)
#define HRPWM_COMMON_BMCR_BMTMR3_POS       (12U)
#define HRPWM_COMMON_BMCR_BMTMR3           (0x00001000UL)
#define HRPWM_COMMON_BMCR_BMTMR4_POS       (13U)
#define HRPWM_COMMON_BMCR_BMTMR4           (0x00002000UL)
#define HRPWM_COMMON_BMCR_BMTMR5_POS       (14U)
#define HRPWM_COMMON_BMCR_BMTMR5           (0x00004000UL)
#define HRPWM_COMMON_BMCR_BMTMR6_POS       (15U)
#define HRPWM_COMMON_BMCR_BMTMR6           (0x00008000UL)
#define HRPWM_COMMON_BMCR_BMOPTF_POS       (16U)
#define HRPWM_COMMON_BMCR_BMOPTF           (0x00010000UL)
#define HRPWM_COMMON_BMCR_BMOVFF_POS       (17U)
#define HRPWM_COMMON_BMCR_BMOVFF           (0x00020000UL)
#define HRPWM_COMMON_BMCR_INTENBMOVF_POS   (18U)
#define HRPWM_COMMON_BMCR_INTENBMOVF       (0x00040000UL)
#define HRPWM_COMMON_BMCR_BENBMCMP_POS     (19U)
#define HRPWM_COMMON_BMCR_BENBMCMP         (0x00080000UL)
#define HRPWM_COMMON_BMCR_BENBMP_POS       (20U)
#define HRPWM_COMMON_BMCR_BENBMP           (0x00100000UL)
#define HRPWM_COMMON_BMCR_BMMD_POS         (21U)
#define HRPWM_COMMON_BMCR_BMMD             (0x00200000UL)
#define HRPWM_COMMON_BMCR_BMTMR7_POS       (24U)
#define HRPWM_COMMON_BMCR_BMTMR7           (0x01000000UL)
#define HRPWM_COMMON_BMCR_BMTMR8_POS       (25U)
#define HRPWM_COMMON_BMCR_BMTMR8           (0x02000000UL)
#define HRPWM_COMMON_BMCR_BMCMPHDCTLEN_POS (31U)
#define HRPWM_COMMON_BMCR_BMCMPHDCTLEN     (0x80000000UL)

/* Bit definition for HRPWM_COMMON_BMSTRG1 register */
#define HRPWM_COMMON_BMSTRG1_SSTRG_POS     (0U)
#define HRPWM_COMMON_BMSTRG1_SSTRG         (0x00000001UL)
#define HRPWM_COMMON_BMSTRG1_OVF1_POS      (1U)
#define HRPWM_COMMON_BMSTRG1_OVF1          (0x00000002UL)
#define HRPWM_COMMON_BMSTRG1_UDF1_POS      (2U)
#define HRPWM_COMMON_BMSTRG1_UDF1          (0x00000004UL)
#define HRPWM_COMMON_BMSTRG1_GCMA1_POS     (3U)
#define HRPWM_COMMON_BMSTRG1_GCMA1         (0x00000008UL)
#define HRPWM_COMMON_BMSTRG1_GCMB1_POS     (4U)
#define HRPWM_COMMON_BMSTRG1_GCMB1         (0x00000010UL)
#define HRPWM_COMMON_BMSTRG1_OVF2_POS      (5U)
#define HRPWM_COMMON_BMSTRG1_OVF2          (0x00000020UL)
#define HRPWM_COMMON_BMSTRG1_UDF2_POS      (6U)
#define HRPWM_COMMON_BMSTRG1_UDF2          (0x00000040UL)
#define HRPWM_COMMON_BMSTRG1_GCMA2_POS     (7U)
#define HRPWM_COMMON_BMSTRG1_GCMA2         (0x00000080UL)
#define HRPWM_COMMON_BMSTRG1_GCMB2_POS     (8U)
#define HRPWM_COMMON_BMSTRG1_GCMB2         (0x00000100UL)
#define HRPWM_COMMON_BMSTRG1_OVF3_POS      (9U)
#define HRPWM_COMMON_BMSTRG1_OVF3          (0x00000200UL)
#define HRPWM_COMMON_BMSTRG1_UDF3_POS      (10U)
#define HRPWM_COMMON_BMSTRG1_UDF3          (0x00000400UL)
#define HRPWM_COMMON_BMSTRG1_GCMA3_POS     (11U)
#define HRPWM_COMMON_BMSTRG1_GCMA3         (0x00000800UL)
#define HRPWM_COMMON_BMSTRG1_GCMB3_POS     (12U)
#define HRPWM_COMMON_BMSTRG1_GCMB3         (0x00001000UL)
#define HRPWM_COMMON_BMSTRG1_OVF4_POS      (13U)
#define HRPWM_COMMON_BMSTRG1_OVF4          (0x00002000UL)
#define HRPWM_COMMON_BMSTRG1_UDF4_POS      (14U)
#define HRPWM_COMMON_BMSTRG1_UDF4          (0x00004000UL)
#define HRPWM_COMMON_BMSTRG1_GCMA4_POS     (15U)
#define HRPWM_COMMON_BMSTRG1_GCMA4         (0x00008000UL)
#define HRPWM_COMMON_BMSTRG1_GCMB4_POS     (16U)
#define HRPWM_COMMON_BMSTRG1_GCMB4         (0x00010000UL)
#define HRPWM_COMMON_BMSTRG1_OVF5_POS      (17U)
#define HRPWM_COMMON_BMSTRG1_OVF5          (0x00020000UL)
#define HRPWM_COMMON_BMSTRG1_UDF5_POS      (18U)
#define HRPWM_COMMON_BMSTRG1_UDF5          (0x00040000UL)
#define HRPWM_COMMON_BMSTRG1_GCMA5_POS     (19U)
#define HRPWM_COMMON_BMSTRG1_GCMA5         (0x00080000UL)
#define HRPWM_COMMON_BMSTRG1_GCMB5_POS     (20U)
#define HRPWM_COMMON_BMSTRG1_GCMB5         (0x00100000UL)
#define HRPWM_COMMON_BMSTRG1_OVF6_POS      (21U)
#define HRPWM_COMMON_BMSTRG1_OVF6          (0x00200000UL)
#define HRPWM_COMMON_BMSTRG1_UDF6_POS      (22U)
#define HRPWM_COMMON_BMSTRG1_UDF6          (0x00400000UL)
#define HRPWM_COMMON_BMSTRG1_GCMA6_POS     (23U)
#define HRPWM_COMMON_BMSTRG1_GCMA6         (0x00800000UL)
#define HRPWM_COMMON_BMSTRG1_GCMB6_POS     (24U)
#define HRPWM_COMMON_BMSTRG1_GCMB6         (0x01000000UL)
#define HRPWM_COMMON_BMSTRG1_T1OVFEEV7_POS (25U)
#define HRPWM_COMMON_BMSTRG1_T1OVFEEV7     (0x02000000UL)
#define HRPWM_COMMON_BMSTRG1_T1UDFEEV7_POS (26U)
#define HRPWM_COMMON_BMSTRG1_T1UDFEEV7     (0x04000000UL)
#define HRPWM_COMMON_BMSTRG1_T4OVFEEV8_POS (27U)
#define HRPWM_COMMON_BMSTRG1_T4OVFEEV8     (0x08000000UL)
#define HRPWM_COMMON_BMSTRG1_T4UDFEEV8_POS (28U)
#define HRPWM_COMMON_BMSTRG1_T4UDFEEV8     (0x10000000UL)
#define HRPWM_COMMON_BMSTRG1_EEV7_POS      (29U)
#define HRPWM_COMMON_BMSTRG1_EEV7          (0x20000000UL)
#define HRPWM_COMMON_BMSTRG1_EEV8_POS      (30U)
#define HRPWM_COMMON_BMSTRG1_EEV8          (0x40000000UL)

/* Bit definition for HRPWM_COMMON_BMSTRG2 register */
#define HRPWM_COMMON_BMSTRG2_IEV0_POS  (0U)
#define HRPWM_COMMON_BMSTRG2_IEV0      (0x00000001UL)
#define HRPWM_COMMON_BMSTRG2_IEV1_POS  (1U)
#define HRPWM_COMMON_BMSTRG2_IEV1      (0x00000002UL)
#define HRPWM_COMMON_BMSTRG2_IEV2_POS  (2U)
#define HRPWM_COMMON_BMSTRG2_IEV2      (0x00000004UL)
#define HRPWM_COMMON_BMSTRG2_IEV3_POS  (3U)
#define HRPWM_COMMON_BMSTRG2_IEV3      (0x00000008UL)
#define HRPWM_COMMON_BMSTRG2_OVF7_POS  (16U)
#define HRPWM_COMMON_BMSTRG2_OVF7      (0x00010000UL)
#define HRPWM_COMMON_BMSTRG2_UDF7_POS  (17U)
#define HRPWM_COMMON_BMSTRG2_UDF7      (0x00020000UL)
#define HRPWM_COMMON_BMSTRG2_GCMA7_POS (18U)
#define HRPWM_COMMON_BMSTRG2_GCMA7     (0x00040000UL)
#define HRPWM_COMMON_BMSTRG2_GCMB7_POS (19U)
#define HRPWM_COMMON_BMSTRG2_GCMB7     (0x00080000UL)
#define HRPWM_COMMON_BMSTRG2_OVF8_POS  (20U)
#define HRPWM_COMMON_BMSTRG2_OVF8      (0x00100000UL)
#define HRPWM_COMMON_BMSTRG2_UDF8_POS  (21U)
#define HRPWM_COMMON_BMSTRG2_UDF8      (0x00200000UL)
#define HRPWM_COMMON_BMSTRG2_GCMA8_POS (22U)
#define HRPWM_COMMON_BMSTRG2_GCMA8     (0x00400000UL)
#define HRPWM_COMMON_BMSTRG2_GCMB8_POS (23U)
#define HRPWM_COMMON_BMSTRG2_GCMB8     (0x00800000UL)

/* Bit definition for HRPWM_COMMON_BMPERAR register */
#define HRPWM_COMMON_BMPERAR_BMPERAR (0x0000FFFFUL)

