MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_COMMON_BMPERBR register */
#define HRPWM_COMMON_BMPERBR_BMPERBR (0x0000FFFFUL)

/* Bit definition for HRPWM_COMMON_BMCMAR register */
#define HRPWM_COMMON_BMCMAR_BMCMAR (0x0000FFFFUL)

/* Bit definition for HRPWM_COMMON_BMCMBR register */
#define HRPWM_COMMON_BMCMBR_BMCMBR (0x0000FFFFUL)

/* Bit definition for HRPWM_COMMON_EECR1 register */
#define HRPWM_COMMON_EECR1_EE1SRC_POS  (0U)
#define HRPWM_COMMON_EECR1_EE1SRC      (0x00000003UL)
#define HRPWM_COMMON_EECR1_EE1SRC_0    (0x00000001UL)
#define HRPWM_COMMON_EECR1_EE1SRC_1    (0x00000002UL)
#define HRPWM_COMMON_EECR1_EE1POL_POS  (2U)
#define HRPWM_COMMON_EECR1_EE1POL      (0x00000004UL)
#define HRPWM_COMMON_EECR1_EE1SNS_POS  (3U)
#define HRPWM_COMMON_EECR1_EE1SNS      (0x00000018UL)
#define HRPWM_COMMON_EECR1_EE1SNS_0    (0x00000008UL)
#define HRPWM_COMMON_EECR1_EE1SNS_1    (0x00000010UL)
#define HRPWM_COMMON_EECR1_EE1FAST_POS (5U)
#define HRPWM_COMMON_EECR1_EE1FAST     (0x00000020UL)
#define HRPWM_COMMON_EECR1_EE2SRC_POS  (6U)
#define HRPWM_COMMON_EECR1_EE2SRC      (0x000000C0UL)
#define HRPWM_COMMON_EECR1_EE2SRC_0    (0x00000040UL)
#define HRPWM_COMMON_EECR1_EE2SRC_1    (0x00000080UL)
#define HRPWM_COMMON_EECR1_EE2POL_POS  (8U)
#define HRPWM_COMMON_EECR1_EE2POL      (0x00000100UL)
#define HRPWM_COMMON_EECR1_EE2SNS_POS  (9U)
#define HRPWM_COMMON_EECR1_EE2SNS      (0x00000600UL)
#define HRPWM_COMMON_EECR1_EE2SNS_0    (0x00000200UL)
#define HRPWM_COMMON_EECR1_EE2SNS_1    (0x00000400UL)
#define HRPWM_COMMON_EECR1_EE2FAST_POS (11U)
#define HRPWM_COMMON_EECR1_EE2FAST     (0x00000800UL)
#define HRPWM_COMMON_EECR1_EE3SRC_POS  (12U)
#define HRPWM_COMMON_EECR1_EE3SRC      (0x00003000UL)
#define HRPWM_COMMON_EECR1_EE3SRC_0    (0x00001000UL)
#define HRPWM_COMMON_EECR1_EE3SRC_1    (0x00002000UL)
#define HRPWM_COMMON_EECR1_EE3POL_POS  (14U)
#define HRPWM_COMMON_EECR1_EE3POL      (0x00004000UL)
#define HRPWM_COMMON_EECR1_EE3SNS_POS  (15U)
#define HRPWM_COMMON_EECR1_EE3SNS      (0x00018000UL)
#define HRPWM_COMMON_EECR1_EE3SNS_0    (0x00008000UL)
#define HRPWM_COMMON_EECR1_EE3SNS_1    (0x00010000UL)
#define HRPWM_COMMON_EECR1_EE3FAST_POS (17U)
#define HRPWM_COMMON_EECR1_EE3FAST     (0x00020000UL)
#define HRPWM_COMMON_EECR1_EE4SRC_POS  (18U)
#define HRPWM_COMMON_EECR1_EE4SRC      (0x000C0000UL)
#define HRPWM_COMMON_EECR1_EE4SRC_0    (0x00040000UL)
#define HRPWM_COMMON_EECR1_EE4SRC_1    (0x00080000UL)
#define HRPWM_COMMON_EECR1_EE4POL_POS  (20U)
#define HRPWM_COMMON_EECR1_EE4POL      (0x00100000UL)
#define HRPWM_COMMON_EECR1_EE4SNS_POS  (21U)
#define HRPWM_COMMON_EECR1_EE4SNS      (0x00600000UL)
#define HRPWM_COMMON_EECR1_EE4SNS_0    (0x00200000UL)
#define HRPWM_COMMON_EECR1_EE4SNS_1    (0x00400000UL)
#define HRPWM_COMMON_EECR1_EE4FAST_POS (23U)
#define HRPWM_COMMON_EECR1_EE4FAST     (0x00800000UL)
#define HRPWM_COMMON_EECR1_EE5SRC_POS  (24U)
#define HRPWM_COMMON_EECR1_EE5SRC      (0x03000000UL)
#define HRPWM_COMMON_EECR1_EE5SRC_0    (0x01000000UL)
#define HRPWM_COMMON_EECR1_EE5SRC_1    (0x02000000UL)
#define HRPWM_COMMON_EECR1_EE5POL_POS  (26U)
#define HRPWM_COMMON_EECR1_EE5POL      (0x04000000UL)
#define HRPWM_COMMON_EECR1_EE5SNS_POS  (27U)
#define HRPWM_COMMON_EECR1_EE5SNS      (0x18000000UL)
#define HRPWM_COMMON_EECR1_EE5SNS_0    (0x08000000UL)
#define HRPWM_COMMON_EECR1_EE5SNS_1    (0x10000000UL)
#define HRPWM_COMMON_EECR1_EE5FAST_POS (29U)
#define HRPWM_COMMON_EECR1_EE5FAST     (0x20000000UL)

/* Bit definition for HRPWM_COMMON_EECR2 register */
#define HRPWM_COMMON_EECR2_EE6SRC_POS  (0U)
#define HRPWM_COMMON_EECR2_EE6SRC      (0x00000003UL)
#define HRPWM_COMMON_EECR2_EE6SRC_0    (0x00000001UL)
#define HRPWM_COMMON_EECR2_EE6SRC_1    (0x00000002UL)
#define HRPWM_COMMON_EECR2_EE6POL_POS  (2U)
#define HRPWM_COMMON_EECR2_EE6POL      (0x00000004UL)
#define HRPWM_COMMON_EECR2_EE6SNS_POS  (3U)
#define HRPWM_COMMON_EECR2_EE6SNS      (0x00000018UL)
#define HRPWM_COMMON_EECR2_EE6SNS_0    (0x00000008UL)
#define HRPWM_COMMON_EECR2_EE6SNS_1    (0x00000010UL)
#define HRPWM_COMMON_EECR2_EE7SRC_POS  (6U)
#define HRPWM_COMMON_EECR2_EE7SRC      (0x000000C0UL)
#define HRPWM_COMMON_EECR2_EE7SRC_0    (0x00000040UL)
#define HRPWM_COMMON_EECR2_EE7SRC_1    (0x00000080UL)
#define HRPWM_COMMON_EECR2_EE7POL_POS  (8U)
#define HRPWM_COMMON_EECR2_EE7POL      (0x00000100UL)
#define HRPWM_COMMON_EECR2_EE7SNS_POS  (9U)
#define HRPWM_COMMON_EECR2_EE7SNS      (0x00000600UL)
#define HRPWM_COMMON_EECR2_EE7SNS_0    (0x00000200UL)
#define HRPWM_COMMON_EECR2_EE7SNS_1    (0x00000400UL)
#define HRPWM_COMMON_EECR2_EE8SRC_POS  (12U)
#define HRPWM_COMMON_EECR2_EE8SRC      (0x00003000UL)
#define HRPWM_COMMON_EECR2_EE8SRC_0    (0x00001000UL)
#define HRPWM_COMMON_EECR2_EE8SRC_1    (0x00002000UL)
#define HRPWM_COMMON_EECR2_EE8POL_POS  (14U)
#define HRPWM_COMMON_EECR2_EE8POL      (0x00004000UL)
#define HRPWM_COMMON_EECR2_EE8SNS_POS  (15U)
#define HRPWM_COMMON_EECR2_EE8SNS      (0x00018000UL)
#define HRPWM_COMMON_EECR2_EE8SNS_0    (0x00008000UL)
#define HRPWM_COMMON_EECR2_EE8SNS_1    (0x00010000UL)
#define HRPWM_COMMON_EECR2_EE9SRC_POS  (18U)
#define HRPWM_COMMON_EECR2_EE9SRC      (0x000C0000UL)
#define HRPWM_COMMON_EECR2_EE9SRC_0    (0x00040000UL)
#define HRPWM_COMMON_EECR2_EE9SRC_1    (0x00080000UL)
#define HRPWM_COMMON_EECR2_EE9POL_POS  (20U)
#define HRPWM_COMMON_EECR2_EE9POL      (0x00100000UL)
#define HRPWM_COMMON_EECR2_EE9SNS_POS  (21U)
#define HRPWM_COMMON_EECR2_EE9SNS      (0x00600000UL)
#define HRPWM_COMMON_EECR2_EE9SNS_0    (0x00200000UL)
#define HRPWM_COMMON_EECR2_EE9SNS_1    (0x00400000UL)
#define HRPWM_COMMON_EECR2_EE10SRC_POS (24U)
#define HRPWM_COMMON_EECR2_EE10SRC     (0x03000000UL)
#define HRPWM_COMMON_EECR2_EE10SRC_0   (0x01000000UL)
#define HRPWM_COMMON_EECR2_EE10SRC_1   (0x02000000UL)
#define HRPWM_COMMON_EECR2_EE10POL_POS (26U)
#define HRPWM_COMMON_EECR2_EE10POL     (0x04000000UL)
#define HRPWM_COMMON_EECR2_EE10SNS_POS (27U)
#define HRPWM_COMMON_EECR2_EE10SNS     (0x18000000UL)
#define HRPWM_COMMON_EECR2_EE10SNS_0   (0x08000000UL)
#define HRPWM_COMMON_EECR2_EE10SNS_1   (0x10000000UL)

/* Bit definition for HRPWM_COMMON_EECR3 register */
#define HRPWM_COMMON_EECR3_EE6F_POS  (0U)
#define HRPWM_COMMON_EECR3_EE6F      (0x0000000FUL)
#define HRPWM_COMMON_EECR3_EE7F_POS  (6U)
#define HRPWM_COMMON_EECR3_EE7F      (0x000003C0UL)
#define HRPWM_COMMON_EECR3_EE8F_POS  (12U)
#define HRPWM_COMMON_EECR3_EE8F      (0x0000F000UL)
#define HRPWM_COMMON_EECR3_EE9F_POS  (18U)
#define HRPWM_COMMON_EECR3_EE9F      (0x003C0000UL)
#define HRPWM_COMMON_EECR3_EE10F_POS (24U)
#define HRPWM_COMMON_EECR3_EE10F     (0x0F000000UL)
#define HRPWM_COMMON_EECR3_EEVSD_POS (30U)
#define HRPWM_COMMON_EECR3_EEVSD     (0xC0000000UL)
#define HRPWM_COMMON_EECR3_EEVSD_0   (0x40000000UL)
#define HRPWM_COMMON_EECR3_EEVSD_1   (0x80000000UL)

/* Bit definition for HRPWM_COMMON_SYNOCR register */
#define HRPWM_COMMON_SYNOCR_SYNCSRC_POS (0U)
#define HRPWM_COMMON_SYNOCR_SYNCSRC     (0x0000000FUL)
#define HRPWM_COMMON_SYNOCR_SYNOPLS_POS (4U)
#define HRPWM_COMMON_SYNOCR_SYNOPLS     (0x00000030UL)
#define HRPWM_COMMON_SYNOCR_SYNOPLS_0   (0x00000010UL)
#define HRPWM_COMMON_SYNOCR_SYNOPLS_1   (0x00000020UL)
#define HRPWM_COMMON_SYNOCR_SRCDIR_POS  (6U)
#define HRPWM_COMMON_SYNOCR_SRCDIR      (0x00000040UL)
#define HRPWM_COMMON_SYNOCR_SYNCMP_POS  (8U)
#define HRPWM_COMMON_SYNOCR_SYNCMP      (0x0000FF00UL)

/* Bit definition for HRPWM_COMMON_FCNTR register */
#define HRPWM_COMMON_FCNTR_NOFIENTA_POS (0U)
#define HRPWM_COMMON_FCNTR_NOFIENTA     (0x00000001UL)
#define HRPWM_COMMON_FCNTR_NOFICKTA_POS (1U)
#define HRPWM_COMMON_FCNTR_NOFICKTA     (0x00000006UL)
#define HRPWM_COMMON_FCNTR_NOFICKTA_0   (0x00000002UL)
#define HRPWM_COMMON_FCNTR_NOFICKTA_1   (0x00000004UL)
#define HRPWM_COMMON_FCNTR_NOFIENTB_POS (4U)
#define HRPWM_COMMON_FCNTR_NOFIENTB     (0x00000010UL)
#define HRPWM_COMMON_FCNTR_NOFICKTB_POS (5U)
#define HRPWM_COMMON_FCNTR_NOFICKTB     (0x00000060UL)
#define HRPWM_COMMON_FCNTR_NOFICKTB_0   (0x00000020UL)
#define HRPWM_COMMON_FCNTR_NOFICKTB_1   (0x00000040UL)
#define HRPWM_COMMON_FCNTR_NOFIENTC_POS (8U)
#define HRPWM_COMMON_FCNTR_NOFIENTC     (0x00000100UL)
#define HRPWM_COMMON_FCNTR_NOFICKTC_POS (9U)
#define HRPWM_COMMON_FCNTR_NOFICKTC     (0x00000600UL)
#define HRPWM_COMMON_FCNTR_NOFICKTC_0   (0x00000200UL)
#define HRPWM_COMMON_FCNTR_NOFICKTC_1   (0x00000400UL)
#define HRPWM_COMMON_FCNTR_NOFIENTD_POS (12U)
#define HRPWM_COMMON_FCNTR_NOFIENTD     (0x00001000UL)
#define HRPWM_COMMON_FCNTR_NOFICKTD_POS (13U)
#define HRPWM_COMMON_FCNTR_NOFICKTD     (0x00006000UL)
#define HRPWM_COMMON_FCNTR_NOFICKTD_0   (0x00002000UL)
#define HRPWM_COMMON_FCNTR_NOFICKTD_1   (0x00004000UL)

/* Bit definition for HRPWM_COMMON_SSTAR register */
#define HRPWM_COMMON_SSTAR_SSTA1_POS (0U)
#define HRPWM_COMMON_SSTAR_SSTA1     (0x00000001UL)
#define HRPWM_COMMON_SSTAR_SSTA2_POS (1U)
#define HRPWM_COMMON_SSTAR_SSTA2     (0x00000002UL)
#define HRPWM_COMMON_SSTAR_SSTA3_POS (2U)
#define HRPWM_COMMON_SSTAR_SSTA3     (0x00000004UL)
#define HRPWM_COMMON_SSTAR_SSTA4_POS (3U)
#define HRPWM_COMMON_SSTAR_SSTA4     (0x00000008UL)
#define HRPWM_COMMON_SSTAR_SSTA5_POS (4U)
#define HRPWM_COMMON_SSTAR_SSTA5     (0x00000010UL)
#define HRPWM_COMMON_SSTAR_SSTA6_POS (5U)
#define HRPWM_COMMON_SSTAR_SSTA6     (0x00000020UL)
#define HRPWM_COMMON_SSTAR_SSTA7_POS (6U)
#define HRPWM_COMMON_SSTAR_SSTA7     (0x00000040UL)
#define HRPWM_COMMON_SSTAR_SSTA8_POS (7U)
#define HRPWM_COMMON_SSTAR_SSTA8     (0x00000080UL)

/* Bit definition for HRPWM_COMMON_SSTPR register */
#define HRPWM_COMMON_SSTPR_SSTP1_POS (0U)
#define HRPWM_COMMON_SSTPR_SSTP1     (0x00000001UL)
#define HRPWM_COMMON_SSTPR_SSTP2_POS (1U)
#define HRPWM_COMMON_SSTPR_SSTP2     (0x00000002UL)
#define HRPWM_COMMON_SSTPR_SSTP3_POS (2U)
#define HRPWM_COMMON_SSTPR_SSTP3     (0x00000004UL)
#define HRPWM_COMMON_SSTPR_SSTP4_POS (3U)
#define HRPWM_COMMON_SSTPR_SSTP4     (0x00000008UL)
#define HRPWM_COMMON_SSTPR_SSTP5_POS (4U)
#define HRPWM_COMMON_SSTPR_SSTP5     (0x00000010UL)
#define HRPWM_COMMON_SSTPR_SSTP6_POS (5U)
#define HRPWM_COMMON_SSTPR_SSTP6     (0x00000020UL)
#define HRPWM_COMMON_SSTPR_SSTP7_POS (6U)
#define HRPWM_COMMON_SSTPR_SSTP7     (0x00000040UL)
#define HRPWM_COMMON_SSTPR_SSTP8_POS (7U)
#define HRPWM_COMMON_SSTPR_SSTP8     (0x00000080UL)

