MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_COMMON_SCLRR register */
#define HRPWM_COMMON_SCLRR_SCLE1_POS (0U)
#define HRPWM_COMMON_SCLRR_SCLE1     (0x00000001UL)
#define HRPWM_COMMON_SCLRR_SCLE2_POS (1U)
#define HRPWM_COMMON_SCLRR_SCLE2     (0x00000002UL)
#define HRPWM_COMMON_SCLRR_SCLE3_POS (2U)
#define HRPWM_COMMON_SCLRR_SCLE3     (0x00000004UL)
#define HRPWM_COMMON_SCLRR_SCLE4_POS (3U)
#define HRPWM_COMMON_SCLRR_SCLE4     (0x00000008UL)
#define HRPWM_COMMON_SCLRR_SCLE5_POS (4U)
#define HRPWM_COMMON_SCLRR_SCLE5     (0x00000010UL)
#define HRPWM_COMMON_SCLRR_SCLE6_POS (5U)
#define HRPWM_COMMON_SCLRR_SCLE6     (0x00000020UL)
#define HRPWM_COMMON_SCLRR_SCLE7_POS (6U)
#define HRPWM_COMMON_SCLRR_SCLE7     (0x00000040UL)
#define HRPWM_COMMON_SCLRR_SCLE8_POS (7U)
#define HRPWM_COMMON_SCLRR_SCLE8     (0x00000080UL)

/* Bit definition for HRPWM_COMMON_SUPDR register */
#define HRPWM_COMMON_SUPDR_SUPD1_POS (0U)
#define HRPWM_COMMON_SUPDR_SUPD1     (0x00000001UL)
#define HRPWM_COMMON_SUPDR_SUPD2_POS (1U)
#define HRPWM_COMMON_SUPDR_SUPD2     (0x00000002UL)
#define HRPWM_COMMON_SUPDR_SUPD3_POS (2U)
#define HRPWM_COMMON_SUPDR_SUPD3     (0x00000004UL)
#define HRPWM_COMMON_SUPDR_SUPD4_POS (3U)
#define HRPWM_COMMON_SUPDR_SUPD4     (0x00000008UL)
#define HRPWM_COMMON_SUPDR_SUPD5_POS (4U)
#define HRPWM_COMMON_SUPDR_SUPD5     (0x00000010UL)
#define HRPWM_COMMON_SUPDR_SUPD6_POS (5U)
#define HRPWM_COMMON_SUPDR_SUPD6     (0x00000020UL)
#define HRPWM_COMMON_SUPDR_SUPD7_POS (6U)
#define HRPWM_COMMON_SUPDR_SUPD7     (0x00000040UL)
#define HRPWM_COMMON_SUPDR_SUPD8_POS (7U)
#define HRPWM_COMMON_SUPDR_SUPD8     (0x00000080UL)

/* Bit definition for HRPWM_COMMON_BDUPR1 register */
#define HRPWM_COMMON_BDUPR1_CNTER_POS       (0U)
#define HRPWM_COMMON_BDUPR1_CNTER           (0x00000001UL)
#define HRPWM_COMMON_BDUPR1_UPDAR_POS       (1U)
#define HRPWM_COMMON_BDUPR1_UPDAR           (0x00000002UL)
#define HRPWM_COMMON_BDUPR1_HRPERAR_POS     (4U)
#define HRPWM_COMMON_BDUPR1_HRPERAR         (0x00000010UL)
#define HRPWM_COMMON_BDUPR1_HRGCMAR_POS     (5U)
#define HRPWM_COMMON_BDUPR1_HRGCMAR         (0x00000020UL)
#define HRPWM_COMMON_BDUPR1_HRGCMBR_POS     (6U)
#define HRPWM_COMMON_BDUPR1_HRGCMBR         (0x00000040UL)
#define HRPWM_COMMON_BDUPR1_HRGCMER_POS     (7U)
#define HRPWM_COMMON_BDUPR1_HRGCMER         (0x00000080UL)
#define HRPWM_COMMON_BDUPR1_HRGCMFR_POS     (8U)
#define HRPWM_COMMON_BDUPR1_HRGCMFR         (0x00000100UL)
#define HRPWM_COMMON_BDUPR1_SCMAR_POS       (9U)
#define HRPWM_COMMON_BDUPR1_SCMAR           (0x00000200UL)
#define HRPWM_COMMON_BDUPR1_SCMBR_POS       (10U)
#define HRPWM_COMMON_BDUPR1_SCMBR           (0x00000400UL)
#define HRPWM_COMMON_BDUPR1_HRDTDAR_POS     (11U)
#define HRPWM_COMMON_BDUPR1_HRDTDAR         (0x00000800UL)
#define HRPWM_COMMON_BDUPR1_HRDTUAR_POS     (12U)
#define HRPWM_COMMON_BDUPR1_HRDTUAR         (0x00001000UL)
#define HRPWM_COMMON_BDUPR1_EEOFSETAR_POS   (13U)
#define HRPWM_COMMON_BDUPR1_EEOFSETAR       (0x00002000UL)
#define HRPWM_COMMON_BDUPR1_EEWINAR_POS     (14U)
#define HRPWM_COMMON_BDUPR1_EEWINAR         (0x00004000UL)
#define HRPWM_COMMON_BDUPR1_VPERR_POS       (15U)
#define HRPWM_COMMON_BDUPR1_VPERR           (0x00008000UL)
#define HRPWM_COMMON_BDUPR1_PCNAR1_POS      (16U)
#define HRPWM_COMMON_BDUPR1_PCNAR1          (0x00010000UL)
#define HRPWM_COMMON_BDUPR1_PCNAR2_POS      (17U)
#define HRPWM_COMMON_BDUPR1_PCNAR2          (0x00020000UL)
#define HRPWM_COMMON_BDUPR1_PCNAR3_POS      (18U)
#define HRPWM_COMMON_BDUPR1_PCNAR3          (0x00040000UL)
#define HRPWM_COMMON_BDUPR1_PCNAR4_POS      (19U)
#define HRPWM_COMMON_BDUPR1_PCNAR4          (0x00080000UL)
#define HRPWM_COMMON_BDUPR1_PCNAR5_POS      (20U)
#define HRPWM_COMMON_BDUPR1_PCNAR5          (0x00100000UL)
#define HRPWM_COMMON_BDUPR1_PCNBR1_POS      (21U)
#define HRPWM_COMMON_BDUPR1_PCNBR1          (0x00200000UL)
#define HRPWM_COMMON_BDUPR1_PCNBR2_POS      (22U)
#define HRPWM_COMMON_BDUPR1_PCNBR2          (0x00400000UL)
#define HRPWM_COMMON_BDUPR1_PCNBR3_POS      (23U)
#define HRPWM_COMMON_BDUPR1_PCNBR3          (0x00800000UL)
#define HRPWM_COMMON_BDUPR1_PCNBR4_POS      (24U)
#define HRPWM_COMMON_BDUPR1_PCNBR4          (0x01000000UL)
#define HRPWM_COMMON_BDUPR1_PCNBR5_POS      (25U)
#define HRPWM_COMMON_BDUPR1_PCNBR5          (0x02000000UL)
#define HRPWM_COMMON_BDUPR1_ICONR_POS       (26U)
#define HRPWM_COMMON_BDUPR1_ICONR           (0x04000000UL)
#define HRPWM_COMMON_BDUPR1_AOSEOUTSELR_POS (27U)
#define HRPWM_COMMON_BDUPR1_AOSEOUTSELR     (0x08000000UL)
#define HRPWM_COMMON_BDUPR1_DCONR_POS       (28U)
#define HRPWM_COMMON_BDUPR1_DCONR           (0x10000000UL)
#define HRPWM_COMMON_BDUPR1_GCONR1_POS      (29U)
#define HRPWM_COMMON_BDUPR1_GCONR1          (0x20000000UL)
#define HRPWM_COMMON_BDUPR1_GCONR_POS       (30U)
#define HRPWM_COMMON_BDUPR1_GCONR           (0x40000000UL)
#define HRPWM_COMMON_BDUPR1_BCONR1_POS      (31U)
#define HRPWM_COMMON_BDUPR1_BCONR1          (0x80000000UL)

/* Bit definition for HRPWM_COMMON_BDUPR2 register */
#define HRPWM_COMMON_BDUPR2_BCONR2_POS   (0U)
#define HRPWM_COMMON_BDUPR2_BCONR2       (0x00000001UL)
#define HRPWM_COMMON_BDUPR2_GBCR_POS     (1U)
#define HRPWM_COMMON_BDUPR2_GBCR         (0x00000002UL)
#define HRPWM_COMMON_BDUPR2_GBCFG_POS    (2U)
#define HRPWM_COMMON_BDUPR2_GBCFG        (0x00000004UL)
#define HRPWM_COMMON_BDUPR2_IDLECR_POS   (3U)
#define HRPWM_COMMON_BDUPR2_IDLECR       (0x00000008UL)
#define HRPWM_COMMON_BDUPR2_CHPCR_POS    (4U)
#define HRPWM_COMMON_BDUPR2_CHPCR        (0x00000010UL)
#define HRPWM_COMMON_BDUPR2_HASTR1_POS   (5U)
#define HRPWM_COMMON_BDUPR2_HASTR1       (0x00000020UL)
#define HRPWM_COMMON_BDUPR2_HASTR2_POS   (6U)
#define HRPWM_COMMON_BDUPR2_HASTR2       (0x00000040UL)
#define HRPWM_COMMON_BDUPR2_HCLR1_POS    (7U)
#define HRPWM_COMMON_BDUPR2_HCLR1        (0x00000080UL)
#define HRPWM_COMMON_BDUPR2_HCLR2_POS    (8U)
#define HRPWM_COMMON_BDUPR2_HCLR2        (0x00000100UL)
#define HRPWM_COMMON_BDUPR2_EEFLTR1_POS  (9U)
#define HRPWM_COMMON_BDUPR2_EEFLTR1      (0x00000200UL)
#define HRPWM_COMMON_BDUPR2_EEFLTR2_POS  (10U)
#define HRPWM_COMMON_BDUPR2_EEFLTR2      (0x00000400UL)
#define HRPWM_COMMON_BDUPR2_EEFLTR3_POS  (11U)
#define HRPWM_COMMON_BDUPR2_EEFLTR3      (0x00000800UL)
#define HRPWM_COMMON_BDUPR2_LINCR1_POS   (12U)
#define HRPWM_COMMON_BDUPR2_LINCR1       (0x00001000UL)
#define HRPWM_COMMON_BDUPR2_CR_POS       (13U)
#define HRPWM_COMMON_BDUPR2_CR           (0x00002000UL)
#define HRPWM_COMMON_BDUPR2_PHSCTL_POS   (14U)
#define HRPWM_COMMON_BDUPR2_PHSCTL       (0x00004000UL)
#define HRPWM_COMMON_BDUPR2_LINCR2_POS   (15U)
#define HRPWM_COMMON_BDUPR2_LINCR2       (0x00008000UL)
#define HRPWM_COMMON_BDUPR2_PHSCMP1A_POS (16U)
#define HRPWM_COMMON_BDUPR2_PHSCMP1A     (0x00010000UL)
#define HRPWM_COMMON_BDUPR2_PHSCMP2A_POS (17U)
#define HRPWM_COMMON_BDUPR2_PHSCMP2A     (0x00020000UL)
#define HRPWM_COMMON_BDUPR2_PHSCMP3A_POS (18U)
#define HRPWM_COMMON_BDUPR2_PHSCMP3A     (0x00040000UL)
#define HRPWM_COMMON_BDUPR2_PHSCMP4A_POS (19U)
#define HRPWM_COMMON_BDUPR2_PHSCMP4A     (0x00080000UL)
#define HRPWM_COMMON_BDUPR2_PHSCMP5A_POS (20U)
#define HRPWM_COMMON_BDUPR2_PHSCMP5A     (0x00100000UL)
#define HRPWM_COMMON_BDUPR2_PHSCMP6A_POS (21U)
#define HRPWM_COMMON_BDUPR2_PHSCMP6A     (0x00200000UL)
#define HRPWM_COMMON_BDUPR2_PHSCMP7A_POS (22U)
#define HRPWM_COMMON_BDUPR2_PHSCMP7A     (0x00400000UL)

/* Bit definition for HRPWM_COMMON_BDMADR register */
#define HRPWM_COMMON_BDMADR (0xFFFFFFFFUL)

