MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral HRPWM_EMB
 *******************************************************************************/
/* Bit definition for HRPWM_EMB_CTL1 register */
#define HRPWM_EMB_CTL1_SYSEN_POS       (1U)
#define HRPWM_EMB_CTL1_SYSEN           (0x00000002UL)
#define HRPWM_EMB_CTL1_PWMSEN0_POS     (5U)
#define HRPWM_EMB_CTL1_PWMSEN0         (0x00000020UL)
#define HRPWM_EMB_CTL1_PWMSEN1_POS     (6U)
#define HRPWM_EMB_CTL1_PWMSEN1         (0x00000040UL)
#define HRPWM_EMB_CTL1_PWMSEN2_POS     (7U)
#define HRPWM_EMB_CTL1_PWMSEN2         (0x00000080UL)
#define HRPWM_EMB_CTL1_PWMSEN3_POS     (8U)
#define HRPWM_EMB_CTL1_PWMSEN3         (0x00000100UL)
#define HRPWM_EMB_CTL1_PWMSEN4_POS     (9U)
#define HRPWM_EMB_CTL1_PWMSEN4         (0x00000200UL)
#define HRPWM_EMB_CTL1_PWMSEN5_POS     (10U)
#define HRPWM_EMB_CTL1_PWMSEN5         (0x00000400UL)
#define HRPWM_EMB_CTL1_PWMSEN6_POS     (11U)
#define HRPWM_EMB_CTL1_PWMSEN6         (0x00000800UL)
#define HRPWM_EMB_CTL1_PWMSEN7_POS     (12U)
#define HRPWM_EMB_CTL1_PWMSEN7         (0x00001000UL)
#define HRPWM_EMB_CTL1_EMBINEN1_POS    (16U)
#define HRPWM_EMB_CTL1_EMBINEN1        (0x00010000UL)
#define HRPWM_EMB_CTL1_EMBINEN2_POS    (17U)
#define HRPWM_EMB_CTL1_EMBINEN2        (0x00020000UL)
#define HRPWM_EMB_CTL1_EMBINEN3_POS    (18U)
#define HRPWM_EMB_CTL1_EMBINEN3        (0x00040000UL)
#define HRPWM_EMB_CTL1_EMBINEN4_POS    (19U)
#define HRPWM_EMB_CTL1_EMBINEN4        (0x00080000UL)
#define HRPWM_EMB_CTL1_EMBINEN5_POS    (20U)
#define HRPWM_EMB_CTL1_EMBINEN5        (0x00100000UL)
#define HRPWM_EMB_CTL1_EMBINEN6_POS    (21U)
#define HRPWM_EMB_CTL1_EMBINEN6        (0x00200000UL)
#define HRPWM_EMB_CTL1_EMBINEN7_POS    (22U)
#define HRPWM_EMB_CTL1_EMBINEN7        (0x00400000UL)
#define HRPWM_EMB_CTL1_EMBINEN8_POS    (23U)
#define HRPWM_EMB_CTL1_EMBINEN8        (0x00800000UL)
#define HRPWM_EMB_CTL1_SYSFAULTEN1_POS (27U)
#define HRPWM_EMB_CTL1_SYSFAULTEN1     (0x08000000UL)
#define HRPWM_EMB_CTL1_SYSFAULTEN2_POS (28U)
#define HRPWM_EMB_CTL1_SYSFAULTEN2     (0x10000000UL)
#define HRPWM_EMB_CTL1_SYSFAULTEN3_POS (29U)
#define HRPWM_EMB_CTL1_SYSFAULTEN3     (0x20000000UL)
#define HRPWM_EMB_CTL1_SYSFAULTEN4_POS (30U)
#define HRPWM_EMB_CTL1_SYSFAULTEN4     (0x40000000UL)
#define HRPWM_EMB_CTL1_SYSFAULTEN5_POS (31U)
#define HRPWM_EMB_CTL1_SYSFAULTEN5     (0x80000000UL)

/* Bit definition for HRPWM_EMB_CTL2 register */
#define HRPWM_EMB_CTL2_PWMLV0_POS  (0U)
#define HRPWM_EMB_CTL2_PWMLV0      (0x00000001UL)
#define HRPWM_EMB_CTL2_PWMLV1_POS  (1U)
#define HRPWM_EMB_CTL2_PWMLV1      (0x00000002UL)
#define HRPWM_EMB_CTL2_PWMLV2_POS  (2U)
#define HRPWM_EMB_CTL2_PWMLV2      (0x00000004UL)
#define HRPWM_EMB_CTL2_PWMLV3_POS  (3U)
#define HRPWM_EMB_CTL2_PWMLV3      (0x00000008UL)
#define HRPWM_EMB_CTL2_PWMLV4_POS  (4U)
#define HRPWM_EMB_CTL2_PWMLV4      (0x00000010UL)
#define HRPWM_EMB_CTL2_PWMLV5_POS  (5U)
#define HRPWM_EMB_CTL2_PWMLV5      (0x00000020UL)
#define HRPWM_EMB_CTL2_PWMLV6_POS  (6U)
#define HRPWM_EMB_CTL2_PWMLV6      (0x00000040UL)
#define HRPWM_EMB_CTL2_PWMLV7_POS  (7U)
#define HRPWM_EMB_CTL2_PWMLV7      (0x00000080UL)
#define HRPWM_EMB_CTL2_INVSEL1_POS (16U)
#define HRPWM_EMB_CTL2_INVSEL1     (0x00010000UL)
#define HRPWM_EMB_CTL2_INVSEL2_POS (17U)
#define HRPWM_EMB_CTL2_INVSEL2     (0x00020000UL)
#define HRPWM_EMB_CTL2_INVSEL3_POS (18U)
#define HRPWM_EMB_CTL2_INVSEL3     (0x00040000UL)
#define HRPWM_EMB_CTL2_INVSEL4_POS (19U)
#define HRPWM_EMB_CTL2_INVSEL4     (0x00080000UL)
#define HRPWM_EMB_CTL2_INVSEL5_POS (20U)
#define HRPWM_EMB_CTL2_INVSEL5     (0x00100000UL)
#define HRPWM_EMB_CTL2_INVSEL6_POS (21U)
#define HRPWM_EMB_CTL2_INVSEL6     (0x00200000UL)
#define HRPWM_EMB_CTL2_INVSEL7_POS (22U)
#define HRPWM_EMB_CTL2_INVSEL7     (0x00400000UL)
#define HRPWM_EMB_CTL2_INVSEL8_POS (23U)
#define HRPWM_EMB_CTL2_INVSEL8     (0x00800000UL)
#define HRPWM_EMB_CTL2_NFMD_POS    (31U)
#define HRPWM_EMB_CTL2_NFMD        (0x80000000UL)

/* Bit definition for HRPWM_EMB_SOE register */
#define HRPWM_EMB_SOE_SOE (0x00000001UL)

/* Bit definition for HRPWM_EMB_STAT register */
#define HRPWM_EMB_STAT_PWMSF_POS      (0U)
#define HRPWM_EMB_STAT_PWMSF          (0x00000001UL)
#define HRPWM_EMB_STAT_SYSF_POS       (1U)
#define HRPWM_EMB_STAT_SYSF           (0x00000002UL)
#define HRPWM_EMB_STAT_PWMST_POS      (3U)
#define HRPWM_EMB_STAT_PWMST          (0x00000008UL)
#define HRPWM_EMB_STAT_SYSST_POS      (4U)
#define HRPWM_EMB_STAT_SYSST          (0x00000010UL)
#define HRPWM_EMB_STAT_EMBINF1_POS    (8U)
#define HRPWM_EMB_STAT_EMBINF1        (0x00000100UL)
#define HRPWM_EMB_STAT_EMBINF2_POS    (9U)
#define HRPWM_EMB_STAT_EMBINF2        (0x00000200UL)
#define HRPWM_EMB_STAT_EMBINF3_POS    (10U)
#define HRPWM_EMB_STAT_EMBINF3        (0x00000400UL)
#define HRPWM_EMB_STAT_EMBINF4_POS    (11U)
#define HRPWM_EMB_STAT_EMBINF4        (0x00000800UL)
#define HRPWM_EMB_STAT_EMBINF5_POS    (12U)
#define HRPWM_EMB_STAT_EMBINF5        (0x00001000UL)
#define HRPWM_EMB_STAT_EMBINF6_POS    (13U)
#define HRPWM_EMB_STAT_EMBINF6        (0x00002000UL)
#define HRPWM_EMB_STAT_EMBINF7_POS    (14U)
#define HRPWM_EMB_STAT_EMBINF7        (0x00004000UL)
#define HRPWM_EMB_STAT_EMBINF8_POS    (15U)
#define HRPWM_EMB_STAT_EMBINF8        (0x00008000UL)
#define HRPWM_EMB_STAT_EMBINST1_POS   (17U)
#define HRPWM_EMB_STAT_EMBINST1       (0x00020000UL)
#define HRPWM_EMB_STAT_EMBINST2_POS   (18U)
#define HRPWM_EMB_STAT_EMBINST2       (0x00040000UL)
#define HRPWM_EMB_STAT_EMBINST3_POS   (19U)
#define HRPWM_EMB_STAT_EMBINST3       (0x00080000UL)
#define HRPWM_EMB_STAT_EMBINST4_POS   (20U)
#define HRPWM_EMB_STAT_EMBINST4       (0x00100000UL)
#define HRPWM_EMB_STAT_EMBINST5_POS   (21U)
#define HRPWM_EMB_STAT_EMBINST5       (0x00200000UL)
#define HRPWM_EMB_STAT_EMBINST6_POS   (22U)
#define HRPWM_EMB_STAT_EMBINST6       (0x00400000UL)
#define HRPWM_EMB_STAT_EMBINST7_POS   (23U)
#define HRPWM_EMB_STAT_EMBINST7       (0x00800000UL)
#define HRPWM_EMB_STAT_EMBINST8_POS   (24U)
#define HRPWM_EMB_STAT_EMBINST8       (0x01000000UL)
#define HRPWM_EMB_STAT_SYSFAULTF1_POS (27U)
#define HRPWM_EMB_STAT_SYSFAULTF1     (0x08000000UL)
#define HRPWM_EMB_STAT_SYSFAULTF2_POS (28U)
#define HRPWM_EMB_STAT_SYSFAULTF2     (0x10000000UL)
#define HRPWM_EMB_STAT_SYSFAULTF3_POS (29U)
#define HRPWM_EMB_STAT_SYSFAULTF3     (0x20000000UL)
#define HRPWM_EMB_STAT_SYSFAULTF4_POS (30U)
#define HRPWM_EMB_STAT_SYSFAULTF4     (0x40000000UL)
#define HRPWM_EMB_STAT_SYSFAULTF5_POS (31U)
#define HRPWM_EMB_STAT_SYSFAULTF5     (0x80000000UL)

/* Bit definition for HRPWM_EMB_STATCLR register */
#define HRPWM_EMB_STATCLR_PWMSFCLR_POS      (0U)
#define HRPWM_EMB_STATCLR_PWMSFCLR          (0x00000001UL)
#define HRPWM_EMB_STATCLR_SYSFCLR_POS       (1U)
#define HRPWM_EMB_STATCLR_SYSFCLR           (0x00000002UL)
#define HRPWM_EMB_STATCLR_EMBINFCLR1_POS    (8U)
#define HRPWM_EMB_STATCLR_EMBINFCLR1        (0x00000100UL)
#define HRPWM_EMB_STATCLR_EMBINFCLR2_POS    (9U)
#define HRPWM_EMB_STATCLR_EMBINFCLR2        (0x00000200UL)
#define HRPWM_EMB_STATCLR_EMBINFCLR3_POS    (10U)
#define HRPWM_EMB_STATCLR_EMBINFCLR3        (0x00000400UL)
#define HRPWM_EMB_STATCLR_EMBINFCLR4_POS    (11U)
#define HRPWM_EMB_STATCLR_EMBINFCLR4        (0x00000800UL)
#define HRPWM_EMB_STATCLR_EMBINFCLR5_POS    (12U)
#define HRPWM_EMB_STATCLR_EMBINFCLR5        (0x00001000UL)
#define HRPWM_EMB_STATCLR_EMBINFCLR6_POS    (13U)
#define HRPWM_EMB_STATCLR_EMBINFCLR6        (0x00002000UL)
#define HRPWM_EMB_STATCLR_EMBINFCLR7_POS    (14U)
#define HRPWM_EMB_STATCLR_EMBINFCLR7        (0x00004000UL)
#define HRPWM_EMB_STATCLR_EMBINFCLR8_POS    (15U)
#define HRPWM_EMB_STATCLR_EMBINFCLR8        (0x00008000UL)
#define HRPWM_EMB_STATCLR_SYSFAULTF1CLR_POS (27U)
#define HRPWM_EMB_STATCLR_SYSFAULTF1CLR     (0x08000000UL)
#define HRPWM_EMB_STATCLR_SYSFAULTF2CLR_POS (28U)
#define HRPWM_EMB_STATCLR_SYSFAULTF2CLR     (0x10000000UL)
#define HRPWM_EMB_STATCLR_SYSFAULTF3CLR_POS (29U)
#define HRPWM_EMB_STATCLR_SYSFAULTF3CLR     (0x20000000UL)
#define HRPWM_EMB_STATCLR_SYSFAULTF4CLR_POS (30U)
#define HRPWM_EMB_STATCLR_SYSFAULTF4CLR     (0x40000000UL)
#define HRPWM_EMB_STATCLR_SYSFAULTF5CLR_POS (31U)
#define HRPWM_EMB_STATCLR_SYSFAULTF5CLR     (0x80000000UL)

/* Bit definition for HRPWM_EMB_INTEN register */
#define HRPWM_EMB_INTEN_PWMSINTEN_POS   (0U)
#define HRPWM_EMB_INTEN_PWMSINTEN       (0x00000001UL)
#define HRPWM_EMB_INTEN_SYSINTEN_POS    (1U)
#define HRPWM_EMB_INTEN_SYSINTEN        (0x00000002UL)
#define HRPWM_EMB_INTEN_EMBININTEN1_POS (8U)
#define HRPWM_EMB_INTEN_EMBININTEN1     (0x00000100UL)
#define HRPWM_EMB_INTEN_EMBININTEN2_POS (9U)
#define HRPWM_EMB_INTEN_EMBININTEN2     (0x00000200UL)
#define HRPWM_EMB_INTEN_EMBININTEN3_POS (10U)
#define HRPWM_EMB_INTEN_EMBININTEN3     (0x00000400UL)
#define HRPWM_EMB_INTEN_EMBININTEN4_POS (11U)
#define HRPWM_EMB_INTEN_EMBININTEN4     (0x00000800UL)
#define HRPWM_EMB_INTEN_EMBININTEN5_POS (12U)
#define HRPWM_EMB_INTEN_EMBININTEN5     (0x00001000UL)
#define HRPWM_EMB_INTEN_EMBININTEN6_POS (13U)
#define HRPWM_EMB_INTEN_EMBININTEN6     (0x00002000UL)
#define HRPWM_EMB_INTEN_EMBININTEN7_POS (14U)
#define HRPWM_EMB_INTEN_EMBININTEN7     (0x00004000UL)
#define HRPWM_EMB_INTEN_EMBININTEN8_POS (15U)
#define HRPWM_EMB_INTEN_EMBININTEN8     (0x00008000UL)

