MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for HRPWM_EMB_RLSSEL register */
#define HRPWM_EMB_RLSSEL_PWMRSEL_POS    (0U)
#define HRPWM_EMB_RLSSEL_PWMRSEL        (0x00000001UL)
#define HRPWM_EMB_RLSSEL_SYSRSEL_POS    (1U)
#define HRPWM_EMB_RLSSEL_SYSRSEL        (0x00000002UL)
#define HRPWM_EMB_RLSSEL_EMBINRSEL1_POS (8U)
#define HRPWM_EMB_RLSSEL_EMBINRSEL1     (0x00000100UL)
#define HRPWM_EMB_RLSSEL_EMBINRSEL2_POS (9U)
#define HRPWM_EMB_RLSSEL_EMBINRSEL2     (0x00000200UL)
#define HRPWM_EMB_RLSSEL_EMBINRSEL3_POS (10U)
#define HRPWM_EMB_RLSSEL_EMBINRSEL3     (0x00000400UL)
#define HRPWM_EMB_RLSSEL_EMBINRSEL4_POS (11U)
#define HRPWM_EMB_RLSSEL_EMBINRSEL4     (0x00000800UL)
#define HRPWM_EMB_RLSSEL_EMBINRSEL5_POS (12U)
#define HRPWM_EMB_RLSSEL_EMBINRSEL5     (0x00001000UL)
#define HRPWM_EMB_RLSSEL_EMBINRSEL6_POS (13U)
#define HRPWM_EMB_RLSSEL_EMBINRSEL6     (0x00002000UL)
#define HRPWM_EMB_RLSSEL_EMBINRSEL7_POS (14U)
#define HRPWM_EMB_RLSSEL_EMBINRSEL7     (0x00004000UL)
#define HRPWM_EMB_RLSSEL_EMBINRSEL8_POS (15U)
#define HRPWM_EMB_RLSSEL_EMBINRSEL8     (0x00008000UL)

/* Bit definition for HRPWM_EMB_CTL3 register */
#define HRPWM_EMB_CTL3_NFSEL1_POS (0U)
#define HRPWM_EMB_CTL3_NFSEL1     (0x00000007UL)
#define HRPWM_EMB_CTL3_NFEN1_POS  (3U)
#define HRPWM_EMB_CTL3_NFEN1      (0x00000008UL)
#define HRPWM_EMB_CTL3_NFSEL2_POS (4U)
#define HRPWM_EMB_CTL3_NFSEL2     (0x00000070UL)
#define HRPWM_EMB_CTL3_NFEN2_POS  (7U)
#define HRPWM_EMB_CTL3_NFEN2      (0x00000080UL)
#define HRPWM_EMB_CTL3_NFSEL3_POS (8U)
#define HRPWM_EMB_CTL3_NFSEL3     (0x00000700UL)
#define HRPWM_EMB_CTL3_NFEN3_POS  (11U)
#define HRPWM_EMB_CTL3_NFEN3      (0x00000800UL)
#define HRPWM_EMB_CTL3_NFSEL4_POS (12U)
#define HRPWM_EMB_CTL3_NFSEL4     (0x00007000UL)
#define HRPWM_EMB_CTL3_NFEN4_POS  (15U)
#define HRPWM_EMB_CTL3_NFEN4      (0x00008000UL)
#define HRPWM_EMB_CTL3_NFSEL5_POS (16U)
#define HRPWM_EMB_CTL3_NFSEL5     (0x00070000UL)
#define HRPWM_EMB_CTL3_NFEN5_POS  (19U)
#define HRPWM_EMB_CTL3_NFEN5      (0x00080000UL)
#define HRPWM_EMB_CTL3_NFSEL6_POS (20U)
#define HRPWM_EMB_CTL3_NFSEL6     (0x00700000UL)
#define HRPWM_EMB_CTL3_NFEN6_POS  (23U)
#define HRPWM_EMB_CTL3_NFEN6      (0x00800000UL)
#define HRPWM_EMB_CTL3_NFSEL7_POS (24U)
#define HRPWM_EMB_CTL3_NFSEL7     (0x07000000UL)
#define HRPWM_EMB_CTL3_NFEN7_POS  (27U)
#define HRPWM_EMB_CTL3_NFEN7      (0x08000000UL)
#define HRPWM_EMB_CTL3_NFSEL8_POS (28U)
#define HRPWM_EMB_CTL3_NFSEL8     (0x70000000UL)
#define HRPWM_EMB_CTL3_NFEN8_POS  (31U)
#define HRPWM_EMB_CTL3_NFEN8      (0x80000000UL)

/* Bit definition for HRPWM_EMB_CTL4 register */
#define HRPWM_EMB_CTL4_FBLKE_POS  (28U)
#define HRPWM_EMB_CTL4_FBLKE      (0x10000000UL)
#define HRPWM_EMB_CTL4_FBLKS_POS  (29U)
#define HRPWM_EMB_CTL4_FBLKS      (0x20000000UL)
#define HRPWM_EMB_CTL4_EMBSNS_POS (30U)
#define HRPWM_EMB_CTL4_EMBSNS     (0x40000000UL)

/* Bit definition for HRPWM_EMB_CTL5 register */
#define HRPWM_EMB_CTL5_EMBACNT_POS  (0U)
#define HRPWM_EMB_CTL5_EMBACNT      (0x0000000FUL)
#define HRPWM_EMB_CTL5_EMBCRES_POS  (4U)
#define HRPWM_EMB_CTL5_EMBCRES      (0x00000010UL)
#define HRPWM_EMB_CTL5_EMBARSTM_POS (5U)
#define HRPWM_EMB_CTL5_EMBARSTM     (0x00000020UL)
#define HRPWM_EMB_CTL5_EMBASEL_POS  (8U)
#define HRPWM_EMB_CTL5_EMBASEL      (0x00000F00UL)

/* Bit definition for HRPWM_EMB_CTL6 register */
#define HRPWM_EMB_CTL6_EMBIN1S_POS (0U)
#define HRPWM_EMB_CTL6_EMBIN1S     (0x00000003UL)
#define HRPWM_EMB_CTL6_EMBIN1S_0   (0x00000001UL)
#define HRPWM_EMB_CTL6_EMBIN1S_1   (0x00000002UL)
#define HRPWM_EMB_CTL6_EMBIN2S_POS (3U)
#define HRPWM_EMB_CTL6_EMBIN2S     (0x00000018UL)
#define HRPWM_EMB_CTL6_EMBIN2S_0   (0x00000008UL)
#define HRPWM_EMB_CTL6_EMBIN2S_1   (0x00000010UL)
#define HRPWM_EMB_CTL6_EMBIN3S_POS (6U)
#define HRPWM_EMB_CTL6_EMBIN3S     (0x000000C0UL)
#define HRPWM_EMB_CTL6_EMBIN3S_0   (0x00000040UL)
#define HRPWM_EMB_CTL6_EMBIN3S_1   (0x00000080UL)
#define HRPWM_EMB_CTL6_EMBIN4S_POS (9U)
#define HRPWM_EMB_CTL6_EMBIN4S     (0x00000600UL)
#define HRPWM_EMB_CTL6_EMBIN4S_0   (0x00000200UL)
#define HRPWM_EMB_CTL6_EMBIN4S_1   (0x00000400UL)
#define HRPWM_EMB_CTL6_EMBIN5S_POS (12U)
#define HRPWM_EMB_CTL6_EMBIN5S     (0x00003000UL)
#define HRPWM_EMB_CTL6_EMBIN5S_0   (0x00001000UL)
#define HRPWM_EMB_CTL6_EMBIN5S_1   (0x00002000UL)
#define HRPWM_EMB_CTL6_EMBIN6S_POS (15U)
#define HRPWM_EMB_CTL6_EMBIN6S     (0x00018000UL)
#define HRPWM_EMB_CTL6_EMBIN6S_0   (0x00008000UL)
#define HRPWM_EMB_CTL6_EMBIN6S_1   (0x00010000UL)
#define HRPWM_EMB_CTL6_EMBIN7S_POS (18U)
#define HRPWM_EMB_CTL6_EMBIN7S     (0x000C0000UL)
#define HRPWM_EMB_CTL6_EMBIN7S_0   (0x00040000UL)
#define HRPWM_EMB_CTL6_EMBIN7S_1   (0x00080000UL)
#define HRPWM_EMB_CTL6_EMBIN8S_POS (21U)
#define HRPWM_EMB_CTL6_EMBIN8S     (0x00600000UL)
#define HRPWM_EMB_CTL6_EMBIN8S_0   (0x00200000UL)
#define HRPWM_EMB_CTL6_EMBIN8S_1   (0x00400000UL)

/*******************************************************************************
                Bit definition for Peripheral I2C
 *******************************************************************************/
/* Bit definition for I2C_CR1 register */
#define I2C_CR1_PE_POS           (0U)
#define I2C_CR1_PE               (0x00000001UL)
#define I2C_CR1_SMBUS_POS        (1U)
#define I2C_CR1_SMBUS            (0x00000002UL)
#define I2C_CR1_SMBALRTEN_POS    (2U)
#define I2C_CR1_SMBALRTEN        (0x00000004UL)
#define I2C_CR1_SMBDEFAULTEN_POS (3U)
#define I2C_CR1_SMBDEFAULTEN     (0x00000008UL)
#define I2C_CR1_SMBHOSTEN_POS    (4U)
#define I2C_CR1_SMBHOSTEN        (0x00000010UL)
#define I2C_CR1_SMBALRTPTEN_POS  (5U)
#define I2C_CR1_SMBALRTPTEN      (0x00000020UL)
#define I2C_CR1_GCEN_POS         (6U)
#define I2C_CR1_GCEN             (0x00000040UL)
#define I2C_CR1_RESTART_POS      (7U)
#define I2C_CR1_RESTART          (0x00000080UL)
#define I2C_CR1_START_POS        (8U)
#define I2C_CR1_START            (0x00000100UL)
#define I2C_CR1_STOP_POS         (9U)
#define I2C_CR1_STOP             (0x00000200UL)
#define I2C_CR1_ACK_POS          (10U)
#define I2C_CR1_ACK              (0x00000400UL)
#define I2C_CR1_SWRST_POS        (15U)
#define I2C_CR1_SWRST            (0x00008000UL)

