MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for I2C_CR2 register */
#define I2C_CR2_STARTIE_POS      (0U)
#define I2C_CR2_STARTIE          (0x00000001UL)
#define I2C_CR2_SLADDR0IE_POS    (1U)
#define I2C_CR2_SLADDR0IE        (0x00000002UL)
#define I2C_CR2_SLADDR1IE_POS    (2U)
#define I2C_CR2_SLADDR1IE        (0x00000004UL)
#define I2C_CR2_TENDIE_POS       (3U)
#define I2C_CR2_TENDIE           (0x00000008UL)
#define I2C_CR2_STOPIE_POS       (4U)
#define I2C_CR2_STOPIE           (0x00000010UL)
#define I2C_CR2_RFULLIE_POS      (6U)
#define I2C_CR2_RFULLIE          (0x00000040UL)
#define I2C_CR2_TEMPTYIE_POS     (7U)
#define I2C_CR2_TEMPTYIE         (0x00000080UL)
#define I2C_CR2_SLADDR2IE_POS    (8U)
#define I2C_CR2_SLADDR2IE        (0x00000100UL)
#define I2C_CR2_ARLOIE_POS       (9U)
#define I2C_CR2_ARLOIE           (0x00000200UL)
#define I2C_CR2_RFREQIE_POS      (11U)
#define I2C_CR2_RFREQIE          (0x00000800UL)
#define I2C_CR2_NACKIE_POS       (12U)
#define I2C_CR2_NACKIE           (0x00001000UL)
#define I2C_CR2_PECERRIE_POS     (13U)
#define I2C_CR2_PECERRIE         (0x00002000UL)
#define I2C_CR2_TMOUTIE_POS      (14U)
#define I2C_CR2_TMOUTIE          (0x00004000UL)
#define I2C_CR2_TCIE_POS         (15U)
#define I2C_CR2_TCIE             (0x00008000UL)
#define I2C_CR2_SMBALRTPTIE_POS  (19U)
#define I2C_CR2_SMBALRTPTIE      (0x00080000UL)
#define I2C_CR2_GENCALLIE_POS    (20U)
#define I2C_CR2_GENCALLIE        (0x00100000UL)
#define I2C_CR2_SMBDEFAULTIE_POS (21U)
#define I2C_CR2_SMBDEFAULTIE     (0x00200000UL)
#define I2C_CR2_SMBHOSTIE_POS    (22U)
#define I2C_CR2_SMBHOSTIE        (0x00400000UL)
#define I2C_CR2_SMBALRTIE_POS    (23U)
#define I2C_CR2_SMBALRTIE        (0x00800000UL)

/* Bit definition for I2C_CR3 register */
#define I2C_CR3_TMOUTEN_POS  (0U)
#define I2C_CR3_TMOUTEN      (0x00000001UL)
#define I2C_CR3_LTMOUT_POS   (1U)
#define I2C_CR3_LTMOUT       (0x00000002UL)
#define I2C_CR3_HTMOUT_POS   (2U)
#define I2C_CR3_HTMOUT       (0x00000004UL)
#define I2C_CR3_TEXTEN_POS   (3U)
#define I2C_CR3_TEXTEN       (0x00000008UL)
#define I2C_CR3_TMCKDIV_POS  (4U)
#define I2C_CR3_TMCKDIV      (0x00000070UL)
#define I2C_CR3_FACKEN_POS   (7U)
#define I2C_CR3_FACKEN       (0x00000080UL)
#define I2C_CR3_MRTEICTL_POS (8U)
#define I2C_CR3_MRTEICTL     (0x00000100UL)

/* Bit definition for I2C_CR4 register */
#define I2C_CR4_BUSWAIT_POS       (10U)
#define I2C_CR4_BUSWAIT           (0x00000400UL)
#define I2C_CR4_NACKTRA_CLREN_POS (11U)
#define I2C_CR4_NACKTRA_CLREN     (0x00000800UL)
#define I2C_CR4_BUSFREE_CLREN_POS (12U)
#define I2C_CR4_BUSFREE_CLREN     (0x00001000UL)
#define I2C_CR4_SDADLY_POS        (16U)
#define I2C_CR4_SDADLY            (0x000F0000UL)

/* Bit definition for I2C_SLR0 register */
#define I2C_SLR0_SLADDR0_POS   (0U)
#define I2C_SLR0_SLADDR0       (0x000003FFUL)
#define I2C_SLR0_SLADDR0EN_POS (12U)
#define I2C_SLR0_SLADDR0EN     (0x00001000UL)
#define I2C_SLR0_ADDRMOD0_POS  (15U)
#define I2C_SLR0_ADDRMOD0      (0x00008000UL)
#define I2C_SLR0_MSLADDR0_POS  (16U)
#define I2C_SLR0_MSLADDR0      (0x03FF0000UL)
#define I2C_SLR0_MASK0EN_POS   (26U)
#define I2C_SLR0_MASK0EN       (0x04000000UL)

/* Bit definition for I2C_SLR1 register */
#define I2C_SLR1_SLADDR1_POS   (0U)
#define I2C_SLR1_SLADDR1       (0x000003FFUL)
#define I2C_SLR1_SLADDR1EN_POS (12U)
#define I2C_SLR1_SLADDR1EN     (0x00001000UL)
#define I2C_SLR1_ADDRMOD1_POS  (15U)
#define I2C_SLR1_ADDRMOD1      (0x00008000UL)
#define I2C_SLR1_MSLADDR1_POS  (16U)
#define I2C_SLR1_MSLADDR1      (0x03FF0000UL)
#define I2C_SLR1_MASK1EN_POS   (26U)
#define I2C_SLR1_MASK1EN       (0x04000000UL)

/* Bit definition for I2C_SLTR register */
#define I2C_SLTR_TOUTA_POS (0U)
#define I2C_SLTR_TOUTA     (0x0000FFFFUL)
#define I2C_SLTR_TOUTB_POS (16U)
#define I2C_SLTR_TOUTB     (0xFFFF0000UL)

/* Bit definition for I2C_SR register */
#define I2C_SR_STARTF_POS      (0U)
#define I2C_SR_STARTF          (0x00000001UL)
#define I2C_SR_SLADDR0F_POS    (1U)
#define I2C_SR_SLADDR0F        (0x00000002UL)
#define I2C_SR_SLADDR1F_POS    (2U)
#define I2C_SR_SLADDR1F        (0x00000004UL)
#define I2C_SR_TENDF_POS       (3U)
#define I2C_SR_TENDF           (0x00000008UL)
#define I2C_SR_STOPF_POS       (4U)
#define I2C_SR_STOPF           (0x00000010UL)
#define I2C_SR_RFULLF_POS      (6U)
#define I2C_SR_RFULLF          (0x00000040UL)
#define I2C_SR_TEMPTYF_POS     (7U)
#define I2C_SR_TEMPTYF         (0x00000080UL)
#define I2C_SR_SLADDR2F_POS    (8U)
#define I2C_SR_SLADDR2F        (0x00000100UL)
#define I2C_SR_ARLOF_POS       (9U)
#define I2C_SR_ARLOF           (0x00000200UL)
#define I2C_SR_ACKRF_POS       (10U)
#define I2C_SR_ACKRF           (0x00000400UL)
#define I2C_SR_TCRF_POS        (11U)
#define I2C_SR_TCRF            (0x00000800UL)
#define I2C_SR_NACKF_POS       (12U)
#define I2C_SR_NACKF           (0x00001000UL)
#define I2C_SR_PECERRF_POS     (13U)
#define I2C_SR_PECERRF         (0x00002000UL)
#define I2C_SR_TMOUTF_POS      (14U)
#define I2C_SR_TMOUTF          (0x00004000UL)
#define I2C_SR_TCF_POS         (15U)
#define I2C_SR_TCF             (0x00008000UL)
#define I2C_SR_MSL_POS         (16U)
#define I2C_SR_MSL             (0x00010000UL)
#define I2C_SR_BUSY_POS        (17U)
#define I2C_SR_BUSY            (0x00020000UL)
#define I2C_SR_TRA_POS         (18U)
#define I2C_SR_TRA             (0x00040000UL)
#define I2C_SR_SMBALRTPTF_POS  (19U)
#define I2C_SR_SMBALRTPTF      (0x00080000UL)
#define I2C_SR_GENCALLF_POS    (20U)
#define I2C_SR_GENCALLF        (0x00100000UL)
#define I2C_SR_SMBDEFAULTF_POS (21U)
#define I2C_SR_SMBDEFAULTF     (0x00200000UL)
#define I2C_SR_SMBHOSTF_POS    (22U)
#define I2C_SR_SMBHOSTF        (0x00400000UL)
#define I2C_SR_SMBALRTF_POS    (23U)
#define I2C_SR_SMBALRTF        (0x00800000UL)
#define I2C_SR_TFEMPTY_POS     (24U)
#define I2C_SR_TFEMPTY         (0x01000000UL)
#define I2C_SR_TFFULL_POS      (25U)
#define I2C_SR_TFFULL          (0x02000000UL)
#define I2C_SR_RFEMPTY_POS     (26U)
#define I2C_SR_RFEMPTY         (0x04000000UL)
#define I2C_SR_RFFULL_POS      (27U)
#define I2C_SR_RFFULL          (0x08000000UL)
#define I2C_SR_TFST_POS        (28U)
#define I2C_SR_TFST            (0x30000000UL)
#define I2C_SR_TFST_0          (0x10000000UL)
#define I2C_SR_TFST_1          (0x20000000UL)
#define I2C_SR_RFREQ_POS       (31U)
#define I2C_SR_RFREQ           (0x80000000UL)

/* Bit definition for I2C_CLR register */
#define I2C_CLR_STARTFCLR_POS      (0U)
#define I2C_CLR_STARTFCLR          (0x00000001UL)
#define I2C_CLR_SLADDR0FCLR_POS    (1U)
#define I2C_CLR_SLADDR0FCLR        (0x00000002UL)
#define I2C_CLR_SLADDR1FCLR_POS    (2U)
#define I2C_CLR_SLADDR1FCLR        (0x00000004UL)
#define I2C_CLR_TENDFCLR_POS       (3U)
#define I2C_CLR_TENDFCLR           (0x00000008UL)
#define I2C_CLR_STOPFCLR_POS       (4U)
#define I2C_CLR_STOPFCLR           (0x00000010UL)
#define I2C_CLR_RFULLFCLR_POS      (6U)
#define I2C_CLR_RFULLFCLR          (0x00000040UL)
#define I2C_CLR_SLADDR2FCLR_POS    (8U)
#define I2C_CLR_SLADDR2FCLR        (0x00000100UL)
#define I2C_CLR_ARLOFCLR_POS       (9U)
#define I2C_CLR_ARLOFCLR           (0x00000200UL)
#define I2C_CLR_RFREQCLR_POS       (10U)
#define I2C_CLR_RFREQCLR           (0x00000400UL)
#define I2C_CLR_NACKFCLR_POS       (12U)
#define I2C_CLR_NACKFCLR           (0x00001000UL)
#define I2C_CLR_PECERRFCLR_POS     (13U)
#define I2C_CLR_PECERRFCLR         (0x00002000UL)
#define I2C_CLR_TMOUTFCLR_POS      (14U)
#define I2C_CLR_TMOUTFCLR          (0x00004000UL)
#define I2C_CLR_TCFCLR_POS         (15U)
#define I2C_CLR_TCFCLR             (0x00008000UL)
#define I2C_CLR_SMBALRTPTFCLR_POS  (19U)
#define I2C_CLR_SMBALRTPTFCLR      (0x00080000UL)
#define I2C_CLR_GENCALLFCLR_POS    (20U)
#define I2C_CLR_GENCALLFCLR        (0x00100000UL)
#define I2C_CLR_SMBDEFAULTFCLR_POS (21U)
#define I2C_CLR_SMBDEFAULTFCLR     (0x00200000UL)
#define I2C_CLR_SMBHOSTFCLR_POS    (22U)
#define I2C_CLR_SMBHOSTFCLR        (0x00400000UL)
#define I2C_CLR_SMBALRTFCLR_POS    (23U)
#define I2C_CLR_SMBALRTFCLR        (0x00800000UL)

/* Bit definition for I2C_DTR register */
#define I2C_DTR (0xFFU)

