MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for I2C_DRR register */
#define I2C_DRR (0xFFU)

/* Bit definition for I2C_CCR register */
#define I2C_CCR_SLOWW_POS    (0U)
#define I2C_CCR_SLOWW        (0x000000FFUL)
#define I2C_CCR_SHIGHW_POS   (8U)
#define I2C_CCR_SHIGHW       (0x0000FF00UL)
#define I2C_CCR_CKDIV_POS    (16U)
#define I2C_CCR_CKDIV        (0x00070000UL)
#define I2C_CCR_FMPLUSEN_POS (23U)
#define I2C_CCR_FMPLUSEN     (0x00800000UL)

/* Bit definition for I2C_FLTR register */
#define I2C_FLTR_DNF_POS   (0U)
#define I2C_FLTR_DNF       (0x00000003UL)
#define I2C_FLTR_DNFEN_POS (4U)
#define I2C_FLTR_DNFEN     (0x00000010UL)
#define I2C_FLTR_ANFEN_POS (5U)
#define I2C_FLTR_ANFEN     (0x00000020UL)

/* Bit definition for I2C_FSTR register */
#define I2C_FSTR_FEN_POS         (0U)
#define I2C_FSTR_FEN             (0x00000001UL)
#define I2C_FSTR_TFFLUSH_POS     (1U)
#define I2C_FSTR_TFFLUSH         (0x00000002UL)
#define I2C_FSTR_RFFLUSH_POS     (2U)
#define I2C_FSTR_RFFLUSH         (0x00000004UL)
#define I2C_FSTR_NACKTFFLUSH_POS (3U)
#define I2C_FSTR_NACKTFFLUSH     (0x00000008UL)
#define I2C_FSTR_TFST_POS        (4U)
#define I2C_FSTR_TFST            (0x00000030UL)
#define I2C_FSTR_TFST_0          (0x00000010UL)
#define I2C_FSTR_TFST_1          (0x00000020UL)
#define I2C_FSTR_RFST_POS        (6U)
#define I2C_FSTR_RFST            (0x000000C0UL)
#define I2C_FSTR_RFST_0          (0x00000040UL)
#define I2C_FSTR_RFST_1          (0x00000080UL)

/* Bit definition for I2C_SLVADDR register */
#define I2C_SLVADDR_SLVADR (0x000003FFUL)

/* Bit definition for I2C_PECDR register */
#define I2C_PECDR (0xFFU)

/* Bit definition for I2C_PECCR register */
#define I2C_PECCR_PECINREF_POS  (0U)
#define I2C_PECCR_PECINREF      (0x01U)
#define I2C_PECCR_PECOUTREF_POS (1U)
#define I2C_PECCR_PECOUTREF     (0x02U)
#define I2C_PECCR_PECOUTXOR_POS (2U)
#define I2C_PECCR_PECOUTXOR     (0x04U)

/* Bit definition for I2C_SLR2 register */
#define I2C_SLR2_SLADDR2_POS   (0U)
#define I2C_SLR2_SLADDR2       (0x000003FFUL)
#define I2C_SLR2_SLADDR2EN_POS (12U)
#define I2C_SLR2_SLADDR2EN     (0x00001000UL)
#define I2C_SLR2_ADDRMOD2_POS  (15U)
#define I2C_SLR2_ADDRMOD2      (0x00008000UL)
#define I2C_SLR2_MSLADDR2_POS  (16U)
#define I2C_SLR2_MSLADDR2      (0x03FF0000UL)
#define I2C_SLR2_MASK2EN_POS   (26U)
#define I2C_SLR2_MASK2EN       (0x04000000UL)

/* Bit definition for I2C_NBYTER register */
#define I2C_NBYTER (0xFFU)

/* Bit definition for I2C_NBCR register */
#define I2C_NBCR_AUTOEND_POS  (0U)
#define I2C_NBCR_AUTOEND      (0x01U)
#define I2C_NBCR_PECBYTE_POS  (1U)
#define I2C_NBCR_PECBYTE      (0x02U)
#define I2C_NBCR_AUTONAK_POS  (2U)
#define I2C_NBCR_AUTONAK      (0x04U)
#define I2C_NBCR_RELOAD_POS   (3U)
#define I2C_NBCR_RELOAD       (0x08U)
#define I2C_NBCR_NBCTRL_POS   (4U)
#define I2C_NBCR_NBCTRL       (0x10U)
#define I2C_NBCR_PECEN_POS    (5U)
#define I2C_NBCR_PECEN        (0x20U)
#define I2C_NBCR_RSPECCLR_POS (7U)
#define I2C_NBCR_RSPECCLR     (0x80U)

/*******************************************************************************
                Bit definition for Peripheral ICG
 *******************************************************************************/
/* Bit definition for ICG_ICG0 register */
#define ICG_ICG0_SWDTAUTS_POS   (0U)
#define ICG_ICG0_SWDTAUTS       (0x00000001UL)
#define ICG_ICG0_SWDTITS_POS    (1U)
#define ICG_ICG0_SWDTITS        (0x00000002UL)
#define ICG_ICG0_SWDTPERI_POS   (2U)
#define ICG_ICG0_SWDTPERI       (0x0000000CUL)
#define ICG_ICG0_SWDTPERI_0     (0x00000004UL)
#define ICG_ICG0_SWDTPERI_1     (0x00000008UL)
#define ICG_ICG0_SWDTCKS_POS    (4U)
#define ICG_ICG0_SWDTCKS        (0x000000F0UL)
#define ICG_ICG0_SWDTWDPT_POS   (8U)
#define ICG_ICG0_SWDTWDPT       (0x00000F00UL)
#define ICG_ICG0_SWDTSLPOFF_POS (12U)
#define ICG_ICG0_SWDTSLPOFF     (0x00001000UL)
#define ICG_ICG0_WDTAUTS_POS    (16U)
#define ICG_ICG0_WDTAUTS        (0x00010000UL)
#define ICG_ICG0_WDTITS_POS     (17U)
#define ICG_ICG0_WDTITS         (0x00020000UL)
#define ICG_ICG0_WDTPERI_POS    (18U)
#define ICG_ICG0_WDTPERI        (0x000C0000UL)
#define ICG_ICG0_WDTPERI_0      (0x00040000UL)
#define ICG_ICG0_WDTPERI_1      (0x00080000UL)
#define ICG_ICG0_WDTCKS_POS     (20U)
#define ICG_ICG0_WDTCKS         (0x00F00000UL)
#define ICG_ICG0_WDTWDPT_POS    (24U)
#define ICG_ICG0_WDTWDPT        (0x0F000000UL)
#define ICG_ICG0_WDTSLPOFF_POS  (28U)
#define ICG_ICG0_WDTSLPOFF      (0x10000000UL)

/* Bit definition for ICG_ICG1 register */
#define ICG_ICG1_HRCFREQSEL_POS (0U)
#define ICG_ICG1_HRCFREQSEL     (0x00000001UL)
#define ICG_ICG1_HRCSTOP_POS    (8U)
#define ICG_ICG1_HRCSTOP        (0x00000100UL)
#define ICG_ICG1_BOR_LEV_POS    (16U)
#define ICG_ICG1_BOR_LEV        (0x00030000UL)
#define ICG_ICG1_BOR_LEV_0      (0x00010000UL)
#define ICG_ICG1_BOR_LEV_1      (0x00020000UL)
#define ICG_ICG1_BORDIS_POS     (18U)
#define ICG_ICG1_BORDIS         (0x00040000UL)

/* Bit definition for ICG_ICG3 register */
#define ICG_ICG3_DBUSPRT (0x0000FFFFUL)

/* Bit definition for ICG_ICG8 register */
#define ICG_ICG8_ERMUOUTSEL_POS (0U)
#define ICG_ICG8_ERMUOUTSEL     (0x00000003UL)
#define ICG_ICG8_ERMUOUTSEL_0   (0x00000001UL)
#define ICG_ICG8_ERMUOUTSEL_1   (0x00000002UL)
#define ICG_ICG8_ERMUOUTDIS_POS (4U)
#define ICG_ICG8_ERMUOUTDIS     (0x00000010UL)

/*******************************************************************************
                Bit definition for Peripheral INTC
 *******************************************************************************/
/* Bit definition for INTC_NMIER register */
#define INTC_NMIER_SWDTEN_POS    (1U)
#define INTC_NMIER_SWDTEN        (0x00000002UL)
#define INTC_NMIER_PVD1EN_POS    (2U)
#define INTC_NMIER_PVD1EN        (0x00000004UL)
#define INTC_NMIER_PVD2EN_POS    (3U)
#define INTC_NMIER_PVD2EN        (0x00000008UL)
#define INTC_NMIER_XTALSTPEN_POS (5U)
#define INTC_NMIER_XTALSTPEN     (0x00000020UL)
#define INTC_NMIER_RECCERREN_POS (9U)
#define INTC_NMIER_RECCERREN     (0x00000200UL)
#define INTC_NMIER_BUSERREN_POS  (10U)
#define INTC_NMIER_BUSERREN      (0x00000400UL)
#define INTC_NMIER_WDTEN_POS     (11U)
#define INTC_NMIER_WDTEN         (0x00000800UL)
#define INTC_NMIER_FECCERREN_POS (12U)
#define INTC_NMIER_FECCERREN     (0x00001000UL)
#define INTC_NMIER_ERMUEN_POS    (13U)
#define INTC_NMIER_ERMUEN        (0x00002000UL)

/* Bit definition for INTC_NMIFR register */
#define INTC_NMIFR_SWDTF_POS    (1U)
#define INTC_NMIFR_SWDTF        (0x00000002UL)
#define INTC_NMIFR_PVD1F_POS    (2U)
#define INTC_NMIFR_PVD1F        (0x00000004UL)
#define INTC_NMIFR_PVD2F_POS    (3U)
#define INTC_NMIFR_PVD2F        (0x00000008UL)
#define INTC_NMIFR_XTALSTPF_POS (5U)
#define INTC_NMIFR_XTALSTPF     (0x00000020UL)
#define INTC_NMIFR_RECCERRF_POS (9U)
#define INTC_NMIFR_RECCERRF     (0x00000200UL)
#define INTC_NMIFR_BUSERRF_POS  (10U)
#define INTC_NMIFR_BUSERRF      (0x00000400UL)
#define INTC_NMIFR_WDTF_POS     (11U)
#define INTC_NMIFR_WDTF         (0x00000800UL)
#define INTC_NMIFR_FECCERRF_POS (12U)
#define INTC_NMIFR_FECCERRF     (0x00001000UL)
#define INTC_NMIFR_ERMUF_POS    (13U)
#define INTC_NMIFR_ERMUF        (0x00002000UL)

