MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for INTC_NMIFCR register */
#define INTC_NMIFCR_SWDTFCLR_POS    (1U)
#define INTC_NMIFCR_SWDTFCLR        (0x00000002UL)
#define INTC_NMIFCR_PVD1FCLR_POS    (2U)
#define INTC_NMIFCR_PVD1FCLR        (0x00000004UL)
#define INTC_NMIFCR_PVD2FCLR_POS    (3U)
#define INTC_NMIFCR_PVD2FCLR        (0x00000008UL)
#define INTC_NMIFCR_XTALSTPFCLR_POS (5U)
#define INTC_NMIFCR_XTALSTPFCLR     (0x00000020UL)
#define INTC_NMIFCR_RECCERRFCLR_POS (9U)
#define INTC_NMIFCR_RECCERRFCLR     (0x00000200UL)
#define INTC_NMIFCR_BUSERRFCLR_POS  (10U)
#define INTC_NMIFCR_BUSERRFCLR      (0x00000400UL)
#define INTC_NMIFCR_WDTFCLR_POS     (11U)
#define INTC_NMIFCR_WDTFCLR         (0x00000800UL)
#define INTC_NMIFCR_FECCERRFCLR_POS (12U)
#define INTC_NMIFCR_FECCERRFCLR     (0x00001000UL)
#define INTC_NMIFCR_ERMUFCLR_POS    (13U)
#define INTC_NMIFCR_ERMUFCLR        (0x00002000UL)

/* Bit definition for INTC_EIRQCR register */
#define INTC_EIRQCR_EIRQTRG_POS  (0U)
#define INTC_EIRQCR_EIRQTRG      (0x00000003UL)
#define INTC_EIRQCR_EIRQTRG_0    (0x00000001UL)
#define INTC_EIRQCR_EIRQTRG_1    (0x00000002UL)
#define INTC_EIRQCR_EIRQFS_POS   (2U)
#define INTC_EIRQCR_EIRQFS       (0x00000004UL)
#define INTC_EIRQCR_EIRQRS_POS   (3U)
#define INTC_EIRQCR_EIRQRS       (0x00000008UL)
#define INTC_EIRQCR_EISMPCLK_POS (4U)
#define INTC_EIRQCR_EISMPCLK     (0x00000030UL)
#define INTC_EIRQCR_EISMPCLK_0   (0x00000010UL)
#define INTC_EIRQCR_EISMPCLK_1   (0x00000020UL)
#define INTC_EIRQCR_EFEN_POS     (7U)
#define INTC_EIRQCR_EFEN         (0x00000080UL)
#define INTC_EIRQCR_NOCSEL_POS   (12U)
#define INTC_EIRQCR_NOCSEL       (0x00003000UL)
#define INTC_EIRQCR_NOCSEL_0     (0x00001000UL)
#define INTC_EIRQCR_NOCSEL_1     (0x00002000UL)
#define INTC_EIRQCR_NOCEN_POS    (15U)
#define INTC_EIRQCR_NOCEN        (0x00008000UL)

/* Bit definition for INTC_WKEN register */
#define INTC_WKEN_EIRQWKEN_POS     (0U)
#define INTC_WKEN_EIRQWKEN         (0x0000FFFFUL)
#define INTC_WKEN_EIRQWKEN_0       (0x00000001UL)
#define INTC_WKEN_EIRQWKEN_1       (0x00000002UL)
#define INTC_WKEN_EIRQWKEN_2       (0x00000004UL)
#define INTC_WKEN_EIRQWKEN_3       (0x00000008UL)
#define INTC_WKEN_EIRQWKEN_4       (0x00000010UL)
#define INTC_WKEN_EIRQWKEN_5       (0x00000020UL)
#define INTC_WKEN_EIRQWKEN_6       (0x00000040UL)
#define INTC_WKEN_EIRQWKEN_7       (0x00000080UL)
#define INTC_WKEN_EIRQWKEN_8       (0x00000100UL)
#define INTC_WKEN_EIRQWKEN_9       (0x00000200UL)
#define INTC_WKEN_EIRQWKEN_10      (0x00000400UL)
#define INTC_WKEN_EIRQWKEN_11      (0x00000800UL)
#define INTC_WKEN_EIRQWKEN_12      (0x00001000UL)
#define INTC_WKEN_EIRQWKEN_13      (0x00002000UL)
#define INTC_WKEN_EIRQWKEN_14      (0x00004000UL)
#define INTC_WKEN_EIRQWKEN_15      (0x00008000UL)
#define INTC_WKEN_SWDTWKEN_POS     (16U)
#define INTC_WKEN_SWDTWKEN         (0x00010000UL)
#define INTC_WKEN_PVD1WKEN_POS     (17U)
#define INTC_WKEN_PVD1WKEN         (0x00020000UL)
#define INTC_WKEN_PVD2WKEN_POS     (18U)
#define INTC_WKEN_PVD2WKEN         (0x00040000UL)
#define INTC_WKEN_CMP1WKEN_POS     (19U)
#define INTC_WKEN_CMP1WKEN         (0x00080000UL)
#define INTC_WKEN_CMP8WKEN_POS     (20U)
#define INTC_WKEN_CMP8WKEN         (0x00100000UL)
#define INTC_WKEN_TMR02CMPWKEN_POS (22U)
#define INTC_WKEN_TMR02CMPWKEN     (0x00400000UL)
#define INTC_WKEN_TMR01CMPWKEN_POS (23U)
#define INTC_WKEN_TMR01CMPWKEN     (0x00800000UL)
#define INTC_WKEN_CMP2WKEN_POS     (24U)
#define INTC_WKEN_CMP2WKEN         (0x01000000UL)
#define INTC_WKEN_CMP3WKEN_POS     (25U)
#define INTC_WKEN_CMP3WKEN         (0x02000000UL)
#define INTC_WKEN_RXWKEN_POS       (26U)
#define INTC_WKEN_RXWKEN           (0x04000000UL)
#define INTC_WKEN_SPIWKEN_POS      (27U)
#define INTC_WKEN_SPIWKEN          (0x08000000UL)
#define INTC_WKEN_CMP4WKEN_POS     (28U)
#define INTC_WKEN_CMP4WKEN         (0x10000000UL)
#define INTC_WKEN_CMP5WKEN_POS     (29U)
#define INTC_WKEN_CMP5WKEN         (0x20000000UL)
#define INTC_WKEN_CMP6WKEN_POS     (30U)
#define INTC_WKEN_CMP6WKEN         (0x40000000UL)
#define INTC_WKEN_CMP7WKEN_POS     (31U)
#define INTC_WKEN_CMP7WKEN         (0x80000000UL)

/* Bit definition for INTC_EIFR register */
#define INTC_EIFR_EIF0_POS  (0U)
#define INTC_EIFR_EIF0      (0x00000001UL)
#define INTC_EIFR_EIF1_POS  (1U)
#define INTC_EIFR_EIF1      (0x00000002UL)
#define INTC_EIFR_EIF2_POS  (2U)
#define INTC_EIFR_EIF2      (0x00000004UL)
#define INTC_EIFR_EIF3_POS  (3U)
#define INTC_EIFR_EIF3      (0x00000008UL)
#define INTC_EIFR_EIF4_POS  (4U)
#define INTC_EIFR_EIF4      (0x00000010UL)
#define INTC_EIFR_EIF5_POS  (5U)
#define INTC_EIFR_EIF5      (0x00000020UL)
#define INTC_EIFR_EIF6_POS  (6U)
#define INTC_EIFR_EIF6      (0x00000040UL)
#define INTC_EIFR_EIF7_POS  (7U)
#define INTC_EIFR_EIF7      (0x00000080UL)
#define INTC_EIFR_EIF8_POS  (8U)
#define INTC_EIFR_EIF8      (0x00000100UL)
#define INTC_EIFR_EIF9_POS  (9U)
#define INTC_EIFR_EIF9      (0x00000200UL)
#define INTC_EIFR_EIF10_POS (10U)
#define INTC_EIFR_EIF10     (0x00000400UL)
#define INTC_EIFR_EIF11_POS (11U)
#define INTC_EIFR_EIF11     (0x00000800UL)
#define INTC_EIFR_EIF12_POS (12U)
#define INTC_EIFR_EIF12     (0x00001000UL)
#define INTC_EIFR_EIF13_POS (13U)
#define INTC_EIFR_EIF13     (0x00002000UL)
#define INTC_EIFR_EIF14_POS (14U)
#define INTC_EIFR_EIF14     (0x00004000UL)
#define INTC_EIFR_EIF15_POS (15U)
#define INTC_EIFR_EIF15     (0x00008000UL)

/* Bit definition for INTC_EIFCR register */
#define INTC_EIFCR_EIFCLR0_POS  (0U)
#define INTC_EIFCR_EIFCLR0      (0x00000001UL)
#define INTC_EIFCR_EIFCLR1_POS  (1U)
#define INTC_EIFCR_EIFCLR1      (0x00000002UL)
#define INTC_EIFCR_EIFCLR2_POS  (2U)
#define INTC_EIFCR_EIFCLR2      (0x00000004UL)
#define INTC_EIFCR_EIFCLR3_POS  (3U)
#define INTC_EIFCR_EIFCLR3      (0x00000008UL)
#define INTC_EIFCR_EIFCLR4_POS  (4U)
#define INTC_EIFCR_EIFCLR4      (0x00000010UL)
#define INTC_EIFCR_EIFCLR5_POS  (5U)
#define INTC_EIFCR_EIFCLR5      (0x00000020UL)
#define INTC_EIFCR_EIFCLR6_POS  (6U)
#define INTC_EIFCR_EIFCLR6      (0x00000040UL)
#define INTC_EIFCR_EIFCLR7_POS  (7U)
#define INTC_EIFCR_EIFCLR7      (0x00000080UL)
#define INTC_EIFCR_EIFCLR8_POS  (8U)
#define INTC_EIFCR_EIFCLR8      (0x00000100UL)
#define INTC_EIFCR_EIFCLR9_POS  (9U)
#define INTC_EIFCR_EIFCLR9      (0x00000200UL)
#define INTC_EIFCR_EIFCLR10_POS (10U)
#define INTC_EIFCR_EIFCLR10     (0x00000400UL)
#define INTC_EIFCR_EIFCLR11_POS (11U)
#define INTC_EIFCR_EIFCLR11     (0x00000800UL)
#define INTC_EIFCR_EIFCLR12_POS (12U)
#define INTC_EIFCR_EIFCLR12     (0x00001000UL)
#define INTC_EIFCR_EIFCLR13_POS (13U)
#define INTC_EIFCR_EIFCLR13     (0x00002000UL)
#define INTC_EIFCR_EIFCLR14_POS (14U)
#define INTC_EIFCR_EIFCLR14     (0x00004000UL)
#define INTC_EIFCR_EIFCLR15_POS (15U)
#define INTC_EIFCR_EIFCLR15     (0x00008000UL)

/* Bit definition for INTC_INTSEL register */
#define INTC_INTSEL_INTSEL (0x000001FFUL)

/* Bit definition for INTC_INTEN register */
#define INTC_INTEN (0xFFFFFFFFUL)

/* Bit definition for INTC_SWIER register */
#define INTC_SWIER (0xFFFFFFFFUL)

/* Bit definition for INTC_EVTER register */
#define INTC_EVTER (0xFFFFFFFFUL)

/* Bit definition for INTC_IER register */
#define INTC_IER (0xFFFFFFFFUL)

/* Bit definition for INTC_FPUIER register */
#define INTC_FPUIER_IOCIEN_POS (0U)
#define INTC_FPUIER_IOCIEN     (0x00000001UL)
#define INTC_FPUIER_DZCIEN_POS (1U)
#define INTC_FPUIER_DZCIEN     (0x00000002UL)
#define INTC_FPUIER_OFCIEN_POS (2U)
#define INTC_FPUIER_OFCIEN     (0x00000004UL)
#define INTC_FPUIER_UFCIEN_POS (3U)
#define INTC_FPUIER_UFCIEN     (0x00000008UL)
#define INTC_FPUIER_IXCIEN_POS (4U)
#define INTC_FPUIER_IXCIEN     (0x00000010UL)
#define INTC_FPUIER_IDCIEN_POS (5U)
#define INTC_FPUIER_IDCIEN     (0x00000020UL)

