MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for MCAN_RXBC register */
#define MCAN_RXBC_RBSA_POS (2U)
#define MCAN_RXBC_RBSA     (0x0000FFFCUL)

/* Bit definition for MCAN_RXF1C register */
#define MCAN_RXF1C_F1SA_POS (2U)
#define MCAN_RXF1C_F1SA     (0x0000FFFCUL)
#define MCAN_RXF1C_F1S_POS  (16U)
#define MCAN_RXF1C_F1S      (0x007F0000UL)
#define MCAN_RXF1C_F1WM_POS (24U)
#define MCAN_RXF1C_F1WM     (0x7F000000UL)
#define MCAN_RXF1C_F1OM_POS (31U)
#define MCAN_RXF1C_F1OM     (0x80000000UL)

/* Bit definition for MCAN_RXF1S register */
#define MCAN_RXF1S_F1FL_POS (0U)
#define MCAN_RXF1S_F1FL     (0x0000007FUL)
#define MCAN_RXF1S_F1GI_POS (8U)
#define MCAN_RXF1S_F1GI     (0x00003F00UL)
#define MCAN_RXF1S_F1PI_POS (16U)
#define MCAN_RXF1S_F1PI     (0x003F0000UL)
#define MCAN_RXF1S_F1F_POS  (24U)
#define MCAN_RXF1S_F1F      (0x01000000UL)
#define MCAN_RXF1S_RF1L_POS (25U)
#define MCAN_RXF1S_RF1L     (0x02000000UL)
#define MCAN_RXF1S_DMS_POS  (30U)
#define MCAN_RXF1S_DMS      (0xC0000000UL)
#define MCAN_RXF1S_DMS_0    (0x40000000UL)
#define MCAN_RXF1S_DMS_1    (0x80000000UL)

/* Bit definition for MCAN_RXF1A register */
#define MCAN_RXF1A_F1AI (0x0000003FUL)

/* Bit definition for MCAN_RXESC register */
#define MCAN_RXESC_F0DS_POS (0U)
#define MCAN_RXESC_F0DS     (0x00000007UL)
#define MCAN_RXESC_F1DS_POS (4U)
#define MCAN_RXESC_F1DS     (0x00000070UL)
#define MCAN_RXESC_RBDS_POS (8U)
#define MCAN_RXESC_RBDS     (0x00000700UL)

/* Bit definition for MCAN_TXBC register */
#define MCAN_TXBC_TBSA_POS (2U)
#define MCAN_TXBC_TBSA     (0x0000FFFCUL)
#define MCAN_TXBC_NDTB_POS (16U)
#define MCAN_TXBC_NDTB     (0x003F0000UL)
#define MCAN_TXBC_TFQS_POS (24U)
#define MCAN_TXBC_TFQS     (0x3F000000UL)
#define MCAN_TXBC_TFQM_POS (30U)
#define MCAN_TXBC_TFQM     (0x40000000UL)

/* Bit definition for MCAN_TXFQS register */
#define MCAN_TXFQS_TFFL_POS  (0U)
#define MCAN_TXFQS_TFFL      (0x0000003FUL)
#define MCAN_TXFQS_TFGI_POS  (8U)
#define MCAN_TXFQS_TFGI      (0x00001F00UL)
#define MCAN_TXFQS_TFQPI_POS (16U)
#define MCAN_TXFQS_TFQPI     (0x001F0000UL)
#define MCAN_TXFQS_TFQF_POS  (21U)
#define MCAN_TXFQS_TFQF      (0x00200000UL)

/* Bit definition for MCAN_TXESC register */
#define MCAN_TXESC_TBDS (0x00000007UL)

/* Bit definition for MCAN_TXBRP register */
#define MCAN_TXBRP_TRP0_POS  (0U)
#define MCAN_TXBRP_TRP0      (0x00000001UL)
#define MCAN_TXBRP_TRP1_POS  (1U)
#define MCAN_TXBRP_TRP1      (0x00000002UL)
#define MCAN_TXBRP_TRP2_POS  (2U)
#define MCAN_TXBRP_TRP2      (0x00000004UL)
#define MCAN_TXBRP_TRP3_POS  (3U)
#define MCAN_TXBRP_TRP3      (0x00000008UL)
#define MCAN_TXBRP_TRP4_POS  (4U)
#define MCAN_TXBRP_TRP4      (0x00000010UL)
#define MCAN_TXBRP_TRP5_POS  (5U)
#define MCAN_TXBRP_TRP5      (0x00000020UL)
#define MCAN_TXBRP_TRP6_POS  (6U)
#define MCAN_TXBRP_TRP6      (0x00000040UL)
#define MCAN_TXBRP_TRP7_POS  (7U)
#define MCAN_TXBRP_TRP7      (0x00000080UL)
#define MCAN_TXBRP_TRP8_POS  (8U)
#define MCAN_TXBRP_TRP8      (0x00000100UL)
#define MCAN_TXBRP_TRP9_POS  (9U)
#define MCAN_TXBRP_TRP9      (0x00000200UL)
#define MCAN_TXBRP_TRP10_POS (10U)
#define MCAN_TXBRP_TRP10     (0x00000400UL)
#define MCAN_TXBRP_TRP11_POS (11U)
#define MCAN_TXBRP_TRP11     (0x00000800UL)
#define MCAN_TXBRP_TRP12_POS (12U)
#define MCAN_TXBRP_TRP12     (0x00001000UL)
#define MCAN_TXBRP_TRP13_POS (13U)
#define MCAN_TXBRP_TRP13     (0x00002000UL)
#define MCAN_TXBRP_TRP14_POS (14U)
#define MCAN_TXBRP_TRP14     (0x00004000UL)
#define MCAN_TXBRP_TRP15_POS (15U)
#define MCAN_TXBRP_TRP15     (0x00008000UL)
#define MCAN_TXBRP_TRP16_POS (16U)
#define MCAN_TXBRP_TRP16     (0x00010000UL)
#define MCAN_TXBRP_TRP17_POS (17U)
#define MCAN_TXBRP_TRP17     (0x00020000UL)
#define MCAN_TXBRP_TRP18_POS (18U)
#define MCAN_TXBRP_TRP18     (0x00040000UL)
#define MCAN_TXBRP_TRP19_POS (19U)
#define MCAN_TXBRP_TRP19     (0x00080000UL)
#define MCAN_TXBRP_TRP20_POS (20U)
#define MCAN_TXBRP_TRP20     (0x00100000UL)
#define MCAN_TXBRP_TRP21_POS (21U)
#define MCAN_TXBRP_TRP21     (0x00200000UL)
#define MCAN_TXBRP_TRP22_POS (22U)
#define MCAN_TXBRP_TRP22     (0x00400000UL)
#define MCAN_TXBRP_TRP23_POS (23U)
#define MCAN_TXBRP_TRP23     (0x00800000UL)
#define MCAN_TXBRP_TRP24_POS (24U)
#define MCAN_TXBRP_TRP24     (0x01000000UL)
#define MCAN_TXBRP_TRP25_POS (25U)
#define MCAN_TXBRP_TRP25     (0x02000000UL)
#define MCAN_TXBRP_TRP26_POS (26U)
#define MCAN_TXBRP_TRP26     (0x04000000UL)
#define MCAN_TXBRP_TRP27_POS (27U)
#define MCAN_TXBRP_TRP27     (0x08000000UL)
#define MCAN_TXBRP_TRP28_POS (28U)
#define MCAN_TXBRP_TRP28     (0x10000000UL)
#define MCAN_TXBRP_TRP29_POS (29U)
#define MCAN_TXBRP_TRP29     (0x20000000UL)
#define MCAN_TXBRP_TRP30_POS (30U)
#define MCAN_TXBRP_TRP30     (0x40000000UL)
#define MCAN_TXBRP_TRP31_POS (31U)
#define MCAN_TXBRP_TRP31     (0x80000000UL)

/* Bit definition for MCAN_TXBAR register */
#define MCAN_TXBAR_AR0_POS  (0U)
#define MCAN_TXBAR_AR0      (0x00000001UL)
#define MCAN_TXBAR_AR1_POS  (1U)
#define MCAN_TXBAR_AR1      (0x00000002UL)
#define MCAN_TXBAR_AR2_POS  (2U)
#define MCAN_TXBAR_AR2      (0x00000004UL)
#define MCAN_TXBAR_AR3_POS  (3U)
#define MCAN_TXBAR_AR3      (0x00000008UL)
#define MCAN_TXBAR_AR4_POS  (4U)
#define MCAN_TXBAR_AR4      (0x00000010UL)
#define MCAN_TXBAR_AR5_POS  (5U)
#define MCAN_TXBAR_AR5      (0x00000020UL)
#define MCAN_TXBAR_AR6_POS  (6U)
#define MCAN_TXBAR_AR6      (0x00000040UL)
#define MCAN_TXBAR_AR7_POS  (7U)
#define MCAN_TXBAR_AR7      (0x00000080UL)
#define MCAN_TXBAR_AR8_POS  (8U)
#define MCAN_TXBAR_AR8      (0x00000100UL)
#define MCAN_TXBAR_AR9_POS  (9U)
#define MCAN_TXBAR_AR9      (0x00000200UL)
#define MCAN_TXBAR_AR10_POS (10U)
#define MCAN_TXBAR_AR10     (0x00000400UL)
#define MCAN_TXBAR_AR11_POS (11U)
#define MCAN_TXBAR_AR11     (0x00000800UL)
#define MCAN_TXBAR_AR12_POS (12U)
#define MCAN_TXBAR_AR12     (0x00001000UL)
#define MCAN_TXBAR_AR13_POS (13U)
#define MCAN_TXBAR_AR13     (0x00002000UL)
#define MCAN_TXBAR_AR14_POS (14U)
#define MCAN_TXBAR_AR14     (0x00004000UL)
#define MCAN_TXBAR_AR15_POS (15U)
#define MCAN_TXBAR_AR15     (0x00008000UL)
#define MCAN_TXBAR_AR16_POS (16U)
#define MCAN_TXBAR_AR16     (0x00010000UL)
#define MCAN_TXBAR_AR17_POS (17U)
#define MCAN_TXBAR_AR17     (0x00020000UL)
#define MCAN_TXBAR_AR18_POS (18U)
#define MCAN_TXBAR_AR18     (0x00040000UL)
#define MCAN_TXBAR_AR19_POS (19U)
#define MCAN_TXBAR_AR19     (0x00080000UL)
#define MCAN_TXBAR_AR20_POS (20U)
#define MCAN_TXBAR_AR20     (0x00100000UL)
#define MCAN_TXBAR_AR21_POS (21U)
#define MCAN_TXBAR_AR21     (0x00200000UL)
#define MCAN_TXBAR_AR22_POS (22U)
#define MCAN_TXBAR_AR22     (0x00400000UL)
#define MCAN_TXBAR_AR23_POS (23U)
#define MCAN_TXBAR_AR23     (0x00800000UL)
#define MCAN_TXBAR_AR24_POS (24U)
#define MCAN_TXBAR_AR24     (0x01000000UL)
#define MCAN_TXBAR_AR25_POS (25U)
#define MCAN_TXBAR_AR25     (0x02000000UL)
#define MCAN_TXBAR_AR26_POS (26U)
#define MCAN_TXBAR_AR26     (0x04000000UL)
#define MCAN_TXBAR_AR27_POS (27U)
#define MCAN_TXBAR_AR27     (0x08000000UL)
#define MCAN_TXBAR_AR28_POS (28U)
#define MCAN_TXBAR_AR28     (0x10000000UL)
#define MCAN_TXBAR_AR29_POS (29U)
#define MCAN_TXBAR_AR29     (0x20000000UL)
#define MCAN_TXBAR_AR30_POS (30U)
#define MCAN_TXBAR_AR30     (0x40000000UL)
#define MCAN_TXBAR_AR31_POS (31U)
#define MCAN_TXBAR_AR31     (0x80000000UL)

/* Bit definition for MCAN_TXBCR register */
#define MCAN_TXBCR_CR0_POS  (0U)
#define MCAN_TXBCR_CR0      (0x00000001UL)
#define MCAN_TXBCR_CR1_POS  (1U)
#define MCAN_TXBCR_CR1      (0x00000002UL)
#define MCAN_TXBCR_CR2_POS  (2U)
#define MCAN_TXBCR_CR2      (0x00000004UL)
#define MCAN_TXBCR_CR3_POS  (3U)
#define MCAN_TXBCR_CR3      (0x00000008UL)
#define MCAN_TXBCR_CR4_POS  (4U)
#define MCAN_TXBCR_CR4      (0x00000010UL)
#define MCAN_TXBCR_CR5_POS  (5U)
#define MCAN_TXBCR_CR5      (0x00000020UL)
#define MCAN_TXBCR_CR6_POS  (6U)
#define MCAN_TXBCR_CR6      (0x00000040UL)
#define MCAN_TXBCR_CR7_POS  (7U)
#define MCAN_TXBCR_CR7      (0x00000080UL)
#define MCAN_TXBCR_CR8_POS  (8U)
#define MCAN_TXBCR_CR8      (0x00000100UL)
#define MCAN_TXBCR_CR9_POS  (9U)
#define MCAN_TXBCR_CR9      (0x00000200UL)
#define MCAN_TXBCR_CR10_POS (10U)
#define MCAN_TXBCR_CR10     (0x00000400UL)
#define MCAN_TXBCR_CR11_POS (11U)
#define MCAN_TXBCR_CR11     (0x00000800UL)
#define MCAN_TXBCR_CR12_POS (12U)
#define MCAN_TXBCR_CR12     (0x00001000UL)
#define MCAN_TXBCR_CR13_POS (13U)
#define MCAN_TXBCR_CR13     (0x00002000UL)
#define MCAN_TXBCR_CR14_POS (14U)
#define MCAN_TXBCR_CR14     (0x00004000UL)
#define MCAN_TXBCR_CR15_POS (15U)
#define MCAN_TXBCR_CR15     (0x00008000UL)
#define MCAN_TXBCR_CR16_POS (16U)
#define MCAN_TXBCR_CR16     (0x00010000UL)
#define MCAN_TXBCR_CR17_POS (17U)
#define MCAN_TXBCR_CR17     (0x00020000UL)
#define MCAN_TXBCR_CR18_POS (18U)
#define MCAN_TXBCR_CR18     (0x00040000UL)
#define MCAN_TXBCR_CR19_POS (19U)
#define MCAN_TXBCR_CR19     (0x00080000UL)
#define MCAN_TXBCR_CR20_POS (20U)
#define MCAN_TXBCR_CR20     (0x00100000UL)
#define MCAN_TXBCR_CR21_POS (21U)
#define MCAN_TXBCR_CR21     (0x00200000UL)
#define MCAN_TXBCR_CR22_POS (22U)
#define MCAN_TXBCR_CR22     (0x00400000UL)
#define MCAN_TXBCR_CR23_POS (23U)
#define MCAN_TXBCR_CR23     (0x00800000UL)
#define MCAN_TXBCR_CR24_POS (24U)
#define MCAN_TXBCR_CR24     (0x01000000UL)
#define MCAN_TXBCR_CR25_POS (25U)
#define MCAN_TXBCR_CR25     (0x02000000UL)
#define MCAN_TXBCR_CR26_POS (26U)
#define MCAN_TXBCR_CR26     (0x04000000UL)
#define MCAN_TXBCR_CR27_POS (27U)
#define MCAN_TXBCR_CR27     (0x08000000UL)
#define MCAN_TXBCR_CR28_POS (28U)
#define MCAN_TXBCR_CR28     (0x10000000UL)
#define MCAN_TXBCR_CR29_POS (29U)
#define MCAN_TXBCR_CR29     (0x20000000UL)
#define MCAN_TXBCR_CR30_POS (30U)
#define MCAN_TXBCR_CR30     (0x40000000UL)
#define MCAN_TXBCR_CR31_POS (31U)
#define MCAN_TXBCR_CR31     (0x80000000UL)

/* Bit definition for MCAN_TXBTO register */
#define MCAN_TXBTO_TO0_POS  (0U)
#define MCAN_TXBTO_TO0      (0x00000001UL)
#define MCAN_TXBTO_TO1_POS  (1U)
#define MCAN_TXBTO_TO1      (0x00000002UL)
#define MCAN_TXBTO_TO2_POS  (2U)
#define MCAN_TXBTO_TO2      (0x00000004UL)
#define MCAN_TXBTO_TO3_POS  (3U)
#define MCAN_TXBTO_TO3      (0x00000008UL)
#define MCAN_TXBTO_TO4_POS  (4U)
#define MCAN_TXBTO_TO4      (0x00000010UL)
#define MCAN_TXBTO_TO5_POS  (5U)
#define MCAN_TXBTO_TO5      (0x00000020UL)
#define MCAN_TXBTO_TO6_POS  (6U)
#define MCAN_TXBTO_TO6      (0x00000040UL)
#define MCAN_TXBTO_TO7_POS  (7U)
#define MCAN_TXBTO_TO7      (0x00000080UL)
#define MCAN_TXBTO_TO8_POS  (8U)
#define MCAN_TXBTO_TO8      (0x00000100UL)
#define MCAN_TXBTO_TO9_POS  (9U)
#define MCAN_TXBTO_TO9      (0x00000200UL)
#define MCAN_TXBTO_TO10_POS (10U)
#define MCAN_TXBTO_TO10     (0x00000400UL)
#define MCAN_TXBTO_TO11_POS (11U)
#define MCAN_TXBTO_TO11     (0x00000800UL)
#define MCAN_TXBTO_TO12_POS (12U)
#define MCAN_TXBTO_TO12     (0x00001000UL)
#define MCAN_TXBTO_TO13_POS (13U)
#define MCAN_TXBTO_TO13     (0x00002000UL)
#define MCAN_TXBTO_TO14_POS (14U)
#define MCAN_TXBTO_TO14     (0x00004000UL)
#define MCAN_TXBTO_TO15_POS (15U)
#define MCAN_TXBTO_TO15     (0x00008000UL)
#define MCAN_TXBTO_TO16_POS (16U)
#define MCAN_TXBTO_TO16     (0x00010000UL)
#define MCAN_TXBTO_TO17_POS (17U)
#define MCAN_TXBTO_TO17     (0x00020000UL)
#define MCAN_TXBTO_TO18_POS (18U)
#define MCAN_TXBTO_TO18     (0x00040000UL)
#define MCAN_TXBTO_TO19_POS (19U)
#define MCAN_TXBTO_TO19     (0x00080000UL)
#define MCAN_TXBTO_TO20_POS (20U)
#define MCAN_TXBTO_TO20     (0x00100000UL)
#define MCAN_TXBTO_TO21_POS (21U)
#define MCAN_TXBTO_TO21     (0x00200000UL)
#define MCAN_TXBTO_TO22_POS (22U)
#define MCAN_TXBTO_TO22     (0x00400000UL)
#define MCAN_TXBTO_TO23_POS (23U)
#define MCAN_TXBTO_TO23     (0x00800000UL)
#define MCAN_TXBTO_TO24_POS (24U)
#define MCAN_TXBTO_TO24     (0x01000000UL)
#define MCAN_TXBTO_TO25_POS (25U)
#define MCAN_TXBTO_TO25     (0x02000000UL)
#define MCAN_TXBTO_TO26_POS (26U)
#define MCAN_TXBTO_TO26     (0x04000000UL)
#define MCAN_TXBTO_TO27_POS (27U)
#define MCAN_TXBTO_TO27     (0x08000000UL)
#define MCAN_TXBTO_TO28_POS (28U)
#define MCAN_TXBTO_TO28     (0x10000000UL)
#define MCAN_TXBTO_TO29_POS (29U)
#define MCAN_TXBTO_TO29     (0x20000000UL)
#define MCAN_TXBTO_TO30_POS (30U)
#define MCAN_TXBTO_TO30     (0x40000000UL)
#define MCAN_TXBTO_TO31_POS (31U)
#define MCAN_TXBTO_TO31     (0x80000000UL)

/* Bit definition for MCAN_TXBCF register */
#define MCAN_TXBCF_CF0_POS  (0U)
#define MCAN_TXBCF_CF0      (0x00000001UL)
#define MCAN_TXBCF_CF1_POS  (1U)
#define MCAN_TXBCF_CF1      (0x00000002UL)
#define MCAN_TXBCF_CF2_POS  (2U)
#define MCAN_TXBCF_CF2      (0x00000004UL)
#define MCAN_TXBCF_CF3_POS  (3U)
#define MCAN_TXBCF_CF3      (0x00000008UL)
#define MCAN_TXBCF_CF4_POS  (4U)
#define MCAN_TXBCF_CF4      (0x00000010UL)
#define MCAN_TXBCF_CF5_POS  (5U)
#define MCAN_TXBCF_CF5      (0x00000020UL)
#define MCAN_TXBCF_CF6_POS  (6U)
#define MCAN_TXBCF_CF6      (0x00000040UL)
#define MCAN_TXBCF_CF7_POS  (7U)
#define MCAN_TXBCF_CF7      (0x00000080UL)
#define MCAN_TXBCF_CF8_POS  (8U)
#define MCAN_TXBCF_CF8      (0x00000100UL)
#define MCAN_TXBCF_CF9_POS  (9U)
#define MCAN_TXBCF_CF9      (0x00000200UL)
#define MCAN_TXBCF_CF10_POS (10U)
#define MCAN_TXBCF_CF10     (0x00000400UL)
#define MCAN_TXBCF_CF11_POS (11U)
#define MCAN_TXBCF_CF11     (0x00000800UL)
#define MCAN_TXBCF_CF12_POS (12U)
#define MCAN_TXBCF_CF12     (0x00001000UL)
#define MCAN_TXBCF_CF13_POS (13U)
#define MCAN_TXBCF_CF13     (0x00002000UL)
#define MCAN_TXBCF_CF14_POS (14U)
#define MCAN_TXBCF_CF14     (0x00004000UL)
#define MCAN_TXBCF_CF15_POS (15U)
#define MCAN_TXBCF_CF15     (0x00008000UL)
#define MCAN_TXBCF_CF16_POS (16U)
#define MCAN_TXBCF_CF16     (0x00010000UL)
#define MCAN_TXBCF_CF17_POS (17U)
#define MCAN_TXBCF_CF17     (0x00020000UL)
#define MCAN_TXBCF_CF18_POS (18U)
#define MCAN_TXBCF_CF18     (0x00040000UL)
#define MCAN_TXBCF_CF19_POS (19U)
#define MCAN_TXBCF_CF19     (0x00080000UL)
#define MCAN_TXBCF_CF20_POS (20U)
#define MCAN_TXBCF_CF20     (0x00100000UL)
#define MCAN_TXBCF_CF21_POS (21U)
#define MCAN_TXBCF_CF21     (0x00200000UL)
#define MCAN_TXBCF_CF22_POS (22U)
#define MCAN_TXBCF_CF22     (0x00400000UL)
#define MCAN_TXBCF_CF23_POS (23U)
#define MCAN_TXBCF_CF23     (0x00800000UL)
#define MCAN_TXBCF_CF24_POS (24U)
#define MCAN_TXBCF_CF24     (0x01000000UL)
#define MCAN_TXBCF_CF25_POS (25U)
#define MCAN_TXBCF_CF25     (0x02000000UL)
#define MCAN_TXBCF_CF26_POS (26U)
#define MCAN_TXBCF_CF26     (0x04000000UL)
#define MCAN_TXBCF_CF27_POS (27U)
#define MCAN_TXBCF_CF27     (0x08000000UL)
#define MCAN_TXBCF_CF28_POS (28U)
#define MCAN_TXBCF_CF28     (0x10000000UL)
#define MCAN_TXBCF_CF29_POS (29U)
#define MCAN_TXBCF_CF29     (0x20000000UL)
#define MCAN_TXBCF_CF30_POS (30U)
#define MCAN_TXBCF_CF30     (0x40000000UL)
#define MCAN_TXBCF_CF31_POS (31U)
#define MCAN_TXBCF_CF31     (0x80000000UL)

/* Bit definition for MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE0_POS  (0U)
#define MCAN_TXBTIE_TIE0      (0x00000001UL)
#define MCAN_TXBTIE_TIE1_POS  (1U)
#define MCAN_TXBTIE_TIE1      (0x00000002UL)
#define MCAN_TXBTIE_TIE2_POS  (2U)
#define MCAN_TXBTIE_TIE2      (0x00000004UL)
#define MCAN_TXBTIE_TIE3_POS  (3U)
#define MCAN_TXBTIE_TIE3      (0x00000008UL)
#define MCAN_TXBTIE_TIE4_POS  (4U)
#define MCAN_TXBTIE_TIE4      (0x00000010UL)
#define MCAN_TXBTIE_TIE5_POS  (5U)
#define MCAN_TXBTIE_TIE5      (0x00000020UL)
#define MCAN_TXBTIE_TIE6_POS  (6U)
#define MCAN_TXBTIE_TIE6      (0x00000040UL)
#define MCAN_TXBTIE_TIE7_POS  (7U)
#define MCAN_TXBTIE_TIE7      (0x00000080UL)
#define MCAN_TXBTIE_TIE8_POS  (8U)
#define MCAN_TXBTIE_TIE8      (0x00000100UL)
#define MCAN_TXBTIE_TIE9_POS  (9U)
#define MCAN_TXBTIE_TIE9      (0x00000200UL)
#define MCAN_TXBTIE_TIE10_POS (10U)
#define MCAN_TXBTIE_TIE10     (0x00000400UL)
#define MCAN_TXBTIE_TIE11_POS (11U)
#define MCAN_TXBTIE_TIE11     (0x00000800UL)
#define MCAN_TXBTIE_TIE12_POS (12U)
#define MCAN_TXBTIE_TIE12     (0x00001000UL)
#define MCAN_TXBTIE_TIE13_POS (13U)
#define MCAN_TXBTIE_TIE13     (0x00002000UL)
#define MCAN_TXBTIE_TIE14_POS (14U)
#define MCAN_TXBTIE_TIE14     (0x00004000UL)
#define MCAN_TXBTIE_TIE15_POS (15U)
#define MCAN_TXBTIE_TIE15     (0x00008000UL)
#define MCAN_TXBTIE_TIE16_POS (16U)
#define MCAN_TXBTIE_TIE16     (0x00010000UL)
#define MCAN_TXBTIE_TIE17_POS (17U)
#define MCAN_TXBTIE_TIE17     (0x00020000UL)
#define MCAN_TXBTIE_TIE18_POS (18U)
#define MCAN_TXBTIE_TIE18     (0x00040000UL)
#define MCAN_TXBTIE_TIE19_POS (19U)
#define MCAN_TXBTIE_TIE19     (0x00080000UL)
#define MCAN_TXBTIE_TIE20_POS (20U)
#define MCAN_TXBTIE_TIE20     (0x00100000UL)
#define MCAN_TXBTIE_TIE21_POS (21U)
#define MCAN_TXBTIE_TIE21     (0x00200000UL)
#define MCAN_TXBTIE_TIE22_POS (22U)
#define MCAN_TXBTIE_TIE22     (0x00400000UL)
#define MCAN_TXBTIE_TIE23_POS (23U)
#define MCAN_TXBTIE_TIE23     (0x00800000UL)
#define MCAN_TXBTIE_TIE24_POS (24U)
#define MCAN_TXBTIE_TIE24     (0x01000000UL)
#define MCAN_TXBTIE_TIE25_POS (25U)
#define MCAN_TXBTIE_TIE25     (0x02000000UL)
#define MCAN_TXBTIE_TIE26_POS (26U)
#define MCAN_TXBTIE_TIE26     (0x04000000UL)
#define MCAN_TXBTIE_TIE27_POS (27U)
#define MCAN_TXBTIE_TIE27     (0x08000000UL)
#define MCAN_TXBTIE_TIE28_POS (28U)
#define MCAN_TXBTIE_TIE28     (0x10000000UL)
#define MCAN_TXBTIE_TIE29_POS (29U)
#define MCAN_TXBTIE_TIE29     (0x20000000UL)
#define MCAN_TXBTIE_TIE30_POS (30U)
#define MCAN_TXBTIE_TIE30     (0x40000000UL)
#define MCAN_TXBTIE_TIE31_POS (31U)
#define MCAN_TXBTIE_TIE31     (0x80000000UL)

/* Bit definition for MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE0_POS  (0U)
#define MCAN_TXBCIE_CFIE0      (0x00000001UL)
#define MCAN_TXBCIE_CFIE1_POS  (1U)
#define MCAN_TXBCIE_CFIE1      (0x00000002UL)
#define MCAN_TXBCIE_CFIE2_POS  (2U)
#define MCAN_TXBCIE_CFIE2      (0x00000004UL)
#define MCAN_TXBCIE_CFIE3_POS  (3U)
#define MCAN_TXBCIE_CFIE3      (0x00000008UL)
#define MCAN_TXBCIE_CFIE4_POS  (4U)
#define MCAN_TXBCIE_CFIE4      (0x00000010UL)
#define MCAN_TXBCIE_CFIE5_POS  (5U)
#define MCAN_TXBCIE_CFIE5      (0x00000020UL)
#define MCAN_TXBCIE_CFIE6_POS  (6U)
#define MCAN_TXBCIE_CFIE6      (0x00000040UL)
#define MCAN_TXBCIE_CFIE7_POS  (7U)
#define MCAN_TXBCIE_CFIE7      (0x00000080UL)
#define MCAN_TXBCIE_CFIE8_POS  (8U)
#define MCAN_TXBCIE_CFIE8      (0x00000100UL)
#define MCAN_TXBCIE_CFIE9_POS  (9U)
#define MCAN_TXBCIE_CFIE9      (0x00000200UL)
#define MCAN_TXBCIE_CFIE10_POS (10U)
#define MCAN_TXBCIE_CFIE10     (0x00000400UL)
#define MCAN_TXBCIE_CFIE11_POS (11U)
#define MCAN_TXBCIE_CFIE11     (0x00000800UL)
#define MCAN_TXBCIE_CFIE12_POS (12U)
#define MCAN_TXBCIE_CFIE12     (0x00001000UL)
#define MCAN_TXBCIE_CFIE13_POS (13U)
#define MCAN_TXBCIE_CFIE13     (0x00002000UL)
#define MCAN_TXBCIE_CFIE14_POS (14U)
#define MCAN_TXBCIE_CFIE14     (0x00004000UL)
#define MCAN_TXBCIE_CFIE15_POS (15U)
#define MCAN_TXBCIE_CFIE15     (0x00008000UL)
#define MCAN_TXBCIE_CFIE16_POS (16U)
#define MCAN_TXBCIE_CFIE16     (0x00010000UL)
#define MCAN_TXBCIE_CFIE17_POS (17U)
#define MCAN_TXBCIE_CFIE17     (0x00020000UL)
#define MCAN_TXBCIE_CFIE18_POS (18U)
#define MCAN_TXBCIE_CFIE18     (0x00040000UL)
#define MCAN_TXBCIE_CFIE19_POS (19U)
#define MCAN_TXBCIE_CFIE19     (0x00080000UL)
#define MCAN_TXBCIE_CFIE20_POS (20U)
#define MCAN_TXBCIE_CFIE20     (0x00100000UL)
#define MCAN_TXBCIE_CFIE21_POS (21U)
#define MCAN_TXBCIE_CFIE21     (0x00200000UL)
#define MCAN_TXBCIE_CFIE22_POS (22U)
#define MCAN_TXBCIE_CFIE22     (0x00400000UL)
#define MCAN_TXBCIE_CFIE23_POS (23U)
#define MCAN_TXBCIE_CFIE23     (0x00800000UL)
#define MCAN_TXBCIE_CFIE24_POS (24U)
#define MCAN_TXBCIE_CFIE24     (0x01000000UL)
#define MCAN_TXBCIE_CFIE25_POS (25U)
#define MCAN_TXBCIE_CFIE25     (0x02000000UL)
#define MCAN_TXBCIE_CFIE26_POS (26U)
#define MCAN_TXBCIE_CFIE26     (0x04000000UL)
#define MCAN_TXBCIE_CFIE27_POS (27U)
#define MCAN_TXBCIE_CFIE27     (0x08000000UL)
#define MCAN_TXBCIE_CFIE28_POS (28U)
#define MCAN_TXBCIE_CFIE28     (0x10000000UL)
#define MCAN_TXBCIE_CFIE29_POS (29U)
#define MCAN_TXBCIE_CFIE29     (0x20000000UL)
#define MCAN_TXBCIE_CFIE30_POS (30U)
#define MCAN_TXBCIE_CFIE30     (0x40000000UL)
#define MCAN_TXBCIE_CFIE31_POS (31U)
#define MCAN_TXBCIE_CFIE31     (0x80000000UL)

/* Bit definition for MCAN_TXEFC register */
#define MCAN_TXEFC_EFSA_POS (2U)
#define MCAN_TXEFC_EFSA     (0x0000FFFCUL)
#define MCAN_TXEFC_EFS_POS  (16U)
#define MCAN_TXEFC_EFS      (0x003F0000UL)
#define MCAN_TXEFC_EFWM_POS (24U)
#define MCAN_TXEFC_EFWM     (0x3F000000UL)

