MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for MCAN_TXEFS register */
#define MCAN_TXEFS_EFFL_POS (0U)
#define MCAN_TXEFS_EFFL     (0x0000003FUL)
#define MCAN_TXEFS_EFGI_POS (8U)
#define MCAN_TXEFS_EFGI     (0x00001F00UL)
#define MCAN_TXEFS_EFPI_POS (16U)
#define MCAN_TXEFS_EFPI     (0x001F0000UL)
#define MCAN_TXEFS_EFF_POS  (24U)
#define MCAN_TXEFS_EFF      (0x01000000UL)
#define MCAN_TXEFS_TEFL_POS (25U)
#define MCAN_TXEFS_TEFL     (0x02000000UL)

/* Bit definition for MCAN_TXEFA register */
#define MCAN_TXEFA_EFAI (0x0000001FUL)

/*******************************************************************************
                Bit definition for Peripheral MCANRAM
 *******************************************************************************/
/* Bit definition for MCANRAM_CKCR register */
#define MCANRAM_CKCR_ECCMOD   (0x00000003UL)
#define MCANRAM_CKCR_ECCMOD_0 (0x00000001UL)
#define MCANRAM_CKCR_ECCMOD_1 (0x00000002UL)

/* Bit definition for MCANRAM_CKSR register */
#define MCANRAM_CKSR_RAM_1ERR_POS (0U)
#define MCANRAM_CKSR_RAM_1ERR     (0x00000001UL)
#define MCANRAM_CKSR_RAM_2ERR_POS (1U)
#define MCANRAM_CKSR_RAM_2ERR     (0x00000002UL)

/* Bit definition for MCANRAM_EIEN register */
#define MCANRAM_EIEN_EIEN (0x00000001UL)

/* Bit definition for MCANRAM_EIBIT0 register */
#define MCANRAM_EIBIT0 (0xFFFFFFFFUL)

/* Bit definition for MCANRAM_EIBIT1 register */
#define MCANRAM_EIBIT1_EIBIT (0x0000007FUL)

/* Bit definition for MCANRAM_ECCERRADDR register */
#define MCANRAM_ECCERRADDR_ECCERRADDR (0x000003FFUL)

/*******************************************************************************
                Bit definition for Peripheral MPU
 *******************************************************************************/
/* Bit definition for MPU_RGD register */
#define MPU_RGD_MPURGSIZE_POS (0U)
#define MPU_RGD_MPURGSIZE     (0x0000001FUL)
#define MPU_RGD_MPURGADDR_POS (5U)
#define MPU_RGD_MPURGADDR     (0xFFFFFFE0UL)

/* Bit definition for MPU_SR register */
#define MPU_SR_SMPU1EAF_POS (0U)
#define MPU_SR_SMPU1EAF     (0x00000001UL)
#define MPU_SR_SMPU2EAF_POS (1U)
#define MPU_SR_SMPU2EAF     (0x00000002UL)

/* Bit definition for MPU_ECLR register */
#define MPU_ECLR_SMPU1ECLR_POS (0U)
#define MPU_ECLR_SMPU1ECLR     (0x00000001UL)
#define MPU_ECLR_SMPU2ECLR_POS (1U)
#define MPU_ECLR_SMPU2ECLR     (0x00000002UL)

/* Bit definition for MPU_WP register */
#define MPU_WP_MPUWE_POS (0U)
#define MPU_WP_MPUWE     (0x00000001UL)
#define MPU_WP_WKEY_POS  (1U)
#define MPU_WP_WKEY      (0x0000FFFEUL)

/* Bit definition for MPU_IPPR register */
#define MPU_IPPR_ENCRYPTRDP_POS (0U)
#define MPU_IPPR_ENCRYPTRDP     (0x00000001UL)
#define MPU_IPPR_ENCRYPTWRP_POS (1U)
#define MPU_IPPR_ENCRYPTWRP     (0x00000002UL)
#define MPU_IPPR_HASHRDP_POS    (2U)
#define MPU_IPPR_HASHRDP        (0x00000004UL)
#define MPU_IPPR_HASHWRP_POS    (3U)
#define MPU_IPPR_HASHWRP        (0x00000008UL)
#define MPU_IPPR_TRNGRDP_POS    (4U)
#define MPU_IPPR_TRNGRDP        (0x00000010UL)
#define MPU_IPPR_TRNGWRP_POS    (5U)
#define MPU_IPPR_TRNGWRP        (0x00000020UL)
#define MPU_IPPR_CRCRDP_POS     (6U)
#define MPU_IPPR_CRCRDP         (0x00000040UL)
#define MPU_IPPR_CRCWRP_POS     (7U)
#define MPU_IPPR_CRCWRP         (0x00000080UL)
#define MPU_IPPR_EFMRDP_POS     (8U)
#define MPU_IPPR_EFMRDP         (0x00000100UL)
#define MPU_IPPR_EFMWRP_POS     (9U)
#define MPU_IPPR_EFMWRP         (0x00000200UL)
#define MPU_IPPR_ERMURDP_POS    (10U)
#define MPU_IPPR_ERMURDP        (0x00000400UL)
#define MPU_IPPR_ERMUWRP_POS    (11U)
#define MPU_IPPR_ERMUWRP        (0x00000800UL)
#define MPU_IPPR_WDTRDP_POS     (12U)
#define MPU_IPPR_WDTRDP         (0x00001000UL)
#define MPU_IPPR_WDTWRP_POS     (13U)
#define MPU_IPPR_WDTWRP         (0x00002000UL)
#define MPU_IPPR_SWDTRDP_POS    (14U)
#define MPU_IPPR_SWDTRDP        (0x00004000UL)
#define MPU_IPPR_SWDTWRP_POS    (15U)
#define MPU_IPPR_SWDTWRP        (0x00008000UL)
#define MPU_IPPR_XCMPRDP_POS    (16U)
#define MPU_IPPR_XCMPRDP        (0x00010000UL)
#define MPU_IPPR_XCMPWRP_POS    (17U)
#define MPU_IPPR_XCMPWRP        (0x00020000UL)
#define MPU_IPPR_DMPURDP_POS    (20U)
#define MPU_IPPR_DMPURDP        (0x00100000UL)
#define MPU_IPPR_DMPUWRP_POS    (21U)
#define MPU_IPPR_DMPUWRP        (0x00200000UL)
#define MPU_IPPR_SRAMCRDP_POS   (22U)
#define MPU_IPPR_SRAMCRDP       (0x00400000UL)
#define MPU_IPPR_SRAMCWRP_POS   (23U)
#define MPU_IPPR_SRAMCWRP       (0x00800000UL)
#define MPU_IPPR_INTCRDP_POS    (24U)
#define MPU_IPPR_INTCRDP        (0x01000000UL)
#define MPU_IPPR_INTCWRP_POS    (25U)
#define MPU_IPPR_INTCWRP        (0x02000000UL)
#define MPU_IPPR_SYSCRDP_POS    (26U)
#define MPU_IPPR_SYSCRDP        (0x04000000UL)
#define MPU_IPPR_SYSCWRP_POS    (27U)
#define MPU_IPPR_SYSCWRP        (0x08000000UL)
#define MPU_IPPR_MSTPRDP_POS    (28U)
#define MPU_IPPR_MSTPRDP        (0x10000000UL)
#define MPU_IPPR_MSTPWRP_POS    (29U)
#define MPU_IPPR_MSTPWRP        (0x20000000UL)
#define MPU_IPPR_BUSERRE_POS    (31U)
#define MPU_IPPR_BUSERRE        (0x80000000UL)

/* Bit definition for MPU_SRGE register */
#define MPU_SRGE_RG0E_POS  (0U)
#define MPU_SRGE_RG0E      (0x00000001UL)
#define MPU_SRGE_RG1E_POS  (1U)
#define MPU_SRGE_RG1E      (0x00000002UL)
#define MPU_SRGE_RG2E_POS  (2U)
#define MPU_SRGE_RG2E      (0x00000004UL)
#define MPU_SRGE_RG3E_POS  (3U)
#define MPU_SRGE_RG3E      (0x00000008UL)
#define MPU_SRGE_RG4E_POS  (4U)
#define MPU_SRGE_RG4E      (0x00000010UL)
#define MPU_SRGE_RG5E_POS  (5U)
#define MPU_SRGE_RG5E      (0x00000020UL)
#define MPU_SRGE_RG6E_POS  (6U)
#define MPU_SRGE_RG6E      (0x00000040UL)
#define MPU_SRGE_RG7E_POS  (7U)
#define MPU_SRGE_RG7E      (0x00000080UL)
#define MPU_SRGE_RG8E_POS  (8U)
#define MPU_SRGE_RG8E      (0x00000100UL)
#define MPU_SRGE_RG9E_POS  (9U)
#define MPU_SRGE_RG9E      (0x00000200UL)
#define MPU_SRGE_RG10E_POS (10U)
#define MPU_SRGE_RG10E     (0x00000400UL)
#define MPU_SRGE_RG11E_POS (11U)
#define MPU_SRGE_RG11E     (0x00000800UL)
#define MPU_SRGE_RG12E_POS (12U)
#define MPU_SRGE_RG12E     (0x00001000UL)
#define MPU_SRGE_RG13E_POS (13U)
#define MPU_SRGE_RG13E     (0x00002000UL)
#define MPU_SRGE_RG14E_POS (14U)
#define MPU_SRGE_RG14E     (0x00004000UL)
#define MPU_SRGE_RG15E_POS (15U)
#define MPU_SRGE_RG15E     (0x00008000UL)

