MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for MPU_SRGWP register */
#define MPU_SRGWP_RG0WP_POS  (0U)
#define MPU_SRGWP_RG0WP      (0x00000001UL)
#define MPU_SRGWP_RG1WP_POS  (1U)
#define MPU_SRGWP_RG1WP      (0x00000002UL)
#define MPU_SRGWP_RG2WP_POS  (2U)
#define MPU_SRGWP_RG2WP      (0x00000004UL)
#define MPU_SRGWP_RG3WP_POS  (3U)
#define MPU_SRGWP_RG3WP      (0x00000008UL)
#define MPU_SRGWP_RG4WP_POS  (4U)
#define MPU_SRGWP_RG4WP      (0x00000010UL)
#define MPU_SRGWP_RG5WP_POS  (5U)
#define MPU_SRGWP_RG5WP      (0x00000020UL)
#define MPU_SRGWP_RG6WP_POS  (6U)
#define MPU_SRGWP_RG6WP      (0x00000040UL)
#define MPU_SRGWP_RG7WP_POS  (7U)
#define MPU_SRGWP_RG7WP      (0x00000080UL)
#define MPU_SRGWP_RG8WP_POS  (8U)
#define MPU_SRGWP_RG8WP      (0x00000100UL)
#define MPU_SRGWP_RG9WP_POS  (9U)
#define MPU_SRGWP_RG9WP      (0x00000200UL)
#define MPU_SRGWP_RG10WP_POS (10U)
#define MPU_SRGWP_RG10WP     (0x00000400UL)
#define MPU_SRGWP_RG11WP_POS (11U)
#define MPU_SRGWP_RG11WP     (0x00000800UL)
#define MPU_SRGWP_RG12WP_POS (12U)
#define MPU_SRGWP_RG12WP     (0x00001000UL)
#define MPU_SRGWP_RG13WP_POS (13U)
#define MPU_SRGWP_RG13WP     (0x00002000UL)
#define MPU_SRGWP_RG14WP_POS (14U)
#define MPU_SRGWP_RG14WP     (0x00004000UL)
#define MPU_SRGWP_RG15WP_POS (15U)
#define MPU_SRGWP_RG15WP     (0x00008000UL)

/* Bit definition for MPU_SRGRP register */
#define MPU_SRGRP_RG0RP_POS  (0U)
#define MPU_SRGRP_RG0RP      (0x00000001UL)
#define MPU_SRGRP_RG1RP_POS  (1U)
#define MPU_SRGRP_RG1RP      (0x00000002UL)
#define MPU_SRGRP_RG2RP_POS  (2U)
#define MPU_SRGRP_RG2RP      (0x00000004UL)
#define MPU_SRGRP_RG3RP_POS  (3U)
#define MPU_SRGRP_RG3RP      (0x00000008UL)
#define MPU_SRGRP_RG4RP_POS  (4U)
#define MPU_SRGRP_RG4RP      (0x00000010UL)
#define MPU_SRGRP_RG5RP_POS  (5U)
#define MPU_SRGRP_RG5RP      (0x00000020UL)
#define MPU_SRGRP_RG6RP_POS  (6U)
#define MPU_SRGRP_RG6RP      (0x00000040UL)
#define MPU_SRGRP_RG7RP_POS  (7U)
#define MPU_SRGRP_RG7RP      (0x00000080UL)
#define MPU_SRGRP_RG8RP_POS  (8U)
#define MPU_SRGRP_RG8RP      (0x00000100UL)
#define MPU_SRGRP_RG9RP_POS  (9U)
#define MPU_SRGRP_RG9RP      (0x00000200UL)
#define MPU_SRGRP_RG10RP_POS (10U)
#define MPU_SRGRP_RG10RP     (0x00000400UL)
#define MPU_SRGRP_RG11RP_POS (11U)
#define MPU_SRGRP_RG11RP     (0x00000800UL)
#define MPU_SRGRP_RG12RP_POS (12U)
#define MPU_SRGRP_RG12RP     (0x00001000UL)
#define MPU_SRGRP_RG13RP_POS (13U)
#define MPU_SRGRP_RG13RP     (0x00002000UL)
#define MPU_SRGRP_RG14RP_POS (14U)
#define MPU_SRGRP_RG14RP     (0x00004000UL)
#define MPU_SRGRP_RG15RP_POS (15U)
#define MPU_SRGRP_RG15RP     (0x00008000UL)

/* Bit definition for MPU_SCR register */
#define MPU_SCR_SMPUBRP_POS (0U)
#define MPU_SCR_SMPUBRP     (0x00000001UL)
#define MPU_SCR_SMPUBWP_POS (1U)
#define MPU_SCR_SMPUBWP     (0x00000002UL)
#define MPU_SCR_SMPUACT_POS (2U)
#define MPU_SCR_SMPUACT     (0x0000000CUL)
#define MPU_SCR_SMPUACT_0   (0x00000004UL)
#define MPU_SCR_SMPUACT_1   (0x00000008UL)
#define MPU_SCR_SMPUE_POS   (7U)
#define MPU_SCR_SMPUE       (0x00000080UL)

/*******************************************************************************
                Bit definition for Peripheral OTS
 *******************************************************************************/
/* Bit definition for OTS_CTL register */
#define OTS_CTL_OTSE (0x0001U)

/* Bit definition for OTS_PDR0 register */
#define OTS_PDR0 (0xFFFFU)

/* Bit definition for OTS_PDR1 register */
#define OTS_PDR1_M_POS (0U)
#define OTS_PDR1_M     (0x00FFFFFFUL)
#define OTS_PDR1_C_POS (24U)
#define OTS_PDR1_C     (0xFF000000UL)

/*******************************************************************************
                Bit definition for Peripheral PERIC
 *******************************************************************************/
/* Bit definition for PERIC_TMR_SYNENR register */
#define PERIC_TMR_SYNENR_TMR0_1_A_POS (0U)
#define PERIC_TMR_SYNENR_TMR0_1_A     (0x00000001UL)
#define PERIC_TMR_SYNENR_TMR0_1_B_POS (1U)
#define PERIC_TMR_SYNENR_TMR0_1_B     (0x00000002UL)
#define PERIC_TMR_SYNENR_TMR0_2_A_POS (2U)
#define PERIC_TMR_SYNENR_TMR0_2_A     (0x00000004UL)
#define PERIC_TMR_SYNENR_TMR0_2_B_POS (3U)
#define PERIC_TMR_SYNENR_TMR0_2_B     (0x00000008UL)
#define PERIC_TMR_SYNENR_HRPWM_1_POS  (8U)
#define PERIC_TMR_SYNENR_HRPWM_1      (0x00000100UL)
#define PERIC_TMR_SYNENR_HRPWM_2_POS  (9U)
#define PERIC_TMR_SYNENR_HRPWM_2      (0x00000200UL)
#define PERIC_TMR_SYNENR_HRPWM_3_POS  (10U)
#define PERIC_TMR_SYNENR_HRPWM_3      (0x00000400UL)
#define PERIC_TMR_SYNENR_HRPWM_4_POS  (11U)
#define PERIC_TMR_SYNENR_HRPWM_4      (0x00000800UL)
#define PERIC_TMR_SYNENR_HRPWM_5_POS  (12U)
#define PERIC_TMR_SYNENR_HRPWM_5      (0x00001000UL)
#define PERIC_TMR_SYNENR_HRPWM_6_POS  (13U)
#define PERIC_TMR_SYNENR_HRPWM_6      (0x00002000UL)
#define PERIC_TMR_SYNENR_HRPWM_7_POS  (14U)
#define PERIC_TMR_SYNENR_HRPWM_7      (0x00004000UL)
#define PERIC_TMR_SYNENR_HRPWM_8_POS  (15U)
#define PERIC_TMR_SYNENR_HRPWM_8      (0x00008000UL)
#define PERIC_TMR_SYNENR_TMR6_1_POS   (23U)
#define PERIC_TMR_SYNENR_TMR6_1       (0x00800000UL)
#define PERIC_TMR_SYNENR_TMR6_2_POS   (24U)
#define PERIC_TMR_SYNENR_TMR6_2       (0x01000000UL)
#define PERIC_TMR_SYNENR_TMR6_3_POS   (25U)
#define PERIC_TMR_SYNENR_TMR6_3       (0x02000000UL)
#define PERIC_TMR_SYNENR_TMR6_4_POS   (26U)
#define PERIC_TMR_SYNENR_TMR6_4       (0x04000000UL)
#define PERIC_TMR_SYNENR_TMR6_5_POS   (27U)
#define PERIC_TMR_SYNENR_TMR6_5       (0x08000000UL)
#define PERIC_TMR_SYNENR_TMR6_6_POS   (28U)
#define PERIC_TMR_SYNENR_TMR6_6       (0x10000000UL)

/* Bit definition for PERIC_USART1_NFC register */
#define PERIC_USART1_NFC_USASRT1_NFS_POS (0U)
#define PERIC_USART1_NFC_USASRT1_NFS     (0x00000003UL)
#define PERIC_USART1_NFC_USASRT1_NFS_0   (0x00000001UL)
#define PERIC_USART1_NFC_USASRT1_NFS_1   (0x00000002UL)
#define PERIC_USART1_NFC_USART1_NFE_POS  (2U)
#define PERIC_USART1_NFC_USART1_NFE      (0x00000004UL)

/* Bit definition for PERIC_SPI1_NFC register */
#define PERIC_SPI1_NFC_SPI1_NFS_POS (0U)
#define PERIC_SPI1_NFC_SPI1_NFS     (0x00000003UL)
#define PERIC_SPI1_NFC_SPI1_NFS_0   (0x00000001UL)
#define PERIC_SPI1_NFC_SPI1_NFS_1   (0x00000002UL)
#define PERIC_SPI1_NFC_SPI1_NFE_POS (2U)
#define PERIC_SPI1_NFC_SPI1_NFE     (0x00000004UL)

