MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral PID
 *******************************************************************************/
/* Bit definition for PID_CR register */
#define PID_CR_START_POS     (0U)
#define PID_CR_START         (0x00000001UL)
#define PID_CR_CLEAR_POS     (1U)
#define PID_CR_CLEAR         (0x00000002UL)
#define PID_CR_FSM_RST_POS   (2U)
#define PID_CR_FSM_RST       (0x00000004UL)
#define PID_CR_CAL_MODE_POS  (5U)
#define PID_CR_CAL_MODE      (0x00000060UL)
#define PID_CR_CAL_MODE_0    (0x00000020UL)
#define PID_CR_CAL_MODE_1    (0x00000040UL)
#define PID_CR_PID_EN_POS    (7U)
#define PID_CR_PID_EN        (0x00000080UL)
#define PID_CR_U1P1_EN_POS   (8U)
#define PID_CR_U1P1_EN       (0x00000100UL)
#define PID_CR_U1P2_EN_POS   (9U)
#define PID_CR_U1P2_EN       (0x00000200UL)
#define PID_CR_U1P2_SEL_POS  (10U)
#define PID_CR_U1P2_SEL      (0x00001C00UL)
#define PID_CR_U3P1_EN_POS   (13U)
#define PID_CR_U3P1_EN       (0x00002000UL)
#define PID_CR_U3P2_EN_POS   (14U)
#define PID_CR_U3P2_EN       (0x00004000UL)
#define PID_CR_U3P2_WAIT_POS (15U)
#define PID_CR_U3P2_WAIT     (0x00008000UL)
#define PID_CR_U3P2_SEL_POS  (16U)
#define PID_CR_U3P2_SEL      (0x00030000UL)
#define PID_CR_U3P2_SEL_0    (0x00010000UL)
#define PID_CR_U3P2_SEL_1    (0x00020000UL)
#define PID_CR_U3P3_EN_POS   (18U)
#define PID_CR_U3P3_EN       (0x00040000UL)
#define PID_CR_U3P4_EN_POS   (19U)
#define PID_CR_U3P4_EN       (0x00080000UL)
#define PID_CR_U3P4_WAIT_POS (20U)
#define PID_CR_U3P4_WAIT     (0x00100000UL)
#define PID_CR_U3P4_TYPE_POS (21U)
#define PID_CR_U3P4_TYPE     (0x00200000UL)
#define PID_CR_U4P1_EN_POS   (22U)
#define PID_CR_U4P1_EN       (0x00400000UL)
#define PID_CR_U5P1_EN_POS   (23U)
#define PID_CR_U5P1_EN       (0x00800000UL)
#define PID_CR_U5P2_EN_POS   (24U)
#define PID_CR_U5P2_EN       (0x01000000UL)
#define PID_CR_COEF_MODE_POS (27U)
#define PID_CR_COEF_MODE     (0x18000000UL)
#define PID_CR_COEF_MODE_0   (0x08000000UL)
#define PID_CR_COEF_MODE_1   (0x10000000UL)
#define PID_CR_IMODE_POS     (29U)
#define PID_CR_IMODE         (0x20000000UL)
#define PID_CR_DMODE_POS     (30U)
#define PID_CR_DMODE         (0x40000000UL)
#define PID_CR_ISAT_EN_POS   (31U)
#define PID_CR_ISAT_EN       (0x80000000UL)

/* Bit definition for PID_REF register */
#define PID_REF (0xFFFFFFFFUL)

/* Bit definition for PID_AVAL register */
#define PID_AVAL (0xFFFFFFFFUL)

/* Bit definition for PID_EMAX register */
#define PID_EMAX (0xFFFFFFFFUL)

/* Bit definition for PID_EMIN register */
#define PID_EMIN (0xFFFFFFFFUL)

/* Bit definition for PID_IMAX register */
#define PID_IMAX (0xFFFFFFFFUL)

/* Bit definition for PID_IMIN register */
#define PID_IMIN (0xFFFFFFFFUL)

/* Bit definition for PID_DMAX register */
#define PID_DMAX (0xFFFFFFFFUL)

/* Bit definition for PID_DMIN register */
#define PID_DMIN (0xFFFFFFFFUL)

/* Bit definition for PID_UMAX register */
#define PID_UMAX (0xFFFFFFFFUL)

/* Bit definition for PID_UMIN register */
#define PID_UMIN (0xFFFFFFFFUL)

/* Bit definition for PID_U1MAX register */
#define PID_U1MAX (0xFFFFFFFFUL)

/* Bit definition for PID_U1MIN register */
#define PID_U1MIN (0xFFFFFFFFUL)

/* Bit definition for PID_STA register */
#define PID_STA_DATA_RDY_POS (0U)
#define PID_STA_DATA_RDY     (0x00000001UL)
#define PID_STA_CAL_OOR_POS  (8U)
#define PID_STA_CAL_OOR      (0x00000100UL)
#define PID_STA_CAL_INF_POS  (9U)
#define PID_STA_CAL_INF      (0x00000200UL)
#define PID_STA_CAL_NAN_POS  (10U)
#define PID_STA_CAL_NAN      (0x00000400UL)
#define PID_STA_STATE_POS    (16U)
#define PID_STA_STATE        (0x0FFF0000UL)

/* Bit definition for PID_CR2 register */
#define PID_CR2_INT_EN_POS    (0U)
#define PID_CR2_INT_EN        (0x00000001UL)
#define PID_CR2_EMIN_SEL_POS  (8U)
#define PID_CR2_EMIN_SEL      (0x00000100UL)
#define PID_CR2_IMIN_SEL_POS  (9U)
#define PID_CR2_IMIN_SEL      (0x00000200UL)
#define PID_CR2_DMIN_SEL_POS  (10U)
#define PID_CR2_DMIN_SEL      (0x00000400UL)
#define PID_CR2_UMIN_SEL_POS  (11U)
#define PID_CR2_UMIN_SEL      (0x00000800UL)
#define PID_CR2_U1MIN_SEL_POS (12U)
#define PID_CR2_U1MIN_SEL     (0x00001000UL)
#define PID_CR2_U3MIN_SEL_POS (13U)
#define PID_CR2_U3MIN_SEL     (0x00002000UL)
#define PID_CR2_U5MIN_SEL_POS (14U)
#define PID_CR2_U5MIN_SEL     (0x00004000UL)
#define PID_CR2_KFMIN_SEL_POS (15U)
#define PID_CR2_KFMIN_SEL     (0x00008000UL)
#define PID_CR2_DSEL_POS      (16U)
#define PID_CR2_DSEL          (0x000F0000UL)
#define PID_CR2_ASEL_POS      (20U)
#define PID_CR2_ASEL          (0x00F00000UL)
#define PID_CR2_REF_INIT_POS  (30U)
#define PID_CR2_REF_INIT      (0x40000000UL)
#define PID_CR2_RAMP_EN_POS   (31U)
#define PID_CR2_RAMP_EN       (0x80000000UL)

/* Bit definition for PID_KP1 register */
#define PID_KP1 (0xFFFFFFFFUL)

/* Bit definition for PID_KI1 register */
#define PID_KI1 (0xFFFFFFFFUL)

/* Bit definition for PID_KD1 register */
#define PID_KD1 (0xFFFFFFFFUL)

/* Bit definition for PID_KP2 register */
#define PID_KP2 (0xFFFFFFFFUL)

/* Bit definition for PID_KI2 register */
#define PID_KI2 (0xFFFFFFFFUL)

/* Bit definition for PID_KD2 register */
#define PID_KD2 (0xFFFFFFFFUL)

/* Bit definition for PID_KP3 register */
#define PID_KP3 (0xFFFFFFFFUL)

/* Bit definition for PID_KI3 register */
#define PID_KI3 (0xFFFFFFFFUL)

/* Bit definition for PID_KD3 register */
#define PID_KD3 (0xFFFFFFFFUL)

/* Bit definition for PID_KDF1 register */
#define PID_KDF1 (0xFFFFFFFFUL)

/* Bit definition for PID_CSTH1 register */
#define PID_CSTH1 (0xFFFFFFFFUL)

/* Bit definition for PID_CSTH2 register */
#define PID_CSTH2 (0xFFFFFFFFUL)

/* Bit definition for PID_DLY1 register */
#define PID_DLY1 (0xFFFFFFFFUL)

/* Bit definition for PID_DLY2 register */
#define PID_DLY2 (0xFFFFFFFFUL)

/* Bit definition for PID_ERR register */
#define PID_ERR (0xFFFFFFFFUL)

/* Bit definition for PID_PVAL register */
#define PID_PVAL (0xFFFFFFFFUL)

/* Bit definition for PID_IVAL register */
#define PID_IVAL (0xFFFFFFFFUL)

/* Bit definition for PID_DVAL register */
#define PID_DVAL (0xFFFFFFFFUL)

/* Bit definition for PID_U register */
#define PID_U (0xFFFFFFFFUL)

