MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for PID_U1 register */
#define PID_U1 (0xFFFFFFFFUL)

/* Bit definition for PID_U2 register */
#define PID_U2 (0xFFFFFFFFUL)

/* Bit definition for PID_U3 register */
#define PID_U3 (0xFFFFFFFFUL)

/* Bit definition for PID_U4 register */
#define PID_U4 (0xFFFFFFFFUL)

/* Bit definition for PID_U1P1 register */
#define PID_U1P1 (0xFFFFFFFFUL)

/* Bit definition for PID_U3P1 register */
#define PID_U3P1 (0xFFFFFFFFUL)

/* Bit definition for PID_U4P1 register */
#define PID_U4P1 (0xFFFFFFFFUL)

/* Bit definition for PID_UF register */
#define PID_UF (0xFFFFFFFFUL)

/* Bit definition for PID_U1P2 register */
#define PID_U1P2 (0xFFFFFFFFUL)

/* Bit definition for PID_U3P2 register */
#define PID_U3P2 (0xFFFFFFFFUL)

/* Bit definition for PID_U3P3 register */
#define PID_U3P3 (0xFFFFFFFFUL)

/* Bit definition for PID_U3P4 register */
#define PID_U3P4 (0xFFFFFFFFUL)

/* Bit definition for PID_U5P1 register */
#define PID_U5P1 (0xFFFFFFFFUL)

/* Bit definition for PID_U5P2 register */
#define PID_U5P2 (0xFFFFFFFFUL)

/* Bit definition for PID_U3MAX register */
#define PID_U3MAX (0xFFFFFFFFUL)

/* Bit definition for PID_U3MIN register */
#define PID_U3MIN (0xFFFFFFFFUL)

/* Bit definition for PID_U5MAX register */
#define PID_U5MAX (0xFFFFFFFFUL)

/* Bit definition for PID_U5MIN register */
#define PID_U5MIN (0xFFFFFFFFUL)

/* Bit definition for PID_REF_FIN register */
#define PID_REF_FIN (0xFFFFFFFFUL)

/* Bit definition for PID_REF_STEP register */
#define PID_REF_STEP (0xFFFFFFFFUL)

/* Bit definition for PID_U5 register */
#define PID_U5 (0xFFFFFFFFUL)

/* Bit definition for PID_U5F register */
#define PID_U5F (0xFFFFFFFFUL)

/* Bit definition for PID_KF_ACT register */
#define PID_KF_ACT (0xFFFFFFFFUL)

/* Bit definition for PID_KP_ACT register */
#define PID_KP_ACT (0xFFFFFFFFUL)

/* Bit definition for PID_KI_ACT register */
#define PID_KI_ACT (0xFFFFFFFFUL)

/* Bit definition for PID_KD_ACT register */
#define PID_KD_ACT (0xFFFFFFFFUL)

/* Bit definition for PID_KDF2 register */
#define PID_KDF2 (0xFFFFFFFFUL)

/* Bit definition for PID_KDF3 register */
#define PID_KDF3 (0xFFFFFFFFUL)

/* Bit definition for PID_KDF_ACT register */
#define PID_KDF_ACT (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral PID_CMP
 *******************************************************************************/
/* Bit definition for PID_CMP_CR register */
#define PID_CMP_CR_CMP_EN_POS        (0U)
#define PID_CMP_CR_CMP_EN            (0x00000001UL)
#define PID_CMP_CR_CMP_SEL_POS       (1U)
#define PID_CMP_CR_CMP_SEL           (0x00000006UL)
#define PID_CMP_CR_CMP_SEL_0         (0x00000002UL)
#define PID_CMP_CR_CMP_SEL_1         (0x00000004UL)
#define PID_CMP_CR_BSEL_POS          (12U)
#define PID_CMP_CR_BSEL              (0x00007000UL)
#define PID_CMP_CR_BMODE_POS         (15U)
#define PID_CMP_CR_BMODE             (0x00008000UL)
#define PID_CMP_CR_CMP_INT_EN_POS    (16U)
#define PID_CMP_CR_CMP_INT_EN        (0x00010000UL)
#define PID_CMP_CR_BURST_INT_EN_POS  (17U)
#define PID_CMP_CR_BURST_INT_EN      (0x00020000UL)
#define PID_CMP_CR_BURST_INT_SEL_POS (24U)
#define PID_CMP_CR_BURST_INT_SEL     (0x01000000UL)

/* Bit definition for PID_CMP_UC register */
#define PID_CMP_UC (0xFFFFFFFFUL)

/* Bit definition for PID_CMP_CSTA register */
#define PID_CMP_CSTA_CMP_STA_POS  (0U)
#define PID_CMP_CSTA_CMP_STA      (0x00000001UL)
#define PID_CMP_CSTA_BSTA_POS     (8U)
#define PID_CMP_CSTA_BSTA         (0x00000100UL)
#define PID_CMP_CSTA_BST_DONE_POS (9U)
#define PID_CMP_CSTA_BST_DONE     (0x00000200UL)
#define PID_CMP_CSTA_UCSEL_POS    (16U)
#define PID_CMP_CSTA_UCSEL        (0x00030000UL)
#define PID_CMP_CSTA_UCSEL_0      (0x00010000UL)
#define PID_CMP_CSTA_UCSEL_1      (0x00020000UL)

/* Bit definition for PID_CMP_BTH register */
#define PID_CMP_BTH (0xFFFFFFFFUL)

/* Bit definition for PID_CMP_BMCMP register */
#define PID_CMP_BMCMP (0xFFFFFFFFUL)

/* Bit definition for PID_CMP_BMPU register */
#define PID_CMP_BMPU (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral PLA
 *******************************************************************************/
/* Bit definition for PLA_GCTL register */
#define PLA_GCTL_EN (0x0000FFFFUL)

/* Bit definition for PLA_STAT register */
#define PLA_STAT_OUT (0x0000FFFFUL)

/* Bit definition for PLA_MUXS register */
#define PLA_MUXS_MUX1_POS (0U)
#define PLA_MUXS_MUX1     (0x0000001FUL)
#define PLA_MUXS_MUX0_POS (8U)
#define PLA_MUXS_MUX0     (0x00001F00UL)

/* Bit definition for PLA_LUTCTL register */
#define PLA_LUTCTL_LUTCTL (0x000000FFUL)

/* Bit definition for PLA_CTL register */
#define PLA_CTL_CSEL_POS  (0U)
#define PLA_CTL_CSEL      (0x0000001FUL)
#define PLA_CTL_OEN_POS   (6U)
#define PLA_CTL_OEN       (0x00000040UL)
#define PLA_CTL_FFRST_POS (9U)
#define PLA_CTL_FFRST     (0x00000200UL)
#define PLA_CTL_OSEL_POS  (10U)
#define PLA_CTL_OSEL      (0x00000C00UL)
#define PLA_CTL_OSEL_0    (0x00000400UL)
#define PLA_CTL_OSEL_1    (0x00000800UL)

/*******************************************************************************
                Bit definition for Peripheral PWC
 *******************************************************************************/
/* Bit definition for PWC_FCG0 register */
#define PWC_FCG0_SRAMH_POS     (0U)
#define PWC_FCG0_SRAMH         (0x00000001UL)
#define PWC_FCG0_SRAM1_POS     (4U)
#define PWC_FCG0_SRAM1         (0x00000010UL)
#define PWC_FCG0_PLA_POS       (11U)
#define PWC_FCG0_PLA           (0x00000800UL)
#define PWC_FCG0_DMA1_POS      (14U)
#define PWC_FCG0_DMA1          (0x00004000UL)
#define PWC_FCG0_DMA2_POS      (15U)
#define PWC_FCG0_DMA2          (0x00008000UL)
#define PWC_FCG0_FCM_POS       (16U)
#define PWC_FCG0_FCM           (0x00010000UL)
#define PWC_FCG0_AOS_POS       (17U)
#define PWC_FCG0_AOS           (0x00020000UL)
#define PWC_FCG0_CTC_POS       (18U)
#define PWC_FCG0_CTC           (0x00040000UL)
#define PWC_FCG0_CORDIC_POS    (19U)
#define PWC_FCG0_CORDIC        (0x00080000UL)
#define PWC_FCG0_SKE_POS       (20U)
#define PWC_FCG0_SKE           (0x00100000UL)
#define PWC_FCG0_HASH_POS      (21U)
#define PWC_FCG0_HASH          (0x00200000UL)
#define PWC_FCG0_TRNG_POS      (22U)
#define PWC_FCG0_TRNG          (0x00400000UL)
#define PWC_FCG0_CRC_POS       (23U)
#define PWC_FCG0_CRC           (0x00800000UL)
#define PWC_FCG0_PID_POS       (25U)
#define PWC_FCG0_PID           (0x02000000UL)
#define PWC_FCG0_PID_CMP_POS   (26U)
#define PWC_FCG0_PID_CMP       (0x04000000UL)
#define PWC_FCG0_XCMP_POS      (29U)
#define PWC_FCG0_XCMP          (0x20000000UL)
#define PWC_FCG0_SDFM_POS      (30U)
#define PWC_FCG0_SDFM          (0x40000000UL)
#define PWC_FCG0_DSOGI_PLL_POS (31U)
#define PWC_FCG0_DSOGI_PLL     (0x80000000UL)

/* Bit definition for PWC_FCG1 register */
#define PWC_FCG1_I2C1_POS  (4U)
#define PWC_FCG1_I2C1      (0x00000010UL)
#define PWC_FCG1_I2C2_POS  (5U)
#define PWC_FCG1_I2C2      (0x00000020UL)
#define PWC_FCG1_I2C3_POS  (6U)
#define PWC_FCG1_I2C3      (0x00000040UL)
#define PWC_FCG1_SPI1_POS  (16U)
#define PWC_FCG1_SPI1      (0x00010000UL)
#define PWC_FCG1_SPI2_POS  (17U)
#define PWC_FCG1_SPI2      (0x00020000UL)
#define PWC_FCG1_SPI3_POS  (18U)
#define PWC_FCG1_SPI3      (0x00040000UL)
#define PWC_FCG1_FMAC_POS  (24U)
#define PWC_FCG1_FMAC      (0x01000000UL)
#define PWC_FCG1_MCAN1_POS (28U)
#define PWC_FCG1_MCAN1     (0x10000000UL)
#define PWC_FCG1_MCAN2_POS (29U)
#define PWC_FCG1_MCAN2     (0x20000000UL)
#define PWC_FCG1_MCAN3_POS (30U)
#define PWC_FCG1_MCAN3     (0x40000000UL)

