MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for PWC_FCG2 register */
#define PWC_FCG2_TMR6_1_POS  (0U)
#define PWC_FCG2_TMR6_1      (0x00000001UL)
#define PWC_FCG2_TMR6_2_POS  (1U)
#define PWC_FCG2_TMR6_2      (0x00000002UL)
#define PWC_FCG2_TMR6_3_POS  (2U)
#define PWC_FCG2_TMR6_3      (0x00000004UL)
#define PWC_FCG2_TMR6_4_POS  (3U)
#define PWC_FCG2_TMR6_4      (0x00000008UL)
#define PWC_FCG2_TMR6_5_POS  (4U)
#define PWC_FCG2_TMR6_5      (0x00000010UL)
#define PWC_FCG2_TMR6_6_POS  (5U)
#define PWC_FCG2_TMR6_6      (0x00000020UL)
#define PWC_FCG2_TMR0_1_POS  (12U)
#define PWC_FCG2_TMR0_1      (0x00001000UL)
#define PWC_FCG2_TMR0_2_POS  (13U)
#define PWC_FCG2_TMR0_2      (0x00002000UL)
#define PWC_FCG2_EMB_POS     (15U)
#define PWC_FCG2_EMB         (0x00008000UL)
#define PWC_FCG2_HRPWM_1_POS (16U)
#define PWC_FCG2_HRPWM_1     (0x00010000UL)
#define PWC_FCG2_HRPWM_2_POS (17U)
#define PWC_FCG2_HRPWM_2     (0x00020000UL)
#define PWC_FCG2_HRPWM_3_POS (18U)
#define PWC_FCG2_HRPWM_3     (0x00040000UL)
#define PWC_FCG2_HRPWM_4_POS (19U)
#define PWC_FCG2_HRPWM_4     (0x00080000UL)
#define PWC_FCG2_HRPWM_5_POS (20U)
#define PWC_FCG2_HRPWM_5     (0x00100000UL)
#define PWC_FCG2_HRPWM_6_POS (21U)
#define PWC_FCG2_HRPWM_6     (0x00200000UL)
#define PWC_FCG2_HRPWM_7_POS (22U)
#define PWC_FCG2_HRPWM_7     (0x00400000UL)
#define PWC_FCG2_HRPWM_8_POS (23U)
#define PWC_FCG2_HRPWM_8     (0x00800000UL)
#define PWC_FCG2_TRLPWM_POS  (30U)
#define PWC_FCG2_TRLPWM      (0x40000000UL)
#define PWC_FCG2_XBAR_POS    (31U)
#define PWC_FCG2_XBAR        (0x80000000UL)

/* Bit definition for PWC_FCG3 register */
#define PWC_FCG3_ADC1_POS   (0U)
#define PWC_FCG3_ADC1       (0x00000001UL)
#define PWC_FCG3_ADC2_POS   (1U)
#define PWC_FCG3_ADC2       (0x00000002UL)
#define PWC_FCG3_ADC3_POS   (2U)
#define PWC_FCG3_ADC3       (0x00000004UL)
#define PWC_FCG3_CMBIAS_POS (3U)
#define PWC_FCG3_CMBIAS     (0x00000008UL)
#define PWC_FCG3_DAC1_POS   (4U)
#define PWC_FCG3_DAC1       (0x00000010UL)
#define PWC_FCG3_DAC2_POS   (5U)
#define PWC_FCG3_DAC2       (0x00000020UL)
#define PWC_FCG3_DAC3_POS   (6U)
#define PWC_FCG3_DAC3       (0x00000040UL)
#define PWC_FCG3_DAC4_POS   (7U)
#define PWC_FCG3_DAC4       (0x00000080UL)
#define PWC_FCG3_CMP12_POS  (8U)
#define PWC_FCG3_CMP12      (0x00000100UL)
#define PWC_FCG3_CMP34_POS  (9U)
#define PWC_FCG3_CMP34      (0x00000200UL)
#define PWC_FCG3_CMP56_POS  (10U)
#define PWC_FCG3_CMP56      (0x00000400UL)
#define PWC_FCG3_CMP78_POS  (11U)
#define PWC_FCG3_CMP78      (0x00000800UL)
#define PWC_FCG3_OTS_POS    (12U)
#define PWC_FCG3_OTS        (0x00001000UL)
#define PWC_FCG3_VREF_POS   (13U)
#define PWC_FCG3_VREF       (0x00002000UL)
#define PWC_FCG3_ADC4_POS   (14U)
#define PWC_FCG3_ADC4       (0x00004000UL)
#define PWC_FCG3_USART1_POS (20U)
#define PWC_FCG3_USART1     (0x00100000UL)
#define PWC_FCG3_USART2_POS (21U)
#define PWC_FCG3_USART2     (0x00200000UL)
#define PWC_FCG3_USART3_POS (22U)
#define PWC_FCG3_USART3     (0x00400000UL)
#define PWC_FCG3_USART4_POS (23U)
#define PWC_FCG3_USART4     (0x00800000UL)

/* Bit definition for PWC_FCG0PC register */
#define PWC_FCG0PC_PRT0_POS     (0U)
#define PWC_FCG0PC_PRT0         (0x00000001UL)
#define PWC_FCG0PC_FCG0PCWE_POS (16U)
#define PWC_FCG0PC_FCG0PCWE     (0xFFFF0000UL)

/* Bit definition for PWC_PWRC1 register */
#define PWC_PWRC1_VPLLSD   (0x03U)
#define PWC_PWRC1_VPLLSD_0 (0x01U)
#define PWC_PWRC1_VPLLSD_1 (0x02U)

/* Bit definition for PWC_PWRC4 register */
#define PWC_PWRC4_ADBUFS_POS (6U)
#define PWC_PWRC4_ADBUFS     (0x40U)
#define PWC_PWRC4_ADBUFE_POS (7U)
#define PWC_PWRC4_ADBUFE     (0x80U)

/* Bit definition for PWC_PVDCR0 register */
#define PWC_PVDCR0_EXVCCINEN_POS (0U)
#define PWC_PVDCR0_EXVCCINEN     (0x01U)
#define PWC_PVDCR0_PVD1EN_POS    (5U)
#define PWC_PVDCR0_PVD1EN        (0x20U)
#define PWC_PVDCR0_PVD2EN_POS    (6U)
#define PWC_PVDCR0_PVD2EN        (0x40U)

/* Bit definition for PWC_PVDCR1 register */
#define PWC_PVDCR1_PVD1IRE_POS   (0U)
#define PWC_PVDCR1_PVD1IRE       (0x01U)
#define PWC_PVDCR1_PVD1IRS_POS   (1U)
#define PWC_PVDCR1_PVD1IRS       (0x02U)
#define PWC_PVDCR1_PVD1CMPOE_POS (2U)
#define PWC_PVDCR1_PVD1CMPOE     (0x04U)
#define PWC_PVDCR1_PVD2IRE_POS   (4U)
#define PWC_PVDCR1_PVD2IRE       (0x10U)
#define PWC_PVDCR1_PVD2IRS_POS   (5U)
#define PWC_PVDCR1_PVD2IRS       (0x20U)
#define PWC_PVDCR1_PVD2CMPOE_POS (6U)
#define PWC_PVDCR1_PVD2CMPOE     (0x40U)

/* Bit definition for PWC_PVDFCR register */
#define PWC_PVDFCR_PVD1NFDIS_POS (0U)
#define PWC_PVDFCR_PVD1NFDIS     (0x01U)
#define PWC_PVDFCR_PVD1NFCKS_POS (1U)
#define PWC_PVDFCR_PVD1NFCKS     (0x06U)
#define PWC_PVDFCR_PVD1NFCKS_0   (0x02U)
#define PWC_PVDFCR_PVD1NFCKS_1   (0x04U)
#define PWC_PVDFCR_PVD2NFDIS_POS (4U)
#define PWC_PVDFCR_PVD2NFDIS     (0x10U)
#define PWC_PVDFCR_PVD2NFCKS_POS (5U)
#define PWC_PVDFCR_PVD2NFCKS     (0x60U)
#define PWC_PVDFCR_PVD2NFCKS_0   (0x20U)
#define PWC_PVDFCR_PVD2NFCKS_1   (0x40U)

/* Bit definition for PWC_PVDLCR register */
#define PWC_PVDLCR_PVD1LVL_POS (0U)
#define PWC_PVDLCR_PVD1LVL     (0x07U)
#define PWC_PVDLCR_PVD2LVL_POS (4U)
#define PWC_PVDLCR_PVD2LVL     (0x70U)

/* Bit definition for PWC_PWRC6 register */
#define PWC_PWRC6_SWRCMP_POS   (0U)
#define PWC_PWRC6_SWRCMP       (0x01U)
#define PWC_PWRC6_WDRCMP_POS   (1U)
#define PWC_PWRC6_WDRCMP       (0x02U)
#define PWC_PWRC6_SWRIOCLR_POS (2U)
#define PWC_PWRC6_SWRIOCLR     (0x04U)
#define PWC_PWRC6_WDRIOCLR_POS (3U)
#define PWC_PWRC6_WDRIOCLR     (0x08U)
#define PWC_PWRC6_SWRDAC_POS   (4U)
#define PWC_PWRC6_SWRDAC       (0x10U)
#define PWC_PWRC6_WDRDAC_POS   (5U)
#define PWC_PWRC6_WDRDAC       (0x20U)
#define PWC_PWRC6_SWRTNE_POS   (6U)
#define PWC_PWRC6_SWRTNE       (0x40U)
#define PWC_PWRC6_WDRTNE_POS   (7U)
#define PWC_PWRC6_WDRTNE       (0x80U)

/* Bit definition for PWC_RAMPC0 register */
#define PWC_RAMPC0_RAMPDC0_POS (0U)
#define PWC_RAMPC0_RAMPDC0     (0x00000001UL)
#define PWC_RAMPC0_RAMPDC1_POS (1U)
#define PWC_RAMPC0_RAMPDC1     (0x00000002UL)
#define PWC_RAMPC0_RAMPDC2_POS (2U)
#define PWC_RAMPC0_RAMPDC2     (0x00000004UL)
#define PWC_RAMPC0_RAMPDC7_POS (7U)
#define PWC_RAMPC0_RAMPDC7     (0x00000080UL)
#define PWC_RAMPC0_RAMPDC8_POS (8U)
#define PWC_RAMPC0_RAMPDC8     (0x00000100UL)

/* Bit definition for PWC_PRAMLPC register */
#define PWC_PRAMLPC_PRAMPDC2_POS  (2U)
#define PWC_PRAMLPC_PRAMPDC2      (0x00000004UL)
#define PWC_PRAMLPC_PRAMPDC5_POS  (5U)
#define PWC_PRAMLPC_PRAMPDC5      (0x00000020UL)
#define PWC_PRAMLPC_PRAMPDC6_POS  (6U)
#define PWC_PRAMLPC_PRAMPDC6      (0x00000040UL)
#define PWC_PRAMLPC_PRAMPDC11_POS (11U)
#define PWC_PRAMLPC_PRAMPDC11     (0x00000800UL)

/* Bit definition for PWC_LPMCSR register */
#define PWC_LPMCSR_LPMF (0x0001U)

/* Bit definition for PWC_LPMCSCR register */
#define PWC_LPMCSCR_LPMFC (0x0001U)

/* Bit definition for PWC_PVDICR register */
#define PWC_PVDICR_PVD1NMIS_POS (0U)
#define PWC_PVDICR_PVD1NMIS     (0x01U)
#define PWC_PVDICR_PVD1EDGS_POS (1U)
#define PWC_PVDICR_PVD1EDGS     (0x06U)
#define PWC_PVDICR_PVD1EDGS_0   (0x02U)
#define PWC_PVDICR_PVD1EDGS_1   (0x04U)
#define PWC_PVDICR_PVD2NMIS_POS (4U)
#define PWC_PVDICR_PVD2NMIS     (0x10U)
#define PWC_PVDICR_PVD2EDGS_POS (5U)
#define PWC_PVDICR_PVD2EDGS     (0x60U)
#define PWC_PVDICR_PVD2EDGS_0   (0x20U)
#define PWC_PVDICR_PVD2EDGS_1   (0x40U)

/* Bit definition for PWC_PVDDSR register */
#define PWC_PVDDSR_PVD1MON_POS    (0U)
#define PWC_PVDDSR_PVD1MON        (0x01U)
#define PWC_PVDDSR_PVD1DETFLG_POS (1U)
#define PWC_PVDDSR_PVD1DETFLG     (0x02U)
#define PWC_PVDDSR_PVD2MON_POS    (4U)
#define PWC_PVDDSR_PVD2MON        (0x10U)
#define PWC_PVDDSR_PVD2DETFLG_POS (5U)
#define PWC_PVDDSR_PVD2DETFLG     (0x20U)

/* Bit definition for PWC_STPMCR register */
#define PWC_STPMCR_FLNWT_POS  (0U)
#define PWC_STPMCR_FLNWT      (0x0001U)
#define PWC_STPMCR_CKSMRC_POS (1U)
#define PWC_STPMCR_CKSMRC     (0x0002U)
#define PWC_STPMCR_STOP_POS   (15U)
#define PWC_STPMCR_STOP       (0x8000U)

/* Bit definition for PWC_FPRC register */
#define PWC_FPRC_FPRCB0_POS (0U)
#define PWC_FPRC_FPRCB0     (0x0001U)
#define PWC_FPRC_FPRCB1_POS (1U)
#define PWC_FPRC_FPRCB1     (0x0002U)
#define PWC_FPRC_FPRCB3_POS (3U)
#define PWC_FPRC_FPRCB3     (0x0008U)
#define PWC_FPRC_FPRCWE_POS (8U)
#define PWC_FPRC_FPRCWE     (0xFF00U)

