MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral RMU
 *******************************************************************************/
/* Bit definition for RMU_FRST0 register */
#define RMU_FRST0_ERMU_POS      (8U)
#define RMU_FRST0_ERMU          (0x00000100UL)
#define RMU_FRST0_PLA_POS       (11U)
#define RMU_FRST0_PLA           (0x00000800UL)
#define RMU_FRST0_DMA1_POS      (14U)
#define RMU_FRST0_DMA1          (0x00004000UL)
#define RMU_FRST0_DMA2_POS      (15U)
#define RMU_FRST0_DMA2          (0x00008000UL)
#define RMU_FRST0_FCM_POS       (16U)
#define RMU_FRST0_FCM           (0x00010000UL)
#define RMU_FRST0_AOS_POS       (17U)
#define RMU_FRST0_AOS           (0x00020000UL)
#define RMU_FRST0_CTC_POS       (18U)
#define RMU_FRST0_CTC           (0x00040000UL)
#define RMU_FRST0_CORDIC_POS    (19U)
#define RMU_FRST0_CORDIC        (0x00080000UL)
#define RMU_FRST0_SKE_POS       (20U)
#define RMU_FRST0_SKE           (0x00100000UL)
#define RMU_FRST0_HASH_POS      (21U)
#define RMU_FRST0_HASH          (0x00200000UL)
#define RMU_FRST0_TRNG_POS      (22U)
#define RMU_FRST0_TRNG          (0x00400000UL)
#define RMU_FRST0_CRC_POS       (23U)
#define RMU_FRST0_CRC           (0x00800000UL)
#define RMU_FRST0_PID_POS       (25U)
#define RMU_FRST0_PID           (0x02000000UL)
#define RMU_FRST0_PID_CMP_POS   (26U)
#define RMU_FRST0_PID_CMP       (0x04000000UL)
#define RMU_FRST0_XCMP_POS      (29U)
#define RMU_FRST0_XCMP          (0x20000000UL)
#define RMU_FRST0_SDFM_POS      (30U)
#define RMU_FRST0_SDFM          (0x40000000UL)
#define RMU_FRST0_DSOGI_PLL_POS (31U)
#define RMU_FRST0_DSOGI_PLL     (0x80000000UL)

/* Bit definition for RMU_FRST1 register */
#define RMU_FRST1_I2C1_POS  (4U)
#define RMU_FRST1_I2C1      (0x00000010UL)
#define RMU_FRST1_I2C2_POS  (5U)
#define RMU_FRST1_I2C2      (0x00000020UL)
#define RMU_FRST1_I2C3_POS  (6U)
#define RMU_FRST1_I2C3      (0x00000040UL)
#define RMU_FRST1_SPI1_POS  (16U)
#define RMU_FRST1_SPI1      (0x00010000UL)
#define RMU_FRST1_SPI2_POS  (17U)
#define RMU_FRST1_SPI2      (0x00020000UL)
#define RMU_FRST1_SPI3_POS  (18U)
#define RMU_FRST1_SPI3      (0x00040000UL)
#define RMU_FRST1_FMAC_POS  (24U)
#define RMU_FRST1_FMAC      (0x01000000UL)
#define RMU_FRST1_MCAN1_POS (28U)
#define RMU_FRST1_MCAN1     (0x10000000UL)
#define RMU_FRST1_MCAN2_POS (29U)
#define RMU_FRST1_MCAN2     (0x20000000UL)
#define RMU_FRST1_MCAN3_POS (30U)
#define RMU_FRST1_MCAN3     (0x40000000UL)

/* Bit definition for RMU_FRST2 register */
#define RMU_FRST2_TMR6_POS   (0U)
#define RMU_FRST2_TMR6       (0x00000001UL)
#define RMU_FRST2_TMR0_1_POS (12U)
#define RMU_FRST2_TMR0_1     (0x00001000UL)
#define RMU_FRST2_TMR0_2_POS (13U)
#define RMU_FRST2_TMR0_2     (0x00002000UL)
#define RMU_FRST2_EMB_POS    (15U)
#define RMU_FRST2_EMB        (0x00008000UL)
#define RMU_FRST2_HRPWM_POS  (16U)
#define RMU_FRST2_HRPWM      (0x00010000UL)
#define RMU_FRST2_TRLPWM_POS (30U)
#define RMU_FRST2_TRLPWM     (0x40000000UL)
#define RMU_FRST2_XBAR_POS   (31U)
#define RMU_FRST2_XBAR       (0x80000000UL)

/* Bit definition for RMU_FRST3 register */
#define RMU_FRST3_ADC1_POS   (0U)
#define RMU_FRST3_ADC1       (0x00000001UL)
#define RMU_FRST3_ADC2_POS   (1U)
#define RMU_FRST3_ADC2       (0x00000002UL)
#define RMU_FRST3_ADC3_POS   (2U)
#define RMU_FRST3_ADC3       (0x00000004UL)
#define RMU_FRST3_ADC4_POS   (3U)
#define RMU_FRST3_ADC4       (0x00000008UL)
#define RMU_FRST3_DAC1_POS   (4U)
#define RMU_FRST3_DAC1       (0x00000010UL)
#define RMU_FRST3_DAC2_POS   (5U)
#define RMU_FRST3_DAC2       (0x00000020UL)
#define RMU_FRST3_DAC3_POS   (6U)
#define RMU_FRST3_DAC3       (0x00000040UL)
#define RMU_FRST3_DAC4_POS   (7U)
#define RMU_FRST3_DAC4       (0x00000080UL)
#define RMU_FRST3_CMP12_POS  (8U)
#define RMU_FRST3_CMP12      (0x00000100UL)
#define RMU_FRST3_CMP34_POS  (9U)
#define RMU_FRST3_CMP34      (0x00000200UL)
#define RMU_FRST3_CMP56_POS  (10U)
#define RMU_FRST3_CMP56      (0x00000400UL)
#define RMU_FRST3_CMP78_POS  (11U)
#define RMU_FRST3_CMP78      (0x00000800UL)
#define RMU_FRST3_OTS_POS    (12U)
#define RMU_FRST3_OTS        (0x00001000UL)
#define RMU_FRST3_VREF_POS   (13U)
#define RMU_FRST3_VREF       (0x00002000UL)
#define RMU_FRST3_USART1_POS (20U)
#define RMU_FRST3_USART1     (0x00100000UL)
#define RMU_FRST3_USART2_POS (21U)
#define RMU_FRST3_USART2     (0x00200000UL)
#define RMU_FRST3_USART3_POS (22U)
#define RMU_FRST3_USART3     (0x00400000UL)
#define RMU_FRST3_USART4_POS (23U)
#define RMU_FRST3_USART4     (0x00800000UL)

/* Bit definition for RMU_PRSTCR0 register */
#define RMU_PRSTCR0_LKUPREN_POS (5U)
#define RMU_PRSTCR0_LKUPREN     (0x20U)

/* Bit definition for RMU_RSTF0 register */
#define RMU_RSTF0_PORF_POS    (0U)
#define RMU_RSTF0_PORF        (0x00000001UL)
#define RMU_RSTF0_PINRF_POS   (1U)
#define RMU_RSTF0_PINRF       (0x00000002UL)
#define RMU_RSTF0_BORF_POS    (2U)
#define RMU_RSTF0_BORF        (0x00000004UL)
#define RMU_RSTF0_PVD1RF_POS  (3U)
#define RMU_RSTF0_PVD1RF      (0x00000008UL)
#define RMU_RSTF0_PVD2RF_POS  (4U)
#define RMU_RSTF0_PVD2RF      (0x00000010UL)
#define RMU_RSTF0_WDRF_POS    (5U)
#define RMU_RSTF0_WDRF        (0x00000020UL)
#define RMU_RSTF0_SWDRF_POS   (6U)
#define RMU_RSTF0_SWDRF       (0x00000040UL)
#define RMU_RSTF0_SWRF_POS    (8U)
#define RMU_RSTF0_SWRF        (0x00000100UL)
#define RMU_RSTF0_MPUERF_POS  (9U)
#define RMU_RSTF0_MPUERF      (0x00000200UL)
#define RMU_RSTF0_RAECRF_POS  (11U)
#define RMU_RSTF0_RAECRF      (0x00000800UL)
#define RMU_RSTF0_CKFERF_POS  (12U)
#define RMU_RSTF0_CKFERF      (0x00001000UL)
#define RMU_RSTF0_XTALERF_POS (13U)
#define RMU_RSTF0_XTALERF     (0x00002000UL)
#define RMU_RSTF0_LKUPRF_POS  (14U)
#define RMU_RSTF0_LKUPRF      (0x00004000UL)
#define RMU_RSTF0_FLECRF_POS  (15U)
#define RMU_RSTF0_FLECRF      (0x00008000UL)
#define RMU_RSTF0_ERMURF_POS  (16U)
#define RMU_RSTF0_ERMURF      (0x00010000UL)
#define RMU_RSTF0_MULTIRF_POS (30U)
#define RMU_RSTF0_MULTIRF     (0x40000000UL)
#define RMU_RSTF0_CLRF_POS    (31U)
#define RMU_RSTF0_CLRF        (0x80000000UL)

