MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral SDFM
 *******************************************************************************/
/* Bit definition for SDFM_CHCFGR1 register */
#define SDFM_CHCFGR1_SITP_POS       (0U)
#define SDFM_CHCFGR1_SITP           (0x00000003UL)
#define SDFM_CHCFGR1_SITP_0         (0x00000001UL)
#define SDFM_CHCFGR1_SITP_1         (0x00000002UL)
#define SDFM_CHCFGR1_SPICKSEL_POS   (2U)
#define SDFM_CHCFGR1_SPICKSEL       (0x0000000CUL)
#define SDFM_CHCFGR1_SPICKSEL_0     (0x00000004UL)
#define SDFM_CHCFGR1_SPICKSEL_1     (0x00000008UL)
#define SDFM_CHCFGR1_SCDEN_POS      (5U)
#define SDFM_CHCFGR1_SCDEN          (0x00000020UL)
#define SDFM_CHCFGR1_CKABEN_POS     (6U)
#define SDFM_CHCFGR1_CKABEN         (0x00000040UL)
#define SDFM_CHCFGR1_CHEN_POS       (7U)
#define SDFM_CHCFGR1_CHEN           (0x00000080UL)
#define SDFM_CHCFGR1_CHINSEL_POS    (8U)
#define SDFM_CHCFGR1_CHINSEL        (0x00000100UL)
#define SDFM_CHCFGR1_SDCLKSYNC_POS  (9U)
#define SDFM_CHCFGR1_SDCLKSYNC      (0x00000200UL)
#define SDFM_CHCFGR1_SDDATASYNC_POS (10U)
#define SDFM_CHCFGR1_SDDATASYNC     (0x00000400UL)
#define SDFM_CHCFGR1_SDCLKSEL_POS   (11U)
#define SDFM_CHCFGR1_SDCLKSEL       (0x00000800UL)
#define SDFM_CHCFGR1_DATMPX_POS     (12U)
#define SDFM_CHCFGR1_DATMPX         (0x00003000UL)
#define SDFM_CHCFGR1_DATMPX_0       (0x00001000UL)
#define SDFM_CHCFGR1_DATMPX_1       (0x00002000UL)
#define SDFM_CHCFGR1_DATPACK_POS    (14U)
#define SDFM_CHCFGR1_DATPACK        (0x0000C000UL)
#define SDFM_CHCFGR1_DATPACK_0      (0x00004000UL)
#define SDFM_CHCFGR1_DATPACK_1      (0x00008000UL)
#define SDFM_CHCFGR1_CKOUTDIV_POS   (16U)
#define SDFM_CHCFGR1_CKOUTDIV       (0x00FF0000UL)
#define SDFM_CHCFGR1_CKOUTSRC_POS   (30U)
#define SDFM_CHCFGR1_CKOUTSRC       (0x40000000UL)
#define SDFM_CHCFGR1_SDFMEN_POS     (31U)
#define SDFM_CHCFGR1_SDFMEN         (0x80000000UL)

/* Bit definition for SDFM_CHCFGR2 register */
#define SDFM_CHCFGR2_DTRBS_POS  (3U)
#define SDFM_CHCFGR2_DTRBS      (0x000000F8UL)
#define SDFM_CHCFGR2_OFFSET_POS (8U)
#define SDFM_CHCFGR2_OFFSET     (0xFFFFFF00UL)

/* Bit definition for SDFM_CHAWSCDR register */
#define SDFM_CHAWSCDR_SCDT_POS   (0U)
#define SDFM_CHAWSCDR_SCDT       (0x000000FFUL)
#define SDFM_CHAWSCDR_BKSCD_POS  (12U)
#define SDFM_CHAWSCDR_BKSCD      (0x0000F000UL)
#define SDFM_CHAWSCDR_AWFOSR_POS (16U)
#define SDFM_CHAWSCDR_AWFOSR     (0x001F0000UL)
#define SDFM_CHAWSCDR_AWFORD_POS (22U)
#define SDFM_CHAWSCDR_AWFORD     (0x00C00000UL)
#define SDFM_CHAWSCDR_AWFORD_0   (0x00400000UL)
#define SDFM_CHAWSCDR_AWFORD_1   (0x00800000UL)

/* Bit definition for SDFM_CHWDATAR register */
#define SDFM_CHWDATAR_WDATR (0x0000FFFFUL)

/* Bit definition for SDFM_CHDATINR register */
#define SDFM_CHDATINR_INDAT0_POS (0U)
#define SDFM_CHDATINR_INDAT0     (0x0000FFFFUL)
#define SDFM_CHDATINR_INDAT1_POS (16U)
#define SDFM_CHDATINR_INDAT1     (0xFFFF0000UL)

/* Bit definition for SDFM_CHDLYR register */
#define SDFM_CHDLYR_PSSKP (0x0000003FUL)

/* Bit definition for SDFM_CHHLTZ register */
#define SDFM_CHHLTZ_HLTZ (0x0000FFFFUL)

/* Bit definition for SDFM_FLTCR1 register */
#define SDFM_FLTCR1_DFEN_POS       (0U)
#define SDFM_FLTCR1_DFEN           (0x00000001UL)
#define SDFM_FLTCR1_JSWSTART_POS   (1U)
#define SDFM_FLTCR1_JSWSTART       (0x00000002UL)
#define SDFM_FLTCR1_JSYNC_POS      (3U)
#define SDFM_FLTCR1_JSYNC          (0x00000008UL)
#define SDFM_FLTCR1_JSCAN_POS      (4U)
#define SDFM_FLTCR1_JSCAN          (0x00000010UL)
#define SDFM_FLTCR1_JDMAEN_POS     (5U)
#define SDFM_FLTCR1_JDMAEN         (0x00000020UL)
#define SDFM_FLTCR1_JSCAN_TYPE_POS (6U)
#define SDFM_FLTCR1_JSCAN_TYPE     (0x00000040UL)
#define SDFM_FLTCR1_JEXTSEL_POS    (8U)
#define SDFM_FLTCR1_JEXTSEL        (0x00001F00UL)
#define SDFM_FLTCR1_JEXTEN_POS     (13U)
#define SDFM_FLTCR1_JEXTEN         (0x00006000UL)
#define SDFM_FLTCR1_JEXTEN_0       (0x00002000UL)
#define SDFM_FLTCR1_JEXTEN_1       (0x00004000UL)
#define SDFM_FLTCR1_RSWSTART_POS   (17U)
#define SDFM_FLTCR1_RSWSTART       (0x00020000UL)
#define SDFM_FLTCR1_RCONT_POS      (18U)
#define SDFM_FLTCR1_RCONT          (0x00040000UL)
#define SDFM_FLTCR1_RSYNC_POS      (19U)
#define SDFM_FLTCR1_RSYNC          (0x00080000UL)
#define SDFM_FLTCR1_RDMAEN_POS     (21U)
#define SDFM_FLTCR1_RDMAEN         (0x00200000UL)
#define SDFM_FLTCR1_RCH_POS        (24U)
#define SDFM_FLTCR1_RCH            (0x07000000UL)
#define SDFM_FLTCR1_FAST_POS       (29U)
#define SDFM_FLTCR1_FAST           (0x20000000UL)
#define SDFM_FLTCR1_AWFSEL_POS     (30U)
#define SDFM_FLTCR1_AWFSEL         (0x40000000UL)
#define SDFM_FLTCR1_OVDEL_POS      (31U)
#define SDFM_FLTCR1_OVDEL          (0x80000000UL)

/* Bit definition for SDFM_FLTCR2 register */
#define SDFM_FLTCR2_JEOCIE_POS (0U)
#define SDFM_FLTCR2_JEOCIE     (0x00000001UL)
#define SDFM_FLTCR2_REOCIE_POS (1U)
#define SDFM_FLTCR2_REOCIE     (0x00000002UL)
#define SDFM_FLTCR2_JOVRIE_POS (2U)
#define SDFM_FLTCR2_JOVRIE     (0x00000004UL)
#define SDFM_FLTCR2_ROVRIE_POS (3U)
#define SDFM_FLTCR2_ROVRIE     (0x00000008UL)
#define SDFM_FLTCR2_AWDIE_POS  (4U)
#define SDFM_FLTCR2_AWDIE      (0x00000010UL)
#define SDFM_FLTCR2_SCDIE_POS  (5U)
#define SDFM_FLTCR2_SCDIE      (0x00000020UL)
#define SDFM_FLTCR2_CKABIE_POS (6U)
#define SDFM_FLTCR2_CKABIE     (0x00000040UL)
#define SDFM_FLTCR2_EXCH_POS   (8U)
#define SDFM_FLTCR2_EXCH       (0x0000FF00UL)
#define SDFM_FLTCR2_AWDCH_POS  (16U)
#define SDFM_FLTCR2_AWDCH      (0x00FF0000UL)

/* Bit definition for SDFM_FLTISR register */
#define SDFM_FLTISR_JEOCF_POS (0U)
#define SDFM_FLTISR_JEOCF     (0x00000001UL)
#define SDFM_FLTISR_REOCF_POS (1U)
#define SDFM_FLTISR_REOCF     (0x00000002UL)
#define SDFM_FLTISR_JOVRF_POS (2U)
#define SDFM_FLTISR_JOVRF     (0x00000004UL)
#define SDFM_FLTISR_ROVRF_POS (3U)
#define SDFM_FLTISR_ROVRF     (0x00000008UL)
#define SDFM_FLTISR_AWDF_POS  (4U)
#define SDFM_FLTISR_AWDF      (0x00000010UL)
#define SDFM_FLTISR_JCIP_POS  (13U)
#define SDFM_FLTISR_JCIP      (0x00002000UL)
#define SDFM_FLTISR_RCIP_POS  (14U)
#define SDFM_FLTISR_RCIP      (0x00004000UL)
#define SDFM_FLTISR_CKABF_POS (16U)
#define SDFM_FLTISR_CKABF     (0x00FF0000UL)
#define SDFM_FLTISR_SCDF_POS  (24U)
#define SDFM_FLTISR_SCDF      (0xFF000000UL)

