MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for SDFM_FLTICR register */
#define SDFM_FLTICR_CLRJEOCF_POS (0U)
#define SDFM_FLTICR_CLRJEOCF     (0x00000001UL)
#define SDFM_FLTICR_CLRJOVRF_POS (2U)
#define SDFM_FLTICR_CLRJOVRF     (0x00000004UL)
#define SDFM_FLTICR_CLRROVRF_POS (3U)
#define SDFM_FLTICR_CLRROVRF     (0x00000008UL)
#define SDFM_FLTICR_CLRCKABF_POS (16U)
#define SDFM_FLTICR_CLRCKABF     (0x00FF0000UL)
#define SDFM_FLTICR_CLRSCDF_POS  (24U)
#define SDFM_FLTICR_CLRSCDF      (0xFF000000UL)

/* Bit definition for SDFM_FLTJCHGR register */
#define SDFM_FLTJCHGR_JCHG (0x000000FFUL)

/* Bit definition for SDFM_FLTFCR register */
#define SDFM_FLTFCR_IOSR_POS (0U)
#define SDFM_FLTFCR_IOSR     (0x000000FFUL)
#define SDFM_FLTFCR_FOSR_POS (16U)
#define SDFM_FLTFCR_FOSR     (0x03FF0000UL)
#define SDFM_FLTFCR_FORD_POS (29U)
#define SDFM_FLTFCR_FORD     (0xE0000000UL)

/* Bit definition for SDFM_FLTJDATAR register */
#define SDFM_FLTJDATAR_JDATACH_POS (0U)
#define SDFM_FLTJDATAR_JDATACH     (0x00000007UL)
#define SDFM_FLTJDATAR_JDATA_POS   (8U)
#define SDFM_FLTJDATAR_JDATA       (0xFFFFFF00UL)

/* Bit definition for SDFM_FLTRDATAR register */
#define SDFM_FLTRDATAR_RDATACH_POS (0U)
#define SDFM_FLTRDATAR_RDATACH     (0x00000007UL)
#define SDFM_FLTRDATAR_RPEND_POS   (4U)
#define SDFM_FLTRDATAR_RPEND       (0x00000010UL)
#define SDFM_FLTRDATAR_RDATA_POS   (8U)
#define SDFM_FLTRDATAR_RDATA       (0xFFFFFF00UL)

/* Bit definition for SDFM_FLTAWHTR register */
#define SDFM_FLTAWHTR_BKAWH_POS (0U)
#define SDFM_FLTAWHTR_BKAWH     (0x0000000FUL)
#define SDFM_FLTAWHTR_AWHT_POS  (8U)
#define SDFM_FLTAWHTR_AWHT      (0xFFFFFF00UL)

/* Bit definition for SDFM_FLTAWLTR register */
#define SDFM_FLTAWLTR_BKAWL_POS (0U)
#define SDFM_FLTAWLTR_BKAWL     (0x0000000FUL)
#define SDFM_FLTAWLTR_AWLT_POS  (8U)
#define SDFM_FLTAWLTR_AWLT      (0xFFFFFF00UL)

/* Bit definition for SDFM_FLTAWSR register */
#define SDFM_FLTAWSR_AWLTF_POS (0U)
#define SDFM_FLTAWSR_AWLTF     (0x000000FFUL)
#define SDFM_FLTAWSR_AWHTF_POS (8U)
#define SDFM_FLTAWSR_AWHTF     (0x0000FF00UL)
#define SDFM_FLTAWSR_HZF_POS   (16U)
#define SDFM_FLTAWSR_HZF       (0x00FF0000UL)

/* Bit definition for SDFM_FLTAWCFR register */
#define SDFM_FLTAWCFR_CLRAWLTF_POS (0U)
#define SDFM_FLTAWCFR_CLRAWLTF     (0x000000FFUL)
#define SDFM_FLTAWCFR_CLRAWHTF_POS (8U)
#define SDFM_FLTAWCFR_CLRAWHTF     (0x0000FF00UL)
#define SDFM_FLTAWCFR_CLRHZF_POS   (16U)
#define SDFM_FLTAWCFR_CLRHZF       (0x00FF0000UL)

/* Bit definition for SDFM_FLTEXMAX register */
#define SDFM_FLTEXMAX_EXMAXCHCH_POS (0U)
#define SDFM_FLTEXMAX_EXMAXCHCH     (0x00000007UL)
#define SDFM_FLTEXMAX_EXMAX_POS     (8U)
#define SDFM_FLTEXMAX_EXMAX         (0xFFFFFF00UL)

/* Bit definition for SDFM_FLTEXMIN register */
#define SDFM_FLTEXMIN_EXMINCHCH_POS (0U)
#define SDFM_FLTEXMIN_EXMINCHCH     (0x00000007UL)
#define SDFM_FLTEXMIN_EXMIN_POS     (8U)
#define SDFM_FLTEXMIN_EXMIN         (0xFFFFFF00UL)

/* Bit definition for SDFM_FLTCNVTIMR register */
#define SDFM_FLTCNVTIMR_CNVCNT_POS (4U)
#define SDFM_FLTCNVTIMR_CNVCNT     (0xFFFFFFF0UL)

/* Bit definition for SDFM_FLTCNVTHRE register */
#define SDFM_FLTCNVTHRE_CNVTHRE (0x0000003FUL)

/* Bit definition for SDFM_FLTFIFOCTL register */
#define SDFM_FLTFIFOCTL_SDFFIL_POS     (0U)
#define SDFM_FLTFIFOCTL_SDFFIL         (0x0000000FUL)
#define SDFM_FLTFIFOCTL_WTSYNCEN_POS   (5U)
#define SDFM_FLTFIFOCTL_WTSYNCEN       (0x00000020UL)
#define SDFM_FLTFIFOCTL_FFSYNCLREN_POS (6U)
#define SDFM_FLTFIFOCTL_FFSYNCLREN     (0x00000040UL)
#define SDFM_FLTFIFOCTL_WTSCLREN_POS   (7U)
#define SDFM_FLTFIFOCTL_WTSCLREN       (0x00000080UL)
#define SDFM_FLTFIFOCTL_SDFFST_POS     (8U)
#define SDFM_FLTFIFOCTL_SDFFST         (0x00001F00UL)
#define SDFM_FLTFIFOCTL_WTSYNFLG_POS   (15U)
#define SDFM_FLTFIFOCTL_WTSYNFLG       (0x00008000UL)
#define SDFM_FLTFIFOCTL_WTSYNCLR_POS   (16U)
#define SDFM_FLTFIFOCTL_WTSYNCLR       (0x00010000UL)

/* Bit definition for SDFM_FLTDATFIFO register */
#define SDFM_FLTDATFIFO_FIFO_JDATACH_POS (0U)
#define SDFM_FLTDATFIFO_FIFO_JDATACH     (0x00000007UL)
#define SDFM_FLTDATFIFO_FIFO_JDATA_POS   (8U)
#define SDFM_FLTDATFIFO_FIFO_JDATA       (0xFFFFFF00UL)

/* Bit definition for SDFM_FLTAWHT2 register */
#define SDFM_FLTAWHT2_AWHT2_POS (16U)
#define SDFM_FLTAWHT2_AWHT2     (0xFFFF0000UL)

/* Bit definition for SDFM_FLTAWLT2 register */
#define SDFM_FLTAWLT2_AWLT2_POS (16U)
#define SDFM_FLTAWLT2_AWLT2     (0xFFFF0000UL)

/* Bit definition for SDFM_FLTCPARM register */
#define SDFM_FLTCPARM_EN_CEVT1_POS        (0U)
#define SDFM_FLTCPARM_EN_CEVT1            (0x00000001UL)
#define SDFM_FLTCPARM_EN_CEVT2_POS        (1U)
#define SDFM_FLTCPARM_EN_CEVT2            (0x00000002UL)
#define SDFM_FLTCPARM_HZEN_POS            (2U)
#define SDFM_FLTCPARM_HZEN                (0x00000004UL)
#define SDFM_FLTCPARM_CEVT1SEL_POS        (3U)
#define SDFM_FLTCPARM_CEVT1SEL            (0x00000018UL)
#define SDFM_FLTCPARM_CEVT1SEL_0          (0x00000008UL)
#define SDFM_FLTCPARM_CEVT1SEL_1          (0x00000010UL)
#define SDFM_FLTCPARM_CEVFILTER_EN_POS    (5U)
#define SDFM_FLTCPARM_CEVFILTER_EN        (0x00000020UL)
#define SDFM_FLTCPARM_CEVT2SEL_POS        (6U)
#define SDFM_FLTCPARM_CEVT2SEL            (0x000000C0UL)
#define SDFM_FLTCPARM_CEVT2SEL_0          (0x00000040UL)
#define SDFM_FLTCPARM_CEVT2SEL_1          (0x00000080UL)
#define SDFM_FLTCPARM_FILTER_CH_POS       (8U)
#define SDFM_FLTCPARM_FILTER_CH           (0x00000700UL)
#define SDFM_FLTCPARM_CEVT1DIGFILTSEL_POS (11U)
#define SDFM_FLTCPARM_CEVT1DIGFILTSEL     (0x00000800UL)
#define SDFM_FLTCPARM_CEVT2DIGFILTSEL_POS (12U)
#define SDFM_FLTCPARM_CEVT2DIGFILTSEL     (0x00001000UL)
#define SDFM_FLTCPARM_BK_CROSS_ZERO_POS   (16U)
#define SDFM_FLTCPARM_BK_CROSS_ZERO       (0x000F0000UL)
#define SDFM_FLTCPARM_FILINIT_POS         (31U)
#define SDFM_FLTCPARM_FILINIT             (0x80000000UL)

/* Bit definition for SDFM_FLTEVTFITCTL register */
#define SDFM_FLTEVTFITCTL_SAMPWIN1_POS (0U)
#define SDFM_FLTEVTFITCTL_SAMPWIN1     (0x0000001FUL)
#define SDFM_FLTEVTFITCTL_THRESH1_POS  (8U)
#define SDFM_FLTEVTFITCTL_THRESH1      (0x00001F00UL)
#define SDFM_FLTEVTFITCTL_SAMPWIN2_POS (16U)
#define SDFM_FLTEVTFITCTL_SAMPWIN2     (0x001F0000UL)
#define SDFM_FLTEVTFITCTL_THRESH2_POS  (24U)
#define SDFM_FLTEVTFITCTL_THRESH2      (0x1F000000UL)

