MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral SKE
 *******************************************************************************/
/* Bit definition for SKE_CTRL register */
#define SKE_CTRL_START (0x00000001UL)

/* Bit definition for SKE_CFG register */
#define SKE_CFG_ALG_POS       (0U)
#define SKE_CFG_ALG           (0x0000000FUL)
#define SKE_CFG_DEC_POS       (11U)
#define SKE_CFG_DEC           (0x00000800UL)
#define SKE_CFG_UP_CFG_POS    (12U)
#define SKE_CFG_UP_CFG        (0x00001000UL)
#define SKE_CFG_DMAEN_POS     (16U)
#define SKE_CFG_DMAEN         (0x00010000UL)
#define SKE_CFG_IRQEN_POS     (17U)
#define SKE_CFG_IRQEN         (0x00020000UL)
#define SKE_CFG_SEC_STAGE_POS (22U)
#define SKE_CFG_SEC_STAGE     (0x00C00000UL)
#define SKE_CFG_SEC_STAGE_0   (0x00400000UL)
#define SKE_CFG_SEC_STAGE_1   (0x00800000UL)
#define SKE_CFG_DATA_TYPE_POS (24U)
#define SKE_CFG_DATA_TYPE     (0x03000000UL)
#define SKE_CFG_DATA_TYPE_0   (0x01000000UL)
#define SKE_CFG_DATA_TYPE_1   (0x02000000UL)
#define SKE_CFG_MODE_POS      (28U)
#define SKE_CFG_MODE          (0xF0000000UL)

/* Bit definition for SKE_SR1 register */
#define SKE_SR1_BUSY_POS        (0U)
#define SKE_SR1_BUSY            (0x00000001UL)
#define SKE_SR1_MID_O_VALID_POS (1U)
#define SKE_SR1_MID_O_VALID     (0x00000002UL)

/* Bit definition for SKE_SR2 register */
#define SKE_SR2_CORE_DONE (0x00000001UL)

/* Bit definition for SKE_KEY register */
#define SKE_KEY (0xFFFFFFFFUL)

/* Bit definition for SKE_AAD register */
#define SKE_AAD (0xFFFFFFFFUL)

/* Bit definition for SKE_CLEN register */
#define SKE_CLEN (0xFFFFFFFFUL)

/* Bit definition for SKE_IV register */
#define SKE_IV (0xFFFFFFFFUL)

/* Bit definition for SKE_DIN_CR register */
#define SKE_DIN_CR_LAST_LEN_POS (0U)
#define SKE_DIN_CR_LAST_LEN     (0x000000FFUL)
#define SKE_DIN_CR_LAST_POS     (16U)
#define SKE_DIN_CR_LAST         (0x00010000UL)

/* Bit definition for SKE_DIN register */
#define SKE_DIN (0xFFFFFFFFUL)

/* Bit definition for SKE_DOUT register */
#define SKE_DOUT (0xFFFFFFFFUL)

/* Bit definition for SKE_VERSION register */
#define SKE_VERSION_MIR_POS     (0U)
#define SKE_VERSION_MIR         (0x0000000FUL)
#define SKE_VERSION_MAR_POS     (4U)
#define SKE_VERSION_MAR         (0x000000F0UL)
#define SKE_VERSION_PROJECT_POS (16U)
#define SKE_VERSION_PROJECT     (0xFFFF0000UL)

/* Bit definition for SKE_MID_IV register */
#define SKE_MID_IV (0xFFFFFFFFUL)

/* Bit definition for SKE_MID_MAC register */
#define SKE_MID_MAC (0xFFFFFFFFUL)

/* Bit definition for SKE_TOTAL_AAD register */
#define SKE_TOTAL_AAD (0xFFFFFFFFUL)

/* Bit definition for SKE_TOTAL_CLEN register */
#define SKE_TOTAL_CLEN (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral SPI
 *******************************************************************************/
/* Bit definition for SPI_DR register */
#define SPI_DR (0xFFFFFFFFUL)

/* Bit definition for SPI_CR register */
#define SPI_CR_SPIMDS_POS  (0U)
#define SPI_CR_SPIMDS      (0x00000001UL)
#define SPI_CR_TXMDS_POS   (1U)
#define SPI_CR_TXMDS       (0x00000002UL)
#define SPI_CR_RXMDS_POS   (2U)
#define SPI_CR_RXMDS       (0x00000004UL)
#define SPI_CR_MSTR_POS    (3U)
#define SPI_CR_MSTR        (0x00000008UL)
#define SPI_CR_SPLPBK_POS  (4U)
#define SPI_CR_SPLPBK      (0x00000010UL)
#define SPI_CR_SPLPBK2_POS (5U)
#define SPI_CR_SPLPBK2     (0x00000020UL)
#define SPI_CR_SPE_POS     (6U)
#define SPI_CR_SPE         (0x00000040UL)
#define SPI_CR_CSUSPE_POS  (7U)
#define SPI_CR_CSUSPE      (0x00000080UL)
#define SPI_CR_EIE_POS     (8U)
#define SPI_CR_EIE         (0x00000100UL)
#define SPI_CR_TXIE_POS    (9U)
#define SPI_CR_TXIE        (0x00000200UL)
#define SPI_CR_RXIE_POS    (10U)
#define SPI_CR_RXIE        (0x00000400UL)
#define SPI_CR_IDIE_POS    (11U)
#define SPI_CR_IDIE        (0x00000800UL)
#define SPI_CR_MODFE_POS   (12U)
#define SPI_CR_MODFE       (0x00001000UL)
#define SPI_CR_PATE_POS    (13U)
#define SPI_CR_PATE        (0x00002000UL)
#define SPI_CR_PAOE_POS    (14U)
#define SPI_CR_PAOE        (0x00004000UL)
#define SPI_CR_PAE_POS     (15U)
#define SPI_CR_PAE         (0x00008000UL)

/* Bit definition for SPI_CFG1 register */
#define SPI_CFG1_FTHLV_POS  (0U)
#define SPI_CFG1_FTHLV      (0x00000003UL)
#define SPI_CFG1_FTHLV_0    (0x00000001UL)
#define SPI_CFG1_FTHLV_1    (0x00000002UL)
#define SPI_CFG1_CTMDS_POS  (2U)
#define SPI_CFG1_CTMDS      (0x00000004UL)
#define SPI_CFG1_SPRDTD_POS (6U)
#define SPI_CFG1_SPRDTD     (0x00000040UL)
#define SPI_CFG1_SS0PV_POS  (8U)
#define SPI_CFG1_SS0PV      (0x00000100UL)
#define SPI_CFG1_SS1PV_POS  (9U)
#define SPI_CFG1_SS1PV      (0x00000200UL)
#define SPI_CFG1_SS2PV_POS  (10U)
#define SPI_CFG1_SS2PV      (0x00000400UL)
#define SPI_CFG1_SS3PV_POS  (11U)
#define SPI_CFG1_SS3PV      (0x00000800UL)
#define SPI_CFG1_CLKDIV_POS (12U)
#define SPI_CFG1_CLKDIV     (0x0000F000UL)
#define SPI_CFG1_MSSI_POS   (20U)
#define SPI_CFG1_MSSI       (0x00700000UL)
#define SPI_CFG1_MSSDL_POS  (24U)
#define SPI_CFG1_MSSDL      (0x07000000UL)
#define SPI_CFG1_MIDI_POS   (28U)
#define SPI_CFG1_MIDI       (0x70000000UL)

/* Bit definition for SPI_SR register */
#define SPI_SR_OVRERF_POS  (0U)
#define SPI_SR_OVRERF      (0x00000001UL)
#define SPI_SR_IDLNF_POS   (1U)
#define SPI_SR_IDLNF       (0x00000002UL)
#define SPI_SR_MODFERF_POS (2U)
#define SPI_SR_MODFERF     (0x00000004UL)
#define SPI_SR_PERF_POS    (3U)
#define SPI_SR_PERF        (0x00000008UL)
#define SPI_SR_UDRERF_POS  (4U)
#define SPI_SR_UDRERF      (0x00000010UL)
#define SPI_SR_TDEF_POS    (5U)
#define SPI_SR_TDEF        (0x00000020UL)
#define SPI_SR_FMIDLF_POS  (6U)
#define SPI_SR_FMIDLF      (0x00000040UL)
#define SPI_SR_RDFF_POS    (7U)
#define SPI_SR_RDFF        (0x00000080UL)

/* Bit definition for SPI_CFG2 register */
#define SPI_CFG2_CPHA_POS   (0U)
#define SPI_CFG2_CPHA       (0x00000001UL)
#define SPI_CFG2_CPOL_POS   (1U)
#define SPI_CFG2_CPOL       (0x00000002UL)
#define SPI_CFG2_MBR_POS    (2U)
#define SPI_CFG2_MBR        (0x0000000CUL)
#define SPI_CFG2_MBR_0      (0x00000004UL)
#define SPI_CFG2_MBR_1      (0x00000008UL)
#define SPI_CFG2_SSA_POS    (5U)
#define SPI_CFG2_SSA        (0x000000E0UL)
#define SPI_CFG2_SSA_0      (0x00000020UL)
#define SPI_CFG2_SSA_1      (0x00000040UL)
#define SPI_CFG2_SSA_2      (0x00000080UL)
#define SPI_CFG2_DSIZE_POS  (8U)
#define SPI_CFG2_DSIZE      (0x00000F00UL)
#define SPI_CFG2_LSBF_POS   (12U)
#define SPI_CFG2_LSBF       (0x00001000UL)
#define SPI_CFG2_MIDIE_POS  (13U)
#define SPI_CFG2_MIDIE      (0x00002000UL)
#define SPI_CFG2_MSSDLE_POS (14U)
#define SPI_CFG2_MSSDLE     (0x00004000UL)
#define SPI_CFG2_MSSIE_POS  (15U)
#define SPI_CFG2_MSSIE      (0x00008000UL)

