MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral SRAMC
 *******************************************************************************/
/* Bit definition for SRAMC_WTCR register */
#define SRAMC_WTCR_SRAM1RWT_POS (0U)
#define SRAMC_WTCR_SRAM1RWT     (0x00000007UL)
#define SRAMC_WTCR_SRAM1WWT_POS (4U)
#define SRAMC_WTCR_SRAM1WWT     (0x00000070UL)
#define SRAMC_WTCR_SRAMHRWT_POS (16U)
#define SRAMC_WTCR_SRAMHRWT     (0x00070000UL)
#define SRAMC_WTCR_SRAMHWWT_POS (20U)
#define SRAMC_WTCR_SRAMHWWT     (0x00700000UL)

/* Bit definition for SRAMC_WTPR register */
#define SRAMC_WTPR_WTPRC_POS  (0U)
#define SRAMC_WTPR_WTPRC      (0x00000001UL)
#define SRAMC_WTPR_WTPRKW_POS (1U)
#define SRAMC_WTPR_WTPRKW     (0x000000FEUL)

/* Bit definition for SRAMC_CKCR register */
#define SRAMC_CKCR_CACHE_ECCOAD_POS (0U)
#define SRAMC_CKCR_CACHE_ECCOAD     (0x00000001UL)
#define SRAMC_CKCR_SRAM1_ECCOAD_POS (1U)
#define SRAMC_CKCR_SRAM1_ECCOAD     (0x00000002UL)
#define SRAMC_CKCR_SRAMH_ECCOAD_POS (3U)
#define SRAMC_CKCR_SRAMH_ECCOAD     (0x00000008UL)
#define SRAMC_CKCR_CACHE_ECCMOD_POS (8U)
#define SRAMC_CKCR_CACHE_ECCMOD     (0x00000300UL)
#define SRAMC_CKCR_CACHE_ECCMOD_0   (0x00000100UL)
#define SRAMC_CKCR_CACHE_ECCMOD_1   (0x00000200UL)
#define SRAMC_CKCR_SRAM1_ECCMOD_POS (10U)
#define SRAMC_CKCR_SRAM1_ECCMOD     (0x00000C00UL)
#define SRAMC_CKCR_SRAM1_ECCMOD_0   (0x00000400UL)
#define SRAMC_CKCR_SRAM1_ECCMOD_1   (0x00000800UL)
#define SRAMC_CKCR_SRAMH_ECCMOD_POS (14U)
#define SRAMC_CKCR_SRAMH_ECCMOD     (0x0000C000UL)
#define SRAMC_CKCR_SRAMH_ECCMOD_0   (0x00004000UL)
#define SRAMC_CKCR_SRAMH_ECCMOD_1   (0x00008000UL)
#define SRAMC_CKCR_SRAMH_SWAP_POS   (31U)
#define SRAMC_CKCR_SRAMH_SWAP       (0x80000000UL)

/* Bit definition for SRAMC_CKPR register */
#define SRAMC_CKPR_CKPRC_POS  (0U)
#define SRAMC_CKPR_CKPRC      (0x00000001UL)
#define SRAMC_CKPR_CKPRKW_POS (1U)
#define SRAMC_CKPR_CKPRKW     (0x000000FEUL)

/* Bit definition for SRAMC_CKSR register */
#define SRAMC_CKSR_CACHE_1ERR_POS (0U)
#define SRAMC_CKSR_CACHE_1ERR     (0x00000001UL)
#define SRAMC_CKSR_CACHE_2ERR_POS (1U)
#define SRAMC_CKSR_CACHE_2ERR     (0x00000002UL)
#define SRAMC_CKSR_SRAM1_1ERR_POS (2U)
#define SRAMC_CKSR_SRAM1_1ERR     (0x00000004UL)
#define SRAMC_CKSR_SRAM1_2ERR_POS (3U)
#define SRAMC_CKSR_SRAM1_2ERR     (0x00000008UL)
#define SRAMC_CKSR_SRAMH_1ERR_POS (6U)
#define SRAMC_CKSR_SRAMH_1ERR     (0x00000040UL)
#define SRAMC_CKSR_SRAMH_2ERR_POS (7U)
#define SRAMC_CKSR_SRAMH_2ERR     (0x00000080UL)
#define SRAMC_CKSR_CRC_ERR_POS    (8U)
#define SRAMC_CKSR_CRC_ERR        (0x003FFF00UL)

/* Bit definition for SRAMC_SRAM1_EIEN register */
#define SRAMC_SRAM1_EIEN_EIEN (0x00000001UL)

/* Bit definition for SRAMC_SRAM1_EIBIT0 register */
#define SRAMC_SRAM1_EIBIT0 (0xFFFFFFFFUL)

/* Bit definition for SRAMC_SRAM1_EIBIT1 register */
#define SRAMC_SRAM1_EIBIT1_EIBIT (0x0000007FUL)

/* Bit definition for SRAMC_SRAM1_ECCERRADDR register */
#define SRAMC_SRAM1_ECCERRADDR_ECCERRADDR (0x0001FFFFUL)

/* Bit definition for SRAMC_SRAMH_EIEN register */
#define SRAMC_SRAMH_EIEN_EIEN (0x00000001UL)

/* Bit definition for SRAMC_SRAMH_EIBIT0 register */
#define SRAMC_SRAMH_EIBIT0 (0xFFFFFFFFUL)

/* Bit definition for SRAMC_SRAMH_EIBIT1 register */
#define SRAMC_SRAMH_EIBIT1_EIBIT (0x0000007FUL)

/* Bit definition for SRAMC_SRAMH_ECCERRADDR register */
#define SRAMC_SRAMH_ECCERRADDR_ECCERRADDR (0x00007FFFUL)

/* Bit definition for SRAMC_CACHE_EIEN register */
#define SRAMC_CACHE_EIEN_EIEN (0x00000001UL)

/* Bit definition for SRAMC_CACHE_EIBIT0 register */
#define SRAMC_CACHE_EIBIT0 (0xFFFFFFFFUL)

/* Bit definition for SRAMC_CACHE_EIBIT1 register */
#define SRAMC_CACHE_EIBIT1 (0xFFFFFFFFUL)

/* Bit definition for SRAMC_CACHE_EIBIT2 register */
#define SRAMC_CACHE_EIBIT2 (0xFFFFFFFFUL)

/* Bit definition for SRAMC_CACHE_EIBIT3 register */
#define SRAMC_CACHE_EIBIT3 (0xFFFFFFFFUL)

/* Bit definition for SRAMC_CACHE_EIBIT4 register */
#define SRAMC_CACHE_EIBIT4_EIBIT (0x000001FFUL)

/* Bit definition for SRAMC_CACHE_ECCERRADDR register */
#define SRAMC_CACHE_ECCERRADDR_ECCERRADDR (0x000000FFUL)

/*******************************************************************************
                Bit definition for Peripheral SWDT
 *******************************************************************************/
/* Bit definition for SWDT_CR register */
#define SWDT_CR_PERI_POS   (0U)
#define SWDT_CR_PERI       (0x00000003UL)
#define SWDT_CR_PERI_0     (0x00000001UL)
#define SWDT_CR_PERI_1     (0x00000002UL)
#define SWDT_CR_CKS_POS    (4U)
#define SWDT_CR_CKS        (0x000000F0UL)
#define SWDT_CR_WDPT_POS   (8U)
#define SWDT_CR_WDPT       (0x00000F00UL)
#define SWDT_CR_SLPOFF_POS (16U)
#define SWDT_CR_SLPOFF     (0x00010000UL)
#define SWDT_CR_ITS_POS    (31U)
#define SWDT_CR_ITS        (0x80000000UL)

/* Bit definition for SWDT_SR register */
#define SWDT_SR_CNT_POS (0U)
#define SWDT_SR_CNT     (0x0000FFFFUL)
#define SWDT_SR_UDF_POS (16U)
#define SWDT_SR_UDF     (0x00010000UL)
#define SWDT_SR_REF_POS (17U)
#define SWDT_SR_REF     (0x00020000UL)

/* Bit definition for SWDT_RR register */
#define SWDT_RR_RF (0x0000FFFFUL)

/*******************************************************************************
                Bit definition for Peripheral TMR0
 *******************************************************************************/
/* Bit definition for TMR0_CNTAR register */
#define TMR0_CNTAR (0xFFFFFFFFUL)

/* Bit definition for TMR0_CNTBR register */
#define TMR0_CNTBR (0xFFFFFFFFUL)

/* Bit definition for TMR0_CMPAR register */
#define TMR0_CMPAR (0xFFFFFFFFUL)

/* Bit definition for TMR0_CMPBR register */
#define TMR0_CMPBR (0xFFFFFFFFUL)

/* Bit definition for TMR0_BCONR register */
#define TMR0_BCONR_CSTA_POS    (0U)
#define TMR0_BCONR_CSTA        (0x00000001UL)
#define TMR0_BCONR_CAPMDA_POS  (1U)
#define TMR0_BCONR_CAPMDA      (0x00000002UL)
#define TMR0_BCONR_CMENA_POS   (2U)
#define TMR0_BCONR_CMENA       (0x00000004UL)
#define TMR0_BCONR_OVENA_POS   (3U)
#define TMR0_BCONR_OVENA       (0x00000008UL)
#define TMR0_BCONR_CKDIVA_POS  (4U)
#define TMR0_BCONR_CKDIVA      (0x000000F0UL)
#define TMR0_BCONR_SYNSA_POS   (8U)
#define TMR0_BCONR_SYNSA       (0x00000100UL)
#define TMR0_BCONR_SYNCLKA_POS (9U)
#define TMR0_BCONR_SYNCLKA     (0x00000200UL)
#define TMR0_BCONR_HSTAA_POS   (12U)
#define TMR0_BCONR_HSTAA       (0x00001000UL)
#define TMR0_BCONR_HSTPA_POS   (13U)
#define TMR0_BCONR_HSTPA       (0x00002000UL)
#define TMR0_BCONR_HCLEA_POS   (14U)
#define TMR0_BCONR_HCLEA       (0x00004000UL)
#define TMR0_BCONR_HICPA_POS   (15U)
#define TMR0_BCONR_HICPA       (0x00008000UL)
#define TMR0_BCONR_CSTB_POS    (16U)
#define TMR0_BCONR_CSTB        (0x00010000UL)
#define TMR0_BCONR_CAPMDB_POS  (17U)
#define TMR0_BCONR_CAPMDB      (0x00020000UL)
#define TMR0_BCONR_CMENB_POS   (18U)
#define TMR0_BCONR_CMENB       (0x00040000UL)
#define TMR0_BCONR_OVENB_POS   (19U)
#define TMR0_BCONR_OVENB       (0x00080000UL)
#define TMR0_BCONR_CKDIVB_POS  (20U)
#define TMR0_BCONR_CKDIVB      (0x00F00000UL)
#define TMR0_BCONR_SYNSB_POS   (24U)
#define TMR0_BCONR_SYNSB       (0x01000000UL)
#define TMR0_BCONR_SYNCLKB_POS (25U)
#define TMR0_BCONR_SYNCLKB     (0x02000000UL)
#define TMR0_BCONR_HSTAB_POS   (28U)
#define TMR0_BCONR_HSTAB       (0x10000000UL)
#define TMR0_BCONR_HSTPB_POS   (29U)
#define TMR0_BCONR_HSTPB       (0x20000000UL)
#define TMR0_BCONR_HCLEB_POS   (30U)
#define TMR0_BCONR_HCLEB       (0x40000000UL)
#define TMR0_BCONR_HICPB_POS   (31U)
#define TMR0_BCONR_HICPB       (0x80000000UL)

/* Bit definition for TMR0_STFLR register */
#define TMR0_STFLR_CMFA_POS (0U)
#define TMR0_STFLR_CMFA     (0x00000001UL)
#define TMR0_STFLR_OVFA_POS (1U)
#define TMR0_STFLR_OVFA     (0x00000002UL)
#define TMR0_STFLR_ICPA_POS (2U)
#define TMR0_STFLR_ICPA     (0x00000004UL)
#define TMR0_STFLR_SYDA_POS (8U)
#define TMR0_STFLR_SYDA     (0x00000100UL)
#define TMR0_STFLR_CMFB_POS (16U)
#define TMR0_STFLR_CMFB     (0x00010000UL)
#define TMR0_STFLR_OVFB_POS (17U)
#define TMR0_STFLR_OVFB     (0x00020000UL)
#define TMR0_STFLR_ICPB_POS (18U)
#define TMR0_STFLR_ICPB     (0x00040000UL)
#define TMR0_STFLR_SYDB_POS (24U)
#define TMR0_STFLR_SYDB     (0x01000000UL)

