MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral TMR6
 *******************************************************************************/
/* Bit definition for TMR6_CNTER register */
#define TMR6_CNTER (0xFFFFFFFFUL)

/* Bit definition for TMR6_UPDAR register */
#define TMR6_UPDAR (0xFFFFFFFFUL)

/* Bit definition for TMR6_PERAR register */
#define TMR6_PERAR (0xFFFFFFFFUL)

/* Bit definition for TMR6_PERBR register */
#define TMR6_PERBR (0xFFFFFFFFUL)

/* Bit definition for TMR6_PERCR register */
#define TMR6_PERCR (0xFFFFFFFFUL)

/* Bit definition for TMR6_GCMAR register */
#define TMR6_GCMAR (0xFFFFFFFFUL)

/* Bit definition for TMR6_GCMBR register */
#define TMR6_GCMBR (0xFFFFFFFFUL)

/* Bit definition for TMR6_GCMCR register */
#define TMR6_GCMCR (0xFFFFFFFFUL)

/* Bit definition for TMR6_GCMDR register */
#define TMR6_GCMDR (0xFFFFFFFFUL)

/* Bit definition for TMR6_GCMER register */
#define TMR6_GCMER (0xFFFFFFFFUL)

/* Bit definition for TMR6_GCMFR register */
#define TMR6_GCMFR (0xFFFFFFFFUL)

/* Bit definition for TMR6_SCMAR register */
#define TMR6_SCMAR (0xFFFFFFFFUL)

/* Bit definition for TMR6_SCMBR register */
#define TMR6_SCMBR (0xFFFFFFFFUL)

/* Bit definition for TMR6_SCMCR register */
#define TMR6_SCMCR (0xFFFFFFFFUL)

/* Bit definition for TMR6_SCMDR register */
#define TMR6_SCMDR (0xFFFFFFFFUL)

/* Bit definition for TMR6_SCMER register */
#define TMR6_SCMER (0xFFFFFFFFUL)

/* Bit definition for TMR6_SCMFR register */
#define TMR6_SCMFR (0xFFFFFFFFUL)

/* Bit definition for TMR6_DTUAR register */
#define TMR6_DTUAR (0xFFFFFFFFUL)

/* Bit definition for TMR6_DTDAR register */
#define TMR6_DTDAR (0xFFFFFFFFUL)

/* Bit definition for TMR6_DTUBR register */
#define TMR6_DTUBR (0xFFFFFFFFUL)

/* Bit definition for TMR6_DTDBR register */
#define TMR6_DTDBR (0xFFFFFFFFUL)

/* Bit definition for TMR6_GCONR register */
#define TMR6_GCONR_START_POS    (0U)
#define TMR6_GCONR_START        (0x00000001UL)
#define TMR6_GCONR_DIR_POS      (1U)
#define TMR6_GCONR_DIR          (0x00000002UL)
#define TMR6_GCONR_MODE_POS     (2U)
#define TMR6_GCONR_MODE         (0x00000004UL)
#define TMR6_GCONR_CKDIV_POS    (4U)
#define TMR6_GCONR_CKDIV        (0x000000F0UL)
#define TMR6_GCONR_OVSTP_POS    (8U)
#define TMR6_GCONR_OVSTP        (0x00000100UL)
#define TMR6_GCONR_FODIR_POS    (9U)
#define TMR6_GCONR_FODIR        (0x00000200UL)
#define TMR6_GCONR_ZMSKREV_POS  (16U)
#define TMR6_GCONR_ZMSKREV      (0x00010000UL)
#define TMR6_GCONR_ZMSKPOS_POS  (17U)
#define TMR6_GCONR_ZMSKPOS      (0x00020000UL)
#define TMR6_GCONR_ZMSKVAL_POS  (18U)
#define TMR6_GCONR_ZMSKVAL      (0x000C0000UL)
#define TMR6_GCONR_ZMSKVAL_0    (0x00040000UL)
#define TMR6_GCONR_ZMSKVAL_1    (0x00080000UL)
#define TMR6_GCONR_PLAINSEL_POS (20U)
#define TMR6_GCONR_PLAINSEL     (0x00F00000UL)

/* Bit definition for TMR6_ICONR register */
#define TMR6_ICONR_INTENA_POS   (0U)
#define TMR6_ICONR_INTENA       (0x00000001UL)
#define TMR6_ICONR_INTENB_POS   (1U)
#define TMR6_ICONR_INTENB       (0x00000002UL)
#define TMR6_ICONR_INTENC_POS   (2U)
#define TMR6_ICONR_INTENC       (0x00000004UL)
#define TMR6_ICONR_INTEND_POS   (3U)
#define TMR6_ICONR_INTEND       (0x00000008UL)
#define TMR6_ICONR_INTENE_POS   (4U)
#define TMR6_ICONR_INTENE       (0x00000010UL)
#define TMR6_ICONR_INTENF_POS   (5U)
#define TMR6_ICONR_INTENF       (0x00000020UL)
#define TMR6_ICONR_INTENOVF_POS (6U)
#define TMR6_ICONR_INTENOVF     (0x00000040UL)
#define TMR6_ICONR_INTENUDF_POS (7U)
#define TMR6_ICONR_INTENUDF     (0x00000080UL)
#define TMR6_ICONR_INTENDTE_POS (8U)
#define TMR6_ICONR_INTENDTE     (0x00000100UL)
#define TMR6_ICONR_INTENSAU_POS (16U)
#define TMR6_ICONR_INTENSAU     (0x00010000UL)
#define TMR6_ICONR_INTENSAD_POS (17U)
#define TMR6_ICONR_INTENSAD     (0x00020000UL)
#define TMR6_ICONR_INTENSBU_POS (18U)
#define TMR6_ICONR_INTENSBU     (0x00040000UL)
#define TMR6_ICONR_INTENSBD_POS (19U)
#define TMR6_ICONR_INTENSBD     (0x00080000UL)

/* Bit definition for TMR6_BCONR register */
#define TMR6_BCONR_BENA_POS    (0U)
#define TMR6_BCONR_BENA        (0x00000001UL)
#define TMR6_BCONR_BSEA_POS    (1U)
#define TMR6_BCONR_BSEA        (0x00000002UL)
#define TMR6_BCONR_BTRUA_POS   (2U)
#define TMR6_BCONR_BTRUA       (0x00000004UL)
#define TMR6_BCONR_BTRDA_POS   (3U)
#define TMR6_BCONR_BTRDA       (0x00000008UL)
#define TMR6_BCONR_BENB_POS    (4U)
#define TMR6_BCONR_BENB        (0x00000010UL)
#define TMR6_BCONR_BSEB_POS    (5U)
#define TMR6_BCONR_BSEB        (0x00000020UL)
#define TMR6_BCONR_BTRUB_POS   (6U)
#define TMR6_BCONR_BTRUB       (0x00000040UL)
#define TMR6_BCONR_BTRDB_POS   (7U)
#define TMR6_BCONR_BTRDB       (0x00000080UL)
#define TMR6_BCONR_BENP_POS    (8U)
#define TMR6_BCONR_BENP        (0x00000100UL)
#define TMR6_BCONR_BSEP_POS    (9U)
#define TMR6_BCONR_BSEP        (0x00000200UL)
#define TMR6_BCONR_BTRUP_POS   (10U)
#define TMR6_BCONR_BTRUP       (0x00000400UL)
#define TMR6_BCONR_BTRDP_POS   (11U)
#define TMR6_BCONR_BTRDP       (0x00000800UL)
#define TMR6_BCONR_BENSPA_POS  (16U)
#define TMR6_BCONR_BENSPA      (0x00010000UL)
#define TMR6_BCONR_BSESPA_POS  (17U)
#define TMR6_BCONR_BSESPA      (0x00020000UL)
#define TMR6_BCONR_BTRUSPA_POS (18U)
#define TMR6_BCONR_BTRUSPA     (0x00040000UL)
#define TMR6_BCONR_BTRDSPA_POS (19U)
#define TMR6_BCONR_BTRDSPA     (0x00080000UL)
#define TMR6_BCONR_BENSPB_POS  (20U)
#define TMR6_BCONR_BENSPB      (0x00100000UL)
#define TMR6_BCONR_BSESPB_POS  (21U)
#define TMR6_BCONR_BSESPB      (0x00200000UL)
#define TMR6_BCONR_BTRUSPB_POS (22U)
#define TMR6_BCONR_BTRUSPB     (0x00400000UL)
#define TMR6_BCONR_BTRDSPB_POS (23U)
#define TMR6_BCONR_BTRDSPB     (0x00800000UL)

/* Bit definition for TMR6_DCONR register */
#define TMR6_DCONR_DTCEN_POS    (0U)
#define TMR6_DCONR_DTCEN        (0x00000001UL)
#define TMR6_DCONR_SEPA_POS     (1U)
#define TMR6_DCONR_SEPA         (0x00000002UL)
#define TMR6_DCONR_DTBENU_POS   (4U)
#define TMR6_DCONR_DTBENU       (0x00000010UL)
#define TMR6_DCONR_DTBEND_POS   (5U)
#define TMR6_DCONR_DTBEND       (0x00000020UL)
#define TMR6_DCONR_DTBTRU_POS   (6U)
#define TMR6_DCONR_DTBTRU       (0x00000040UL)
#define TMR6_DCONR_DTBTRD_POS   (7U)
#define TMR6_DCONR_DTBTRD       (0x00000080UL)
#define TMR6_DCONR_DTMD_POS     (8U)
#define TMR6_DCONR_DTMD         (0x00000700UL)
#define TMR6_DCONR_DTREFCTL_POS (11U)
#define TMR6_DCONR_DTREFCTL     (0x00000800UL)
#define TMR6_DCONR_DTCKDIV_POS  (12U)
#define TMR6_DCONR_DTCKDIV      (0x00007000UL)

/* Bit definition for TMR6_PCNAR register */
#define TMR6_PCNAR_STACA_POS  (0U)
#define TMR6_PCNAR_STACA      (0x00000003UL)
#define TMR6_PCNAR_STACA_0    (0x00000001UL)
#define TMR6_PCNAR_STACA_1    (0x00000002UL)
#define TMR6_PCNAR_STPCA_POS  (2U)
#define TMR6_PCNAR_STPCA      (0x0000000CUL)
#define TMR6_PCNAR_STPCA_0    (0x00000004UL)
#define TMR6_PCNAR_STPCA_1    (0x00000008UL)
#define TMR6_PCNAR_PERACA_POS (4U)
#define TMR6_PCNAR_PERACA     (0x00000030UL)
#define TMR6_PCNAR_PERACA_0   (0x00000010UL)
#define TMR6_PCNAR_PERACA_1   (0x00000020UL)
#define TMR6_PCNAR_ZEROCA_POS (6U)
#define TMR6_PCNAR_ZEROCA     (0x000000C0UL)
#define TMR6_PCNAR_ZEROCA_0   (0x00000040UL)
#define TMR6_PCNAR_ZEROCA_1   (0x00000080UL)
#define TMR6_PCNAR_CMAUCA_POS (8U)
#define TMR6_PCNAR_CMAUCA     (0x00000300UL)
#define TMR6_PCNAR_CMAUCA_0   (0x00000100UL)
#define TMR6_PCNAR_CMAUCA_1   (0x00000200UL)
#define TMR6_PCNAR_CMADCA_POS (10U)
#define TMR6_PCNAR_CMADCA     (0x00000C00UL)
#define TMR6_PCNAR_CMADCA_0   (0x00000400UL)
#define TMR6_PCNAR_CMADCA_1   (0x00000800UL)
#define TMR6_PCNAR_CMBUCA_POS (12U)
#define TMR6_PCNAR_CMBUCA     (0x00003000UL)
#define TMR6_PCNAR_CMBUCA_0   (0x00001000UL)
#define TMR6_PCNAR_CMBUCA_1   (0x00002000UL)
#define TMR6_PCNAR_CMBDCA_POS (14U)
#define TMR6_PCNAR_CMBDCA     (0x0000C000UL)
#define TMR6_PCNAR_CMBDCA_0   (0x00004000UL)
#define TMR6_PCNAR_CMBDCA_1   (0x00008000UL)
#define TMR6_PCNAR_FORCA_POS  (16U)
#define TMR6_PCNAR_FORCA      (0x00030000UL)
#define TMR6_PCNAR_FORCA_0    (0x00010000UL)
#define TMR6_PCNAR_FORCA_1    (0x00020000UL)
#define TMR6_PCNAR_EMBCA_POS  (20U)
#define TMR6_PCNAR_EMBCA      (0x00300000UL)
#define TMR6_PCNAR_EMBCA_0    (0x00100000UL)
#define TMR6_PCNAR_EMBCA_1    (0x00200000UL)
#define TMR6_PCNAR_EMBRA_POS  (22U)
#define TMR6_PCNAR_EMBRA      (0x00C00000UL)
#define TMR6_PCNAR_EMBRA_0    (0x00400000UL)
#define TMR6_PCNAR_EMBRA_1    (0x00800000UL)
#define TMR6_PCNAR_EMBSA_POS  (24U)
#define TMR6_PCNAR_EMBSA      (0x07000000UL)
#define TMR6_PCNAR_OUTENA_POS (28U)
#define TMR6_PCNAR_OUTENA     (0x10000000UL)
#define TMR6_PCNAR_CAPMDA_POS (31U)
#define TMR6_PCNAR_CAPMDA     (0x80000000UL)

/* Bit definition for TMR6_PCNBR register */
#define TMR6_PCNBR_STACB_POS  (0U)
#define TMR6_PCNBR_STACB      (0x00000003UL)
#define TMR6_PCNBR_STACB_0    (0x00000001UL)
#define TMR6_PCNBR_STACB_1    (0x00000002UL)
#define TMR6_PCNBR_STPCB_POS  (2U)
#define TMR6_PCNBR_STPCB      (0x0000000CUL)
#define TMR6_PCNBR_STPCB_0    (0x00000004UL)
#define TMR6_PCNBR_STPCB_1    (0x00000008UL)
#define TMR6_PCNBR_PERACB_POS (4U)
#define TMR6_PCNBR_PERACB     (0x00000030UL)
#define TMR6_PCNBR_PERACB_0   (0x00000010UL)
#define TMR6_PCNBR_PERACB_1   (0x00000020UL)
#define TMR6_PCNBR_ZEROCB_POS (6U)
#define TMR6_PCNBR_ZEROCB     (0x000000C0UL)
#define TMR6_PCNBR_ZEROCB_0   (0x00000040UL)
#define TMR6_PCNBR_ZEROCB_1   (0x00000080UL)
#define TMR6_PCNBR_CMAUCB_POS (8U)
#define TMR6_PCNBR_CMAUCB     (0x00000300UL)
#define TMR6_PCNBR_CMAUCB_0   (0x00000100UL)
#define TMR6_PCNBR_CMAUCB_1   (0x00000200UL)
#define TMR6_PCNBR_CMADCB_POS (10U)
#define TMR6_PCNBR_CMADCB     (0x00000C00UL)
#define TMR6_PCNBR_CMADCB_0   (0x00000400UL)
#define TMR6_PCNBR_CMADCB_1   (0x00000800UL)
#define TMR6_PCNBR_CMBUCB_POS (12U)
#define TMR6_PCNBR_CMBUCB     (0x00003000UL)
#define TMR6_PCNBR_CMBUCB_0   (0x00001000UL)
#define TMR6_PCNBR_CMBUCB_1   (0x00002000UL)
#define TMR6_PCNBR_CMBDCB_POS (14U)
#define TMR6_PCNBR_CMBDCB     (0x0000C000UL)
#define TMR6_PCNBR_CMBDCB_0   (0x00004000UL)
#define TMR6_PCNBR_CMBDCB_1   (0x00008000UL)
#define TMR6_PCNBR_FORCB_POS  (16U)
#define TMR6_PCNBR_FORCB      (0x00030000UL)
#define TMR6_PCNBR_FORCB_0    (0x00010000UL)
#define TMR6_PCNBR_FORCB_1    (0x00020000UL)
#define TMR6_PCNBR_EMBCB_POS  (20U)
#define TMR6_PCNBR_EMBCB      (0x00300000UL)
#define TMR6_PCNBR_EMBCB_0    (0x00100000UL)
#define TMR6_PCNBR_EMBCB_1    (0x00200000UL)
#define TMR6_PCNBR_EMBRB_POS  (22U)
#define TMR6_PCNBR_EMBRB      (0x00C00000UL)
#define TMR6_PCNBR_EMBRB_0    (0x00400000UL)
#define TMR6_PCNBR_EMBRB_1    (0x00800000UL)
#define TMR6_PCNBR_EMBSB_POS  (24U)
#define TMR6_PCNBR_EMBSB      (0x07000000UL)
#define TMR6_PCNBR_OUTENB_POS (28U)
#define TMR6_PCNBR_OUTENB     (0x10000000UL)
#define TMR6_PCNBR_CAPMDB_POS (31U)
#define TMR6_PCNBR_CAPMDB     (0x80000000UL)

/* Bit definition for TMR6_FCNGR register */
#define TMR6_FCNGR_NOFIENGA_POS   (0U)
#define TMR6_FCNGR_NOFIENGA       (0x00000001UL)
#define TMR6_FCNGR_NOFICKGA_POS   (1U)
#define TMR6_FCNGR_NOFICKGA       (0x00000006UL)
#define TMR6_FCNGR_NOFICKGA_0     (0x00000002UL)
#define TMR6_FCNGR_NOFICKGA_1     (0x00000004UL)
#define TMR6_FCNGR_NOFIENGB_POS   (4U)
#define TMR6_FCNGR_NOFIENGB       (0x00000010UL)
#define TMR6_FCNGR_NOFICKGB_POS   (5U)
#define TMR6_FCNGR_NOFICKGB       (0x00000060UL)
#define TMR6_FCNGR_NOFICKGB_0     (0x00000020UL)
#define TMR6_FCNGR_NOFICKGB_1     (0x00000040UL)
#define TMR6_FCNGR_NOFIENGPLA_POS (8U)
#define TMR6_FCNGR_NOFIENGPLA     (0x00000100UL)
#define TMR6_FCNGR_NOFICKGPLA_POS (9U)
#define TMR6_FCNGR_NOFICKGPLA     (0x00000600UL)
#define TMR6_FCNGR_NOFICKGPLA_0   (0x00000200UL)
#define TMR6_FCNGR_NOFICKGPLA_1   (0x00000400UL)

/* Bit definition for TMR6_VPERR register */
#define TMR6_VPERR_SPPERIA_POS (8U)
#define TMR6_VPERR_SPPERIA     (0x00000100UL)
#define TMR6_VPERR_SPPERIB_POS (9U)
#define TMR6_VPERR_SPPERIB     (0x00000200UL)
#define TMR6_VPERR_PCNTE_POS   (16U)
#define TMR6_VPERR_PCNTE       (0x00030000UL)
#define TMR6_VPERR_PCNTE_0     (0x00010000UL)
#define TMR6_VPERR_PCNTE_1     (0x00020000UL)
#define TMR6_VPERR_PCNTS_POS   (18U)
#define TMR6_VPERR_PCNTS       (0x001C0000UL)
#define TMR6_VPERR_PCTRL_POS   (24U)
#define TMR6_VPERR_PCTRL       (0x01000000UL)

/* Bit definition for TMR6_STFLR register */
#define TMR6_STFLR_CMAF_POS    (0U)
#define TMR6_STFLR_CMAF        (0x00000001UL)
#define TMR6_STFLR_CMBF_POS    (1U)
#define TMR6_STFLR_CMBF        (0x00000002UL)
#define TMR6_STFLR_CMCF_POS    (2U)
#define TMR6_STFLR_CMCF        (0x00000004UL)
#define TMR6_STFLR_CMDF_POS    (3U)
#define TMR6_STFLR_CMDF        (0x00000008UL)
#define TMR6_STFLR_CMEF_POS    (4U)
#define TMR6_STFLR_CMEF        (0x00000010UL)
#define TMR6_STFLR_CMFF_POS    (5U)
#define TMR6_STFLR_CMFF        (0x00000020UL)
#define TMR6_STFLR_OVFF_POS    (6U)
#define TMR6_STFLR_OVFF        (0x00000040UL)
#define TMR6_STFLR_UDFF_POS    (7U)
#define TMR6_STFLR_UDFF        (0x00000080UL)
#define TMR6_STFLR_DTEF_POS    (8U)
#define TMR6_STFLR_DTEF        (0x00000100UL)
#define TMR6_STFLR_CMSAUF_POS  (9U)
#define TMR6_STFLR_CMSAUF      (0x00000200UL)
#define TMR6_STFLR_CMSADF_POS  (10U)
#define TMR6_STFLR_CMSADF      (0x00000400UL)
#define TMR6_STFLR_CMSBUF_POS  (11U)
#define TMR6_STFLR_CMSBUF      (0x00000800UL)
#define TMR6_STFLR_CMSBDF_POS  (12U)
#define TMR6_STFLR_CMSBDF      (0x00001000UL)
#define TMR6_STFLR_VPERNUM_POS (21U)
#define TMR6_STFLR_VPERNUM     (0x00E00000UL)
#define TMR6_STFLR_CMAF2_POS   (26U)
#define TMR6_STFLR_CMAF2       (0x04000000UL)
#define TMR6_STFLR_CMBF2_POS   (27U)
#define TMR6_STFLR_CMBF2       (0x08000000UL)
#define TMR6_STFLR_DIRF_POS    (31U)
#define TMR6_STFLR_DIRF        (0x80000000UL)

/* Bit definition for TMR6_HSTAR register */
#define TMR6_HSTAR_HSTA0_POS  (0U)
#define TMR6_HSTAR_HSTA0      (0x00000001UL)
#define TMR6_HSTAR_HSTA1_POS  (1U)
#define TMR6_HSTAR_HSTA1      (0x00000002UL)
#define TMR6_HSTAR_HSTA2_POS  (2U)
#define TMR6_HSTAR_HSTA2      (0x00000004UL)
#define TMR6_HSTAR_HSTA3_POS  (3U)
#define TMR6_HSTAR_HSTA3      (0x00000008UL)
#define TMR6_HSTAR_STAS_POS   (7U)
#define TMR6_HSTAR_STAS       (0x00000080UL)
#define TMR6_HSTAR_HSTA8_POS  (8U)
#define TMR6_HSTAR_HSTA8      (0x00000100UL)
#define TMR6_HSTAR_HSTA9_POS  (9U)
#define TMR6_HSTAR_HSTA9      (0x00000200UL)
#define TMR6_HSTAR_HSTA10_POS (10U)
#define TMR6_HSTAR_HSTA10     (0x00000400UL)
#define TMR6_HSTAR_HSTA11_POS (11U)
#define TMR6_HSTAR_HSTA11     (0x00000800UL)
#define TMR6_HSTAR_HSTA12_POS (12U)
#define TMR6_HSTAR_HSTA12     (0x00001000UL)
#define TMR6_HSTAR_HSTA13_POS (13U)
#define TMR6_HSTAR_HSTA13     (0x00002000UL)
#define TMR6_HSTAR_HSTA16_POS (16U)
#define TMR6_HSTAR_HSTA16     (0x00010000UL)
#define TMR6_HSTAR_HSTA17_POS (17U)
#define TMR6_HSTAR_HSTA17     (0x00020000UL)
#define TMR6_HSTAR_HSTA18_POS (18U)
#define TMR6_HSTAR_HSTA18     (0x00040000UL)
#define TMR6_HSTAR_HSTA19_POS (19U)
#define TMR6_HSTAR_HSTA19     (0x00080000UL)
#define TMR6_HSTAR_HSTA20_POS (20U)
#define TMR6_HSTAR_HSTA20     (0x00100000UL)
#define TMR6_HSTAR_HSTA21_POS (21U)
#define TMR6_HSTAR_HSTA21     (0x00200000UL)
#define TMR6_HSTAR_HSTA22_POS (22U)
#define TMR6_HSTAR_HSTA22     (0x00400000UL)
#define TMR6_HSTAR_HSTA23_POS (23U)
#define TMR6_HSTAR_HSTA23     (0x00800000UL)
#define TMR6_HSTAR_HSTA26_POS (26U)
#define TMR6_HSTAR_HSTA26     (0x04000000UL)
#define TMR6_HSTAR_HSTA27_POS (27U)
#define TMR6_HSTAR_HSTA27     (0x08000000UL)

