MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for TMR6_HSTPR register */
#define TMR6_HSTPR_HSTP0_POS  (0U)
#define TMR6_HSTPR_HSTP0      (0x00000001UL)
#define TMR6_HSTPR_HSTP1_POS  (1U)
#define TMR6_HSTPR_HSTP1      (0x00000002UL)
#define TMR6_HSTPR_HSTP2_POS  (2U)
#define TMR6_HSTPR_HSTP2      (0x00000004UL)
#define TMR6_HSTPR_HSTP3_POS  (3U)
#define TMR6_HSTPR_HSTP3      (0x00000008UL)
#define TMR6_HSTPR_STPS_POS   (7U)
#define TMR6_HSTPR_STPS       (0x00000080UL)
#define TMR6_HSTPR_HSTP8_POS  (8U)
#define TMR6_HSTPR_HSTP8      (0x00000100UL)
#define TMR6_HSTPR_HSTP9_POS  (9U)
#define TMR6_HSTPR_HSTP9      (0x00000200UL)
#define TMR6_HSTPR_HSTP10_POS (10U)
#define TMR6_HSTPR_HSTP10     (0x00000400UL)
#define TMR6_HSTPR_HSTP11_POS (11U)
#define TMR6_HSTPR_HSTP11     (0x00000800UL)
#define TMR6_HSTPR_HSTP12_POS (12U)
#define TMR6_HSTPR_HSTP12     (0x00001000UL)
#define TMR6_HSTPR_HSTP13_POS (13U)
#define TMR6_HSTPR_HSTP13     (0x00002000UL)
#define TMR6_HSTPR_HSTP16_POS (16U)
#define TMR6_HSTPR_HSTP16     (0x00010000UL)
#define TMR6_HSTPR_HSTP17_POS (17U)
#define TMR6_HSTPR_HSTP17     (0x00020000UL)
#define TMR6_HSTPR_HSTP18_POS (18U)
#define TMR6_HSTPR_HSTP18     (0x00040000UL)
#define TMR6_HSTPR_HSTP19_POS (19U)
#define TMR6_HSTPR_HSTP19     (0x00080000UL)
#define TMR6_HSTPR_HSTP20_POS (20U)
#define TMR6_HSTPR_HSTP20     (0x00100000UL)
#define TMR6_HSTPR_HSTP21_POS (21U)
#define TMR6_HSTPR_HSTP21     (0x00200000UL)
#define TMR6_HSTPR_HSTP22_POS (22U)
#define TMR6_HSTPR_HSTP22     (0x00400000UL)
#define TMR6_HSTPR_HSTP23_POS (23U)
#define TMR6_HSTPR_HSTP23     (0x00800000UL)
#define TMR6_HSTPR_HSTP26_POS (26U)
#define TMR6_HSTPR_HSTP26     (0x04000000UL)
#define TMR6_HSTPR_HSTP27_POS (27U)
#define TMR6_HSTPR_HSTP27     (0x08000000UL)

/* Bit definition for TMR6_HCLRR register */
#define TMR6_HCLRR_HCLE0_POS  (0U)
#define TMR6_HCLRR_HCLE0      (0x00000001UL)
#define TMR6_HCLRR_HCLE1_POS  (1U)
#define TMR6_HCLRR_HCLE1      (0x00000002UL)
#define TMR6_HCLRR_HCLE2_POS  (2U)
#define TMR6_HCLRR_HCLE2      (0x00000004UL)
#define TMR6_HCLRR_HCLE3_POS  (3U)
#define TMR6_HCLRR_HCLE3      (0x00000008UL)
#define TMR6_HCLRR_CLES_POS   (7U)
#define TMR6_HCLRR_CLES       (0x00000080UL)
#define TMR6_HCLRR_HCLE8_POS  (8U)
#define TMR6_HCLRR_HCLE8      (0x00000100UL)
#define TMR6_HCLRR_HCLE9_POS  (9U)
#define TMR6_HCLRR_HCLE9      (0x00000200UL)
#define TMR6_HCLRR_HCLE10_POS (10U)
#define TMR6_HCLRR_HCLE10     (0x00000400UL)
#define TMR6_HCLRR_HCLE11_POS (11U)
#define TMR6_HCLRR_HCLE11     (0x00000800UL)
#define TMR6_HCLRR_HCLE12_POS (12U)
#define TMR6_HCLRR_HCLE12     (0x00001000UL)
#define TMR6_HCLRR_HCLE13_POS (13U)
#define TMR6_HCLRR_HCLE13     (0x00002000UL)
#define TMR6_HCLRR_HCLE16_POS (16U)
#define TMR6_HCLRR_HCLE16     (0x00010000UL)
#define TMR6_HCLRR_HCLE17_POS (17U)
#define TMR6_HCLRR_HCLE17     (0x00020000UL)
#define TMR6_HCLRR_HCLE18_POS (18U)
#define TMR6_HCLRR_HCLE18     (0x00040000UL)
#define TMR6_HCLRR_HCLE19_POS (19U)
#define TMR6_HCLRR_HCLE19     (0x00080000UL)
#define TMR6_HCLRR_HCLE20_POS (20U)
#define TMR6_HCLRR_HCLE20     (0x00100000UL)
#define TMR6_HCLRR_HCLE21_POS (21U)
#define TMR6_HCLRR_HCLE21     (0x00200000UL)
#define TMR6_HCLRR_HCLE22_POS (22U)
#define TMR6_HCLRR_HCLE22     (0x00400000UL)
#define TMR6_HCLRR_HCLE23_POS (23U)
#define TMR6_HCLRR_HCLE23     (0x00800000UL)
#define TMR6_HCLRR_HCLE26_POS (26U)
#define TMR6_HCLRR_HCLE26     (0x04000000UL)
#define TMR6_HCLRR_HCLE27_POS (27U)
#define TMR6_HCLRR_HCLE27     (0x08000000UL)

/* Bit definition for TMR6_HUPDR register */
#define TMR6_HUPDR_HUPD0_POS  (0U)
#define TMR6_HUPDR_HUPD0      (0x00000001UL)
#define TMR6_HUPDR_HUPD1_POS  (1U)
#define TMR6_HUPDR_HUPD1      (0x00000002UL)
#define TMR6_HUPDR_HUPD2_POS  (2U)
#define TMR6_HUPDR_HUPD2      (0x00000004UL)
#define TMR6_HUPDR_HUPD3_POS  (3U)
#define TMR6_HUPDR_HUPD3      (0x00000008UL)
#define TMR6_HUPDR_UPDS_POS   (7U)
#define TMR6_HUPDR_UPDS       (0x00000080UL)
#define TMR6_HUPDR_HUPD8_POS  (8U)
#define TMR6_HUPDR_HUPD8      (0x00000100UL)
#define TMR6_HUPDR_HUPD9_POS  (9U)
#define TMR6_HUPDR_HUPD9      (0x00000200UL)
#define TMR6_HUPDR_HUPD10_POS (10U)
#define TMR6_HUPDR_HUPD10     (0x00000400UL)
#define TMR6_HUPDR_HUPD11_POS (11U)
#define TMR6_HUPDR_HUPD11     (0x00000800UL)
#define TMR6_HUPDR_HUPD12_POS (12U)
#define TMR6_HUPDR_HUPD12     (0x00001000UL)
#define TMR6_HUPDR_HUPD13_POS (13U)
#define TMR6_HUPDR_HUPD13     (0x00002000UL)
#define TMR6_HUPDR_HUPD16_POS (16U)
#define TMR6_HUPDR_HUPD16     (0x00010000UL)
#define TMR6_HUPDR_HUPD17_POS (17U)
#define TMR6_HUPDR_HUPD17     (0x00020000UL)
#define TMR6_HUPDR_HUPD18_POS (18U)
#define TMR6_HUPDR_HUPD18     (0x00040000UL)
#define TMR6_HUPDR_HUPD19_POS (19U)
#define TMR6_HUPDR_HUPD19     (0x00080000UL)
#define TMR6_HUPDR_HUPD20_POS (20U)
#define TMR6_HUPDR_HUPD20     (0x00100000UL)
#define TMR6_HUPDR_HUPD21_POS (21U)
#define TMR6_HUPDR_HUPD21     (0x00200000UL)
#define TMR6_HUPDR_HUPD22_POS (22U)
#define TMR6_HUPDR_HUPD22     (0x00400000UL)
#define TMR6_HUPDR_HUPD23_POS (23U)
#define TMR6_HUPDR_HUPD23     (0x00800000UL)
#define TMR6_HUPDR_HUPD26_POS (26U)
#define TMR6_HUPDR_HUPD26     (0x04000000UL)
#define TMR6_HUPDR_HUPD27_POS (27U)
#define TMR6_HUPDR_HUPD27     (0x08000000UL)

/* Bit definition for TMR6_HCPAR register */
#define TMR6_HCPAR_HCPA0_POS  (0U)
#define TMR6_HCPAR_HCPA0      (0x00000001UL)
#define TMR6_HCPAR_HCPA1_POS  (1U)
#define TMR6_HCPAR_HCPA1      (0x00000002UL)
#define TMR6_HCPAR_HCPA2_POS  (2U)
#define TMR6_HCPAR_HCPA2      (0x00000004UL)
#define TMR6_HCPAR_HCPA3_POS  (3U)
#define TMR6_HCPAR_HCPA3      (0x00000008UL)
#define TMR6_HCPAR_HCPA8_POS  (8U)
#define TMR6_HCPAR_HCPA8      (0x00000100UL)
#define TMR6_HCPAR_HCPA9_POS  (9U)
#define TMR6_HCPAR_HCPA9      (0x00000200UL)
#define TMR6_HCPAR_HCPA10_POS (10U)
#define TMR6_HCPAR_HCPA10     (0x00000400UL)
#define TMR6_HCPAR_HCPA11_POS (11U)
#define TMR6_HCPAR_HCPA11     (0x00000800UL)
#define TMR6_HCPAR_HCPA12_POS (12U)
#define TMR6_HCPAR_HCPA12     (0x00001000UL)
#define TMR6_HCPAR_HCPA13_POS (13U)
#define TMR6_HCPAR_HCPA13     (0x00002000UL)
#define TMR6_HCPAR_HCPA16_POS (16U)
#define TMR6_HCPAR_HCPA16     (0x00010000UL)
#define TMR6_HCPAR_HCPA17_POS (17U)
#define TMR6_HCPAR_HCPA17     (0x00020000UL)
#define TMR6_HCPAR_HCPA18_POS (18U)
#define TMR6_HCPAR_HCPA18     (0x00040000UL)
#define TMR6_HCPAR_HCPA19_POS (19U)
#define TMR6_HCPAR_HCPA19     (0x00080000UL)
#define TMR6_HCPAR_HCPA20_POS (20U)
#define TMR6_HCPAR_HCPA20     (0x00100000UL)
#define TMR6_HCPAR_HCPA21_POS (21U)
#define TMR6_HCPAR_HCPA21     (0x00200000UL)
#define TMR6_HCPAR_HCPA22_POS (22U)
#define TMR6_HCPAR_HCPA22     (0x00400000UL)
#define TMR6_HCPAR_HCPA23_POS (23U)
#define TMR6_HCPAR_HCPA23     (0x00800000UL)
#define TMR6_HCPAR_HCPA24_POS (24U)
#define TMR6_HCPAR_HCPA24     (0x01000000UL)
#define TMR6_HCPAR_HCPA25_POS (25U)
#define TMR6_HCPAR_HCPA25     (0x02000000UL)
#define TMR6_HCPAR_HCPA26_POS (26U)
#define TMR6_HCPAR_HCPA26     (0x04000000UL)
#define TMR6_HCPAR_HCPA27_POS (27U)
#define TMR6_HCPAR_HCPA27     (0x08000000UL)

