MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for TMR6_HCPBR register */
#define TMR6_HCPBR_HCPB0_POS  (0U)
#define TMR6_HCPBR_HCPB0      (0x00000001UL)
#define TMR6_HCPBR_HCPB1_POS  (1U)
#define TMR6_HCPBR_HCPB1      (0x00000002UL)
#define TMR6_HCPBR_HCPB2_POS  (2U)
#define TMR6_HCPBR_HCPB2      (0x00000004UL)
#define TMR6_HCPBR_HCPB3_POS  (3U)
#define TMR6_HCPBR_HCPB3      (0x00000008UL)
#define TMR6_HCPBR_HCPB8_POS  (8U)
#define TMR6_HCPBR_HCPB8      (0x00000100UL)
#define TMR6_HCPBR_HCPB9_POS  (9U)
#define TMR6_HCPBR_HCPB9      (0x00000200UL)
#define TMR6_HCPBR_HCPB10_POS (10U)
#define TMR6_HCPBR_HCPB10     (0x00000400UL)
#define TMR6_HCPBR_HCPB11_POS (11U)
#define TMR6_HCPBR_HCPB11     (0x00000800UL)
#define TMR6_HCPBR_HCPB12_POS (12U)
#define TMR6_HCPBR_HCPB12     (0x00001000UL)
#define TMR6_HCPBR_HCPB13_POS (13U)
#define TMR6_HCPBR_HCPB13     (0x00002000UL)
#define TMR6_HCPBR_HCPB16_POS (16U)
#define TMR6_HCPBR_HCPB16     (0x00010000UL)
#define TMR6_HCPBR_HCPB17_POS (17U)
#define TMR6_HCPBR_HCPB17     (0x00020000UL)
#define TMR6_HCPBR_HCPB18_POS (18U)
#define TMR6_HCPBR_HCPB18     (0x00040000UL)
#define TMR6_HCPBR_HCPB19_POS (19U)
#define TMR6_HCPBR_HCPB19     (0x00080000UL)
#define TMR6_HCPBR_HCPB20_POS (20U)
#define TMR6_HCPBR_HCPB20     (0x00100000UL)
#define TMR6_HCPBR_HCPB21_POS (21U)
#define TMR6_HCPBR_HCPB21     (0x00200000UL)
#define TMR6_HCPBR_HCPB22_POS (22U)
#define TMR6_HCPBR_HCPB22     (0x00400000UL)
#define TMR6_HCPBR_HCPB23_POS (23U)
#define TMR6_HCPBR_HCPB23     (0x00800000UL)
#define TMR6_HCPBR_HCPB24_POS (24U)
#define TMR6_HCPBR_HCPB24     (0x01000000UL)
#define TMR6_HCPBR_HCPB25_POS (25U)
#define TMR6_HCPBR_HCPB25     (0x02000000UL)
#define TMR6_HCPBR_HCPB26_POS (26U)
#define TMR6_HCPBR_HCPB26     (0x04000000UL)
#define TMR6_HCPBR_HCPB27_POS (27U)
#define TMR6_HCPBR_HCPB27     (0x08000000UL)

/* Bit definition for TMR6_HCUPR register */
#define TMR6_HCUPR_HCUP0_POS  (0U)
#define TMR6_HCUPR_HCUP0      (0x00000001UL)
#define TMR6_HCUPR_HCUP1_POS  (1U)
#define TMR6_HCUPR_HCUP1      (0x00000002UL)
#define TMR6_HCUPR_HCUP2_POS  (2U)
#define TMR6_HCUPR_HCUP2      (0x00000004UL)
#define TMR6_HCUPR_HCUP3_POS  (3U)
#define TMR6_HCUPR_HCUP3      (0x00000008UL)
#define TMR6_HCUPR_HCUP4_POS  (4U)
#define TMR6_HCUPR_HCUP4      (0x00000010UL)
#define TMR6_HCUPR_HCUP5_POS  (5U)
#define TMR6_HCUPR_HCUP5      (0x00000020UL)
#define TMR6_HCUPR_HCUP6_POS  (6U)
#define TMR6_HCUPR_HCUP6      (0x00000040UL)
#define TMR6_HCUPR_HCUP7_POS  (7U)
#define TMR6_HCUPR_HCUP7      (0x00000080UL)
#define TMR6_HCUPR_HCUP8_POS  (8U)
#define TMR6_HCUPR_HCUP8      (0x00000100UL)
#define TMR6_HCUPR_HCUP9_POS  (9U)
#define TMR6_HCUPR_HCUP9      (0x00000200UL)
#define TMR6_HCUPR_HCUP10_POS (10U)
#define TMR6_HCUPR_HCUP10     (0x00000400UL)
#define TMR6_HCUPR_HCUP11_POS (11U)
#define TMR6_HCUPR_HCUP11     (0x00000800UL)
#define TMR6_HCUPR_HCUP12_POS (12U)
#define TMR6_HCUPR_HCUP12     (0x00001000UL)
#define TMR6_HCUPR_HCUP13_POS (13U)
#define TMR6_HCUPR_HCUP13     (0x00002000UL)
#define TMR6_HCUPR_HCUP16_POS (16U)
#define TMR6_HCUPR_HCUP16     (0x00010000UL)
#define TMR6_HCUPR_HCUP17_POS (17U)
#define TMR6_HCUPR_HCUP17     (0x00020000UL)
#define TMR6_HCUPR_HCUP18_POS (18U)
#define TMR6_HCUPR_HCUP18     (0x00040000UL)
#define TMR6_HCUPR_HCUP19_POS (19U)
#define TMR6_HCUPR_HCUP19     (0x00080000UL)
#define TMR6_HCUPR_HCUP20_POS (20U)
#define TMR6_HCUPR_HCUP20     (0x00100000UL)
#define TMR6_HCUPR_HCUP21_POS (21U)
#define TMR6_HCUPR_HCUP21     (0x00200000UL)
#define TMR6_HCUPR_HCUP22_POS (22U)
#define TMR6_HCUPR_HCUP22     (0x00400000UL)
#define TMR6_HCUPR_HCUP23_POS (23U)
#define TMR6_HCUPR_HCUP23     (0x00800000UL)
#define TMR6_HCUPR_HCUP26_POS (26U)
#define TMR6_HCUPR_HCUP26     (0x04000000UL)
#define TMR6_HCUPR_HCUP27_POS (27U)
#define TMR6_HCUPR_HCUP27     (0x08000000UL)

/* Bit definition for TMR6_HCDOR register */
#define TMR6_HCDOR_HCDO0_POS  (0U)
#define TMR6_HCDOR_HCDO0      (0x00000001UL)
#define TMR6_HCDOR_HCDO1_POS  (1U)
#define TMR6_HCDOR_HCDO1      (0x00000002UL)
#define TMR6_HCDOR_HCDO2_POS  (2U)
#define TMR6_HCDOR_HCDO2      (0x00000004UL)
#define TMR6_HCDOR_HCDO3_POS  (3U)
#define TMR6_HCDOR_HCDO3      (0x00000008UL)
#define TMR6_HCDOR_HCDO4_POS  (4U)
#define TMR6_HCDOR_HCDO4      (0x00000010UL)
#define TMR6_HCDOR_HCDO5_POS  (5U)
#define TMR6_HCDOR_HCDO5      (0x00000020UL)
#define TMR6_HCDOR_HCDO6_POS  (6U)
#define TMR6_HCDOR_HCDO6      (0x00000040UL)
#define TMR6_HCDOR_HCDO7_POS  (7U)
#define TMR6_HCDOR_HCDO7      (0x00000080UL)
#define TMR6_HCDOR_HCDO8_POS  (8U)
#define TMR6_HCDOR_HCDO8      (0x00000100UL)
#define TMR6_HCDOR_HCDO9_POS  (9U)
#define TMR6_HCDOR_HCDO9      (0x00000200UL)
#define TMR6_HCDOR_HCDO10_POS (10U)
#define TMR6_HCDOR_HCDO10     (0x00000400UL)
#define TMR6_HCDOR_HCDO11_POS (11U)
#define TMR6_HCDOR_HCDO11     (0x00000800UL)
#define TMR6_HCDOR_HCDO12_POS (12U)
#define TMR6_HCDOR_HCDO12     (0x00001000UL)
#define TMR6_HCDOR_HCDO13_POS (13U)
#define TMR6_HCDOR_HCDO13     (0x00002000UL)
#define TMR6_HCDOR_HCDO16_POS (16U)
#define TMR6_HCDOR_HCDO16     (0x00010000UL)
#define TMR6_HCDOR_HCDO17_POS (17U)
#define TMR6_HCDOR_HCDO17     (0x00020000UL)
#define TMR6_HCDOR_HCDO18_POS (18U)
#define TMR6_HCDOR_HCDO18     (0x00040000UL)
#define TMR6_HCDOR_HCDO19_POS (19U)
#define TMR6_HCDOR_HCDO19     (0x00080000UL)
#define TMR6_HCDOR_HCDO20_POS (20U)
#define TMR6_HCDOR_HCDO20     (0x00100000UL)
#define TMR6_HCDOR_HCDO21_POS (21U)
#define TMR6_HCDOR_HCDO21     (0x00200000UL)
#define TMR6_HCDOR_HCDO22_POS (22U)
#define TMR6_HCDOR_HCDO22     (0x00400000UL)
#define TMR6_HCDOR_HCDO23_POS (23U)
#define TMR6_HCDOR_HCDO23     (0x00800000UL)
#define TMR6_HCDOR_HCDO26_POS (26U)
#define TMR6_HCDOR_HCDO26     (0x04000000UL)
#define TMR6_HCDOR_HCDO27_POS (27U)
#define TMR6_HCDOR_HCDO27     (0x08000000UL)

/*******************************************************************************
                Bit definition for Peripheral TMR6_COMMON
 *******************************************************************************/
/* Bit definition for TMR6_COMMON_FCNTR register */
#define TMR6_COMMON_FCNTR_NOFIENTA_POS (0U)
#define TMR6_COMMON_FCNTR_NOFIENTA     (0x00000001UL)
#define TMR6_COMMON_FCNTR_NOFICKTA_POS (1U)
#define TMR6_COMMON_FCNTR_NOFICKTA     (0x00000006UL)
#define TMR6_COMMON_FCNTR_NOFICKTA_0   (0x00000002UL)
#define TMR6_COMMON_FCNTR_NOFICKTA_1   (0x00000004UL)
#define TMR6_COMMON_FCNTR_NOFIENTB_POS (4U)
#define TMR6_COMMON_FCNTR_NOFIENTB     (0x00000010UL)
#define TMR6_COMMON_FCNTR_NOFICKTB_POS (5U)
#define TMR6_COMMON_FCNTR_NOFICKTB     (0x00000060UL)
#define TMR6_COMMON_FCNTR_NOFICKTB_0   (0x00000020UL)
#define TMR6_COMMON_FCNTR_NOFICKTB_1   (0x00000040UL)
#define TMR6_COMMON_FCNTR_NOFIENTC_POS (8U)
#define TMR6_COMMON_FCNTR_NOFIENTC     (0x00000100UL)
#define TMR6_COMMON_FCNTR_NOFICKTC_POS (9U)
#define TMR6_COMMON_FCNTR_NOFICKTC     (0x00000600UL)
#define TMR6_COMMON_FCNTR_NOFICKTC_0   (0x00000200UL)
#define TMR6_COMMON_FCNTR_NOFICKTC_1   (0x00000400UL)
#define TMR6_COMMON_FCNTR_NOFIENTD_POS (12U)
#define TMR6_COMMON_FCNTR_NOFIENTD     (0x00001000UL)
#define TMR6_COMMON_FCNTR_NOFICKTD_POS (13U)
#define TMR6_COMMON_FCNTR_NOFICKTD     (0x00006000UL)
#define TMR6_COMMON_FCNTR_NOFICKTD_0   (0x00002000UL)
#define TMR6_COMMON_FCNTR_NOFICKTD_1   (0x00004000UL)

/* Bit definition for TMR6_COMMON_SSTAR register */
#define TMR6_COMMON_SSTAR_SSTA1_POS (0U)
#define TMR6_COMMON_SSTAR_SSTA1     (0x00000001UL)
#define TMR6_COMMON_SSTAR_SSTA2_POS (1U)
#define TMR6_COMMON_SSTAR_SSTA2     (0x00000002UL)
#define TMR6_COMMON_SSTAR_SSTA3_POS (2U)
#define TMR6_COMMON_SSTAR_SSTA3     (0x00000004UL)
#define TMR6_COMMON_SSTAR_SSTA4_POS (3U)
#define TMR6_COMMON_SSTAR_SSTA4     (0x00000008UL)
#define TMR6_COMMON_SSTAR_SSTA5_POS (4U)
#define TMR6_COMMON_SSTAR_SSTA5     (0x00000010UL)
#define TMR6_COMMON_SSTAR_SSTA6_POS (5U)
#define TMR6_COMMON_SSTAR_SSTA6     (0x00000020UL)

