MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for TMR6_COMMON_SSTPR register */
#define TMR6_COMMON_SSTPR_SSTP1_POS (0U)
#define TMR6_COMMON_SSTPR_SSTP1     (0x00000001UL)
#define TMR6_COMMON_SSTPR_SSTP2_POS (1U)
#define TMR6_COMMON_SSTPR_SSTP2     (0x00000002UL)
#define TMR6_COMMON_SSTPR_SSTP3_POS (2U)
#define TMR6_COMMON_SSTPR_SSTP3     (0x00000004UL)
#define TMR6_COMMON_SSTPR_SSTP4_POS (3U)
#define TMR6_COMMON_SSTPR_SSTP4     (0x00000008UL)
#define TMR6_COMMON_SSTPR_SSTP5_POS (4U)
#define TMR6_COMMON_SSTPR_SSTP5     (0x00000010UL)
#define TMR6_COMMON_SSTPR_SSTP6_POS (5U)
#define TMR6_COMMON_SSTPR_SSTP6     (0x00000020UL)

/* Bit definition for TMR6_COMMON_SCLRR register */
#define TMR6_COMMON_SCLRR_SCLE1_POS (0U)
#define TMR6_COMMON_SCLRR_SCLE1     (0x00000001UL)
#define TMR6_COMMON_SCLRR_SCLE2_POS (1U)
#define TMR6_COMMON_SCLRR_SCLE2     (0x00000002UL)
#define TMR6_COMMON_SCLRR_SCLE3_POS (2U)
#define TMR6_COMMON_SCLRR_SCLE3     (0x00000004UL)
#define TMR6_COMMON_SCLRR_SCLE4_POS (3U)
#define TMR6_COMMON_SCLRR_SCLE4     (0x00000008UL)
#define TMR6_COMMON_SCLRR_SCLE5_POS (4U)
#define TMR6_COMMON_SCLRR_SCLE5     (0x00000010UL)
#define TMR6_COMMON_SCLRR_SCLE6_POS (5U)
#define TMR6_COMMON_SCLRR_SCLE6     (0x00000020UL)

/* Bit definition for TMR6_COMMON_SUPDR register */
#define TMR6_COMMON_SUPDR_SUPD1_POS (0U)
#define TMR6_COMMON_SUPDR_SUPD1     (0x00000001UL)
#define TMR6_COMMON_SUPDR_SUPD2_POS (1U)
#define TMR6_COMMON_SUPDR_SUPD2     (0x00000002UL)
#define TMR6_COMMON_SUPDR_SUPD3_POS (2U)
#define TMR6_COMMON_SUPDR_SUPD3     (0x00000004UL)
#define TMR6_COMMON_SUPDR_SUPD4_POS (3U)
#define TMR6_COMMON_SUPDR_SUPD4     (0x00000008UL)
#define TMR6_COMMON_SUPDR_SUPD5_POS (4U)
#define TMR6_COMMON_SUPDR_SUPD5     (0x00000010UL)
#define TMR6_COMMON_SUPDR_SUPD6_POS (5U)
#define TMR6_COMMON_SUPDR_SUPD6     (0x00000020UL)

/*******************************************************************************
                Bit definition for Peripheral TRLPWM
 *******************************************************************************/
/* Bit definition for TRLPWM_CR register */
#define TRLPWM_CR_TRLPWMEN_POS           (0U)
#define TRLPWM_CR_TRLPWMEN               (0x00000001UL)
#define TRLPWM_CR_BRAKEPOL_POS           (1U)
#define TRLPWM_CR_BRAKEPOL               (0x00000002UL)
#define TRLPWM_CR_POLARITY_POS           (2U)
#define TRLPWM_CR_POLARITY               (0x00000004UL)
#define TRLPWM_CR_CBCEB_POS              (3U)
#define TRLPWM_CR_CBCEB                  (0x00000008UL)
#define TRLPWM_CR_RESUMEALIGNEN_POS      (4U)
#define TRLPWM_CR_RESUMEALIGNEN          (0x00000010UL)
#define TRLPWM_CR_OPENSHUTDOWNPREDIV_POS (8U)
#define TRLPWM_CR_OPENSHUTDOWNPREDIV     (0x00001F00UL)
#define TRLPWM_CR_CBCPREDIV_POS          (16U)
#define TRLPWM_CR_CBCPREDIV              (0x00FF0000UL)
#define TRLPWM_CR_SFTSHUTDOWN_POS        (24U)
#define TRLPWM_CR_SFTSHUTDOWN            (0x01000000UL)
#define TRLPWM_CR_SFTOPEN_POS            (25U)
#define TRLPWM_CR_SFTOPEN                (0x02000000UL)

/* Bit definition for TRLPWM_BRAKESR register */
#define TRLPWM_BRAKESR_BRAKE (0x00000001UL)

/* Bit definition for TRLPWM_ISR register */
#define TRLPWM_ISR_SHUTDOWNSEQOCCUR (0x00000001UL)

/* Bit definition for TRLPWM_ICR register */
#define TRLPWM_ICR_SHUTDOWNSEQOCCURCLR (0x00000001UL)

/* Bit definition for TRLPWM_IER register */
#define TRLPWM_IER_SHUTDOWNSEQOCCURIE (0x00000001UL)

/* Bit definition for TRLPWM_CTLLEG register */
#define TRLPWM_CTLLEG_TRLPWMLEG1EN_POS      (0U)
#define TRLPWM_CTLLEG_TRLPWMLEG1EN          (0x00000001UL)
#define TRLPWM_CTLLEG_OUTPUTSTAGEBYPASS_POS (1U)
#define TRLPWM_CTLLEG_OUTPUTSTAGEBYPASS     (0x00000002UL)
#define TRLPWM_CTLLEG_INPUTPOLINV_POS       (2U)
#define TRLPWM_CTLLEG_INPUTPOLINV           (0x00000004UL)
#define TRLPWM_CTLLEG_ANPCEN_POS            (3U)
#define TRLPWM_CTLLEG_ANPCEN                (0x00000008UL)
#define TRLPWM_CTLLEG_FLTSD_POS             (8U)
#define TRLPWM_CTLLEG_FLTSD                 (0x00000300UL)
#define TRLPWM_CTLLEG_FLTSD_0               (0x00000100UL)
#define TRLPWM_CTLLEG_FLTSD_1               (0x00000200UL)
#define TRLPWM_CTLLEG_FLTSEL_POS            (10U)
#define TRLPWM_CTLLEG_FLTSEL                (0x0000FC00UL)

/* Bit definition for TRLPWM_DLYLEG register */
#define TRLPWM_DLYLEG_SHUTDOWNDLY_POS  (0U)
#define TRLPWM_DLYLEG_SHUTDOWNDLY      (0x000000FFUL)
#define TRLPWM_DLYLEG_OPENDLY_POS      (8U)
#define TRLPWM_DLYLEG_OPENDLY          (0x0000FF00UL)
#define TRLPWM_DLYLEG_CBCRESUMEDLY_POS (16U)
#define TRLPWM_DLYLEG_CBCRESUMEDLY     (0x00FF0000UL)

/* Bit definition for TRLPWM_SRLEG register */
#define TRLPWM_SRLEG_STATUS   (0x00000003UL)
#define TRLPWM_SRLEG_STATUS_0 (0x00000001UL)
#define TRLPWM_SRLEG_STATUS_1 (0x00000002UL)

/* Bit definition for TRLPWM_MISCCTRL register */
#define TRLPWM_MISCCTRL_LEGT1IN_SEL_POS  (0U)
#define TRLPWM_MISCCTRL_LEGT1IN_SEL      (0x00000007UL)
#define TRLPWM_MISCCTRL_LEGT1IN_SEL_0    (0x00000001UL)
#define TRLPWM_MISCCTRL_LEGT1IN_SEL_1    (0x00000002UL)
#define TRLPWM_MISCCTRL_LEGT1IN_SEL_2    (0x00000004UL)
#define TRLPWM_MISCCTRL_LEGT2IN_SEL_POS  (4U)
#define TRLPWM_MISCCTRL_LEGT2IN_SEL      (0x00000070UL)
#define TRLPWM_MISCCTRL_LEGT2IN_SEL_0    (0x00000010UL)
#define TRLPWM_MISCCTRL_LEGT2IN_SEL_1    (0x00000020UL)
#define TRLPWM_MISCCTRL_LEGT2IN_SEL_2    (0x00000040UL)
#define TRLPWM_MISCCTRL_LEGT3IN_SEL_POS  (8U)
#define TRLPWM_MISCCTRL_LEGT3IN_SEL      (0x00000700UL)
#define TRLPWM_MISCCTRL_LEGT3IN_SEL_0    (0x00000100UL)
#define TRLPWM_MISCCTRL_LEGT3IN_SEL_1    (0x00000200UL)
#define TRLPWM_MISCCTRL_LEGT3IN_SEL_2    (0x00000400UL)
#define TRLPWM_MISCCTRL_LEGT4IN_SEL_POS  (12U)
#define TRLPWM_MISCCTRL_LEGT4IN_SEL      (0x00007000UL)
#define TRLPWM_MISCCTRL_LEGT4IN_SEL_0    (0x00001000UL)
#define TRLPWM_MISCCTRL_LEGT4IN_SEL_1    (0x00002000UL)
#define TRLPWM_MISCCTRL_LEGT4IN_SEL_2    (0x00004000UL)
#define TRLPWM_MISCCTRL_LEGT5IN_SEL_POS  (16U)
#define TRLPWM_MISCCTRL_LEGT5IN_SEL      (0x00070000UL)
#define TRLPWM_MISCCTRL_LEGT5IN_SEL_0    (0x00010000UL)
#define TRLPWM_MISCCTRL_LEGT5IN_SEL_1    (0x00020000UL)
#define TRLPWM_MISCCTRL_LEGT5IN_SEL_2    (0x00040000UL)
#define TRLPWM_MISCCTRL_LEGT6IN_SEL_POS  (20U)
#define TRLPWM_MISCCTRL_LEGT6IN_SEL      (0x00700000UL)
#define TRLPWM_MISCCTRL_LEGT6IN_SEL_0    (0x00100000UL)
#define TRLPWM_MISCCTRL_LEGT6IN_SEL_1    (0x00200000UL)
#define TRLPWM_MISCCTRL_LEGT6IN_SEL_2    (0x00400000UL)
#define TRLPWM_MISCCTRL_LEG_ALIGNDLY_POS (24U)
#define TRLPWM_MISCCTRL_LEG_ALIGNDLY     (0x3F000000UL)

/* Bit definition for TRLPWM_REVIDR register */
#define TRLPWM_REVIDR_REVID (0x000000FFUL)

