MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/*******************************************************************************
                Bit definition for Peripheral TRNG
 *******************************************************************************/
/* Bit definition for TRNG_CR register */
#define TRNG_CR_EN_POS       (0U)
#define TRNG_CR_EN           (0x00000001UL)
#define TRNG_CR_RUN_POS      (1U)
#define TRNG_CR_RUN          (0x00000002UL)
#define TRNG_CR_RNGHMSEL_POS (4U)
#define TRNG_CR_RNGHMSEL     (0x00000010UL)

/* Bit definition for TRNG_MR register */
#define TRNG_MR_LOAD_POS (0U)
#define TRNG_MR_LOAD     (0x00000001UL)
#define TRNG_MR_CNT_POS  (2U)
#define TRNG_MR_CNT      (0x0000001CUL)

/* Bit definition for TRNG_DR0 register */
#define TRNG_DR0 (0xFFFFFFFFUL)

/* Bit definition for TRNG_DR1 register */
#define TRNG_DR1 (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral USART
 *******************************************************************************/
/* Bit definition for USART_SR register */
#define USART_SR_PE_POS      (0U)
#define USART_SR_PE          (0x00000001UL)
#define USART_SR_FE_POS      (1U)
#define USART_SR_FE          (0x00000002UL)
#define USART_SR_ORE_POS     (3U)
#define USART_SR_ORE         (0x00000008UL)
#define USART_SR_BE_POS      (4U)
#define USART_SR_BE          (0x00000010UL)
#define USART_SR_RXNE_POS    (5U)
#define USART_SR_RXNE        (0x00000020UL)
#define USART_SR_TC_POS      (6U)
#define USART_SR_TC          (0x00000040UL)
#define USART_SR_TXE_POS     (7U)
#define USART_SR_TXE         (0x00000080UL)
#define USART_SR_RTOF_POS    (8U)
#define USART_SR_RTOF        (0x00000100UL)
#define USART_SR_WKUP_POS    (9U)
#define USART_SR_WKUP        (0x00000200UL)
#define USART_SR_LBD_POS     (10U)
#define USART_SR_LBD         (0x00000400UL)
#define USART_SR_TEND_POS    (11U)
#define USART_SR_TEND        (0x00000800UL)
#define USART_SR_LBM_POS     (12U)
#define USART_SR_LBM         (0x00001000UL)
#define USART_SR_ABRE_POS    (13U)
#define USART_SR_ABRE        (0x00002000UL)
#define USART_SR_ABROVR_POS  (14U)
#define USART_SR_ABROVR      (0x00004000UL)
#define USART_SR_ABRBUSY_POS (15U)
#define USART_SR_ABRBUSY     (0x00008000UL)
#define USART_SR_MPB_POS     (16U)
#define USART_SR_MPB         (0x00010000UL)
#define USART_SR_ABRF_POS    (17U)
#define USART_SR_ABRF        (0x00020000UL)

/* Bit definition for USART_TDR register */
#define USART_TDR_TDR_POS  (0U)
#define USART_TDR_TDR      (0x01FFU)
#define USART_TDR_MPID_POS (9U)
#define USART_TDR_MPID     (0x0200U)

/* Bit definition for USART_RDR register */
#define USART_RDR_RDR (0x01FFU)

/* Bit definition for USART_BRR register */
#define USART_BRR_DIV_FRACTION_POS (0U)
#define USART_BRR_DIV_FRACTION     (0x0000007FUL)
#define USART_BRR_DIV_INTEGER_POS  (8U)
#define USART_BRR_DIV_INTEGER      (0x0000FF00UL)

/* Bit definition for USART_CR1 register */
#define USART_CR1_RTOE_POS   (0U)
#define USART_CR1_RTOE       (0x00000001UL)
#define USART_CR1_RTOIE_POS  (1U)
#define USART_CR1_RTOIE      (0x00000002UL)
#define USART_CR1_RE_POS     (2U)
#define USART_CR1_RE         (0x00000004UL)
#define USART_CR1_TE_POS     (3U)
#define USART_CR1_TE         (0x00000008UL)
#define USART_CR1_SLME_POS   (4U)
#define USART_CR1_SLME       (0x00000010UL)
#define USART_CR1_RIE_POS    (5U)
#define USART_CR1_RIE        (0x00000020UL)
#define USART_CR1_TCIE_POS   (6U)
#define USART_CR1_TCIE       (0x00000040UL)
#define USART_CR1_TXEIE_POS  (7U)
#define USART_CR1_TXEIE      (0x00000080UL)
#define USART_CR1_TENDIE_POS (8U)
#define USART_CR1_TENDIE     (0x00000100UL)
#define USART_CR1_PS_POS     (9U)
#define USART_CR1_PS         (0x00000200UL)
#define USART_CR1_PCE_POS    (10U)
#define USART_CR1_PCE        (0x00000400UL)
#define USART_CR1_ABREI_POS  (11U)
#define USART_CR1_ABREI      (0x00000800UL)
#define USART_CR1_M_POS      (12U)
#define USART_CR1_M          (0x00001000UL)
#define USART_CR1_ABREN_POS  (13U)
#define USART_CR1_ABREN      (0x00002000UL)
#define USART_CR1_OVER8_POS  (15U)
#define USART_CR1_OVER8      (0x00008000UL)
#define USART_CR1_CPE_POS    (16U)
#define USART_CR1_CPE        (0x00010000UL)
#define USART_CR1_CFE_POS    (17U)
#define USART_CR1_CFE        (0x00020000UL)
#define USART_CR1_CORE_POS   (19U)
#define USART_CR1_CORE       (0x00080000UL)
#define USART_CR1_CRTOF_POS  (20U)
#define USART_CR1_CRTOF      (0x00100000UL)
#define USART_CR1_CBE_POS    (21U)
#define USART_CR1_CBE        (0x00200000UL)
#define USART_CR1_CWKUP_POS  (22U)
#define USART_CR1_CWKUP      (0x00400000UL)
#define USART_CR1_CLBD_POS   (23U)
#define USART_CR1_CLBD       (0x00800000UL)
#define USART_CR1_MS_POS     (24U)
#define USART_CR1_MS         (0x01000000UL)
#define USART_CR1_CTEND_POS  (25U)
#define USART_CR1_CTEND      (0x02000000UL)
#define USART_CR1_CLBM_POS   (26U)
#define USART_CR1_CLBM       (0x04000000UL)
#define USART_CR1_ML_POS     (28U)
#define USART_CR1_ML         (0x10000000UL)
#define USART_CR1_FBME_POS   (29U)
#define USART_CR1_FBME       (0x20000000UL)
#define USART_CR1_NFE_POS    (30U)
#define USART_CR1_NFE        (0x40000000UL)
#define USART_CR1_SBS_POS    (31U)
#define USART_CR1_SBS        (0x80000000UL)

/* Bit definition for USART_CR2 register */
#define USART_CR2_MPE_POS     (0U)
#define USART_CR2_MPE         (0x00000001UL)
#define USART_CR2_WKUPIE_POS  (1U)
#define USART_CR2_WKUPIE      (0x00000002UL)
#define USART_CR2_BEIE_POS    (2U)
#define USART_CR2_BEIE        (0x00000004UL)
#define USART_CR2_BEE_POS     (3U)
#define USART_CR2_BEE         (0x00000008UL)
#define USART_CR2_LBDIE_POS   (4U)
#define USART_CR2_LBDIE       (0x00000010UL)
#define USART_CR2_LBDL_POS    (5U)
#define USART_CR2_LBDL        (0x00000020UL)
#define USART_CR2_SBKL_POS    (6U)
#define USART_CR2_SBKL        (0x000000C0UL)
#define USART_CR2_SBKL_0      (0x00000040UL)
#define USART_CR2_SBKL_1      (0x00000080UL)
#define USART_CR2_WKUPE_POS   (8U)
#define USART_CR2_WKUPE       (0x00000100UL)
#define USART_CR2_CLKC_POS    (11U)
#define USART_CR2_CLKC        (0x00001800UL)
#define USART_CR2_CLKC_0      (0x00000800UL)
#define USART_CR2_CLKC_1      (0x00001000UL)
#define USART_CR2_STOP_POS    (13U)
#define USART_CR2_STOP        (0x00002000UL)
#define USART_CR2_LINEN_POS   (14U)
#define USART_CR2_LINEN       (0x00004000UL)
#define USART_CR2_UATSBKE_POS (15U)
#define USART_CR2_UATSBKE     (0x00008000UL)
#define USART_CR2_SBK_POS     (16U)
#define USART_CR2_SBK         (0x00010000UL)
#define USART_CR2_SBKM_POS    (17U)
#define USART_CR2_SBKM        (0x00020000UL)
#define USART_CR2_LBMIE_POS   (19U)
#define USART_CR2_LBMIE       (0x00080000UL)
#define USART_CR2_REIE_POS    (22U)
#define USART_CR2_REIE        (0x00400000UL)
#define USART_CR2_MKERR_POS   (23U)
#define USART_CR2_MKERR       (0x00800000UL)
#define USART_CR2_MPDR_POS    (24U)
#define USART_CR2_MPDR        (0xFF000000UL)

/* Bit definition for USART_CR3 register */
#define USART_CR3_HDSEL_POS  (3U)
#define USART_CR3_HDSEL      (0x00000008UL)
#define USART_CR3_LOOP_POS   (4U)
#define USART_CR3_LOOP       (0x00000010UL)
#define USART_CR3_RTSE_POS   (8U)
#define USART_CR3_RTSE       (0x00000100UL)
#define USART_CR3_CTSE_POS   (9U)
#define USART_CR3_CTSE       (0x00000200UL)
#define USART_CR3_DED_POS    (10U)
#define USART_CR3_DED        (0x00003C00UL)
#define USART_CR3_TDS_POS    (14U)
#define USART_CR3_TDS        (0x0000C000UL)
#define USART_CR3_TDS_0      (0x00004000UL)
#define USART_CR3_TDS_1      (0x00008000UL)
#define USART_CR3_CABR_POS   (17U)
#define USART_CR3_CABR       (0x00020000UL)
#define USART_CR3_ABRMOD_POS (18U)
#define USART_CR3_ABRMOD     (0x000C0000UL)
#define USART_CR3_ABRMOD_0   (0x00040000UL)
#define USART_CR3_ABRMOD_1   (0x00080000UL)
#define USART_CR3_DEA_POS    (25U)
#define USART_CR3_DEA        (0x1E000000UL)
#define USART_CR3_DEM_POS    (30U)
#define USART_CR3_DEM        (0x40000000UL)
#define USART_CR3_DEP_POS    (31U)
#define USART_CR3_DEP        (0x80000000UL)

