MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
/* Bit definition for USART_PR register */
#define USART_PR_PSC_POS    (0U)
#define USART_PR_PSC        (0x00000003UL)
#define USART_PR_PSC_0      (0x00000001UL)
#define USART_PR_PSC_1      (0x00000002UL)
#define USART_PR_LBMPSC_POS (2U)
#define USART_PR_LBMPSC     (0x0000000CUL)
#define USART_PR_LBMPSC_0   (0x00000004UL)
#define USART_PR_LBMPSC_1   (0x00000008UL)
#define USART_PR_ULBREN_POS (4U)
#define USART_PR_ULBREN     (0x00000010UL)
#define USART_PR_RTOB_POS   (8U)
#define USART_PR_RTOB       (0x00000F00UL)

/* Bit definition for USART_LBMC register */
#define USART_LBMC_LBMC (0x0000FFFFUL)

/*******************************************************************************
                Bit definition for Peripheral VREF
 *******************************************************************************/
/* Bit definition for VREF_BGRCR register */
#define VREF_BGRCR_BGREN (0x00000001UL)

/* Bit definition for VREF_CSCR register */
#define VREF_CSCR_CSEN (0x00000001UL)

/* Bit definition for VREF_CR register */
#define VREF_CR_AVCCMONEN_POS (0U)
#define VREF_CR_AVCCMONEN     (0x00000001UL)
#define VREF_CR_VREFINTEN_POS (1U)
#define VREF_CR_VREFINTEN     (0x00000002UL)
#define VREF_CR_IVREFEN_POS   (2U)
#define VREF_CR_IVREFEN       (0x00000004UL)
#define VREF_CR_HIZ_POS       (3U)
#define VREF_CR_HIZ           (0x00000008UL)
#define VREF_CR_AVCCMONS_POS  (4U)
#define VREF_CR_AVCCMONS      (0x00000030UL)
#define VREF_CR_AVCCMONS_0    (0x00000010UL)
#define VREF_CR_AVCCMONS_1    (0x00000020UL)

/* Bit definition for VREF_SELV register */
#define VREF_SELV_VREFVS_POS (6U)
#define VREF_SELV_VREFVS     (0x000000C0UL)
#define VREF_SELV_VREFVS_0   (0x00000040UL)
#define VREF_SELV_VREFVS_1   (0x00000080UL)

/*******************************************************************************
                Bit definition for Peripheral WDT
 *******************************************************************************/
/* Bit definition for WDT_CR register */
#define WDT_CR_PERI_POS   (0U)
#define WDT_CR_PERI       (0x00000003UL)
#define WDT_CR_PERI_0     (0x00000001UL)
#define WDT_CR_PERI_1     (0x00000002UL)
#define WDT_CR_CKS_POS    (4U)
#define WDT_CR_CKS        (0x000000F0UL)
#define WDT_CR_WDPT_POS   (8U)
#define WDT_CR_WDPT       (0x00000F00UL)
#define WDT_CR_SLPOFF_POS (16U)
#define WDT_CR_SLPOFF     (0x00010000UL)
#define WDT_CR_ITS_POS    (31U)
#define WDT_CR_ITS        (0x80000000UL)

/* Bit definition for WDT_SR register */
#define WDT_SR_CNT_POS (0U)
#define WDT_SR_CNT     (0x0000FFFFUL)
#define WDT_SR_UDF_POS (16U)
#define WDT_SR_UDF     (0x00010000UL)
#define WDT_SR_REF_POS (17U)
#define WDT_SR_REF     (0x00020000UL)

/* Bit definition for WDT_RR register */
#define WDT_RR_RF (0x0000FFFFUL)

/*******************************************************************************
                Bit definition for Peripheral XBAR
 *******************************************************************************/
/* Bit definition for XBAR_HECR register */
#define XBAR_HECR_SEL1_POS (0U)
#define XBAR_HECR_SEL1     (0x0000003FUL)
#define XBAR_HECR_SEL2_POS (8U)
#define XBAR_HECR_SEL2     (0x00000700UL)
#define XBAR_HECR_SEL3_POS (16U)
#define XBAR_HECR_SEL3     (0x007F0000UL)
#define XBAR_HECR_STA1_POS (29U)
#define XBAR_HECR_STA1     (0x20000000UL)
#define XBAR_HECR_STA2_POS (30U)
#define XBAR_HECR_STA2     (0x40000000UL)
#define XBAR_HECR_STA3_POS (31U)
#define XBAR_HECR_STA3     (0x80000000UL)

/* Bit definition for XBAR_MICR register */
#define XBAR_MICR_MDSEL_POS  (0U)
#define XBAR_MICR_MDSEL      (0x0000001FUL)
#define XBAR_MICR_ICLSEL_POS (8U)
#define XBAR_MICR_ICLSEL     (0x00001F00UL)
#define XBAR_MICR_MDSTA_POS  (30U)
#define XBAR_MICR_MDSTA      (0x40000000UL)
#define XBAR_MICR_ICLSTA_POS (31U)
#define XBAR_MICR_ICLSTA     (0x80000000UL)

/* Bit definition for XBAR_MICR16 register */
#define XBAR_MICR16_ICLSEL_POS (8U)
#define XBAR_MICR16_ICLSEL     (0x00001F00UL)
#define XBAR_MICR16_MDSTA_POS  (30U)
#define XBAR_MICR16_MDSTA      (0x40000000UL)
#define XBAR_MICR16_ICLSTA_POS (31U)
#define XBAR_MICR16_ICLSTA     (0x80000000UL)

/* Bit definition for XBAR_HEBCR register */
#define XBAR_HEBCR_SEL1_POS (0U)
#define XBAR_HEBCR_SEL1     (0x0000003FUL)
#define XBAR_HEBCR_SEL2_POS (8U)
#define XBAR_HEBCR_SEL2     (0x00000700UL)
#define XBAR_HEBCR_SEL3_POS (16U)
#define XBAR_HEBCR_SEL3     (0x003F0000UL)
#define XBAR_HEBCR_STA1_POS (29U)
#define XBAR_HEBCR_STA1     (0x20000000UL)
#define XBAR_HEBCR_STA2_POS (30U)
#define XBAR_HEBCR_STA2     (0x40000000UL)
#define XBAR_HEBCR_STA3_POS (31U)
#define XBAR_HEBCR_STA3     (0x80000000UL)

/* Bit definition for XBAR_TECR register */
#define XBAR_TECR_TESEL_POS (0U)
#define XBAR_TECR_TESEL     (0x0000007FUL)
#define XBAR_TECR_TESTA_POS (31U)
#define XBAR_TECR_TESTA     (0x80000000UL)

/* Bit definition for XBAR_TRLCR register */
#define XBAR_TRLCR_TRLSEL_POS (0U)
#define XBAR_TRLCR_TRLSEL     (0x0000001FUL)
#define XBAR_TRLCR_TRLSTA_POS (31U)
#define XBAR_TRLCR_TRLSTA     (0x80000000UL)

    /***************************************************************************** */
    /* Device Specific Registers bit_band structure */
    /***************************************************************************** */

    typedef struct
    {
        __IO uint32_t STRT;
        uint32_t RESERVED0[7];
    } stc_adc_str_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[6];
        __IO uint32_t CLREN;
        __IO uint32_t DFMT;
        uint32_t RESERVED1[8];
    } stc_adc_cr0_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[2];
        __IO uint32_t RSCHSEL;
        uint32_t RESERVED1[13];
    } stc_adc_cr1_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[12];
        __IO uint32_t OVSMOD;
        uint32_t RESERVED1[3];
    } stc_adc_cr2_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[7];
        __IO uint32_t TRGENA;
        uint32_t RESERVED1[7];
        __IO uint32_t TRGENB;
        uint32_t RESERVED2[7];
        __IO uint32_t TRGENC;
        uint32_t RESERVED3[8];
    } stc_adc_trgsr_bit_t;

    typedef struct
    {
        __I uint32_t EOCAF;
        __I uint32_t EOCBF;
        __I uint32_t EOCCF;
        uint32_t RESERVED0[1];
        __I uint32_t SASTPDF;
        __I uint32_t SBSTPDF;
        uint32_t RESERVED1[2];
    } stc_adc_isr_bit_t;

    typedef struct
    {
        __IO uint32_t EOCAIEN;
        __IO uint32_t EOCBIEN;
        __IO uint32_t EOCCIEN;
        uint32_t RESERVED0[5];
    } stc_adc_icr_bit_t;

    typedef struct
    {
        __IO uint32_t CLREOCAF;
        __IO uint32_t CLREOCBF;
        __IO uint32_t CLREOCCF;
        uint32_t RESERVED0[1];
        __IO uint32_t CLRSASTPDF;
        __IO uint32_t CLRSBSTPDF;
        uint32_t RESERVED1[2];
    } stc_adc_isclrr_bit_t;

    typedef struct
    {
        __IO uint32_t SYNCEN;
        uint32_t RESERVED0[15];
    } stc_adc_synccr_bit_t;

    typedef struct
    {
        __IO uint32_t AWD0EN;
        __IO uint32_t AWD0IEN;
        __IO uint32_t AWD0MD;
        uint32_t RESERVED0[1];
        __IO uint32_t AWD1EN;
        __IO uint32_t AWD1IEN;
        __IO uint32_t AWD1MD;
        uint32_t RESERVED1[9];
    } stc_adc_awdcr_bit_t;

    typedef struct
    {
        __I uint32_t AWD0F;
        __I uint32_t AWD1F;
        uint32_t RESERVED0[2];
        __I uint32_t AWDCMF;
        uint32_t RESERVED1[3];
    } stc_adc_awdsr_bit_t;

    typedef struct
    {
        __IO uint32_t CLRAWD0F;
        __IO uint32_t CLRAWD1F;
        uint32_t RESERVED0[2];
        __IO uint32_t CLRAWDCMF;
        uint32_t RESERVED1[3];
    } stc_adc_awdsclrr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[24];
        __IO uint32_t OFFSETPOS;
        __IO uint32_t SATEN;
        uint32_t RESERVED1[5];
        __IO uint32_t OFFSETEN;
    } stc_adc_ofr_bit_t;

    typedef struct
    {
        __O uint32_t STRG;
        uint32_t RESERVED0[31];
    } stc_aos_intsfttrg_bit_t;

    typedef struct
    {
        __IO uint32_t NFEN1;
        uint32_t RESERVED0[7];
        __IO uint32_t NFEN2;
        uint32_t RESERVED1[7];
        __IO uint32_t NFEN3;
        uint32_t RESERVED2[7];
        __IO uint32_t NFEN4;
        uint32_t RESERVED3[7];
    } stc_aos_pevntnfcr_bit_t;

    typedef struct
    {
        __IO uint32_t CENA;
        uint32_t RESERVED0[3];
        __IO uint32_t WDEN;
        uint32_t RESERVED1[2];
        __IO uint32_t CSST;
    } stc_cmp_mdr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[3];
        __IO uint32_t CIEN;
        uint32_t RESERVED1[2];
        __IO uint32_t CFF;
        __IO uint32_t CRF;
    } stc_cmp_fir_bit_t;

    typedef struct
    {
        __IO uint32_t COEN;
        __IO uint32_t COPS;
        __IO uint32_t CPOE;
        uint32_t RESERVED0[1];
        __IO uint32_t BWEN;
        __IO uint32_t BWMD;
        uint32_t RESERVED1[2];
    } stc_cmp_ocr_bit_t;

    typedef struct
    {
        __I uint32_t CMON;
        uint32_t RESERVED0[7];
    } stc_cmp_omr_bit_t;

    typedef struct
    {
        __IO uint32_t CTWS0;
        __IO uint32_t CTWS1;
        __IO uint32_t CTWS2;
        __IO uint32_t CTWS3;
        __IO uint32_t CTWS4;
        __IO uint32_t CTWS5;
        __IO uint32_t CTWS6;
        __IO uint32_t CTWS7;
        __IO uint32_t CTWS8;
        __IO uint32_t CTWS9;
        __IO uint32_t CTWS10;
        __IO uint32_t CTWS11;
        __IO uint32_t CTWS12;
        __IO uint32_t CTWS13;
        uint32_t RESERVED0[2];
        __IO uint32_t CTWP0;
        __IO uint32_t CTWP1;
        __IO uint32_t CTWP2;
        __IO uint32_t CTWP3;
        __IO uint32_t CTWP4;
        __IO uint32_t CTWP5;
        __IO uint32_t CTWP6;
        __IO uint32_t CTWP7;
        __IO uint32_t CTWP8;
        __IO uint32_t CTWP9;
        __IO uint32_t CTWP10;
        __IO uint32_t CTWP11;
        __IO uint32_t CTWP12;
        __IO uint32_t CTWP13;
        uint32_t RESERVED1[2];
    } stc_cmp_bwsr1_bit_t;

    typedef struct
    {
        __IO uint32_t LRCSTP;
        uint32_t RESERVED0[7];
    } stc_cmu_lrccr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[3];
        __IO uint32_t XTALMS;
        uint32_t RESERVED1[4];
    } stc_cmu_xtalcfgr_bit_t;

    typedef struct
    {
        __IO uint32_t PLLHOFF;
        uint32_t RESERVED0[7];
    } stc_cmu_pllhcr_bit_t;

    typedef struct
    {
        __IO uint32_t XTALSTP;
        uint32_t RESERVED0[7];
    } stc_cmu_xtalcr_bit_t;

    typedef struct
    {
        __IO uint32_t HRCSTP;
        uint32_t RESERVED0[7];
    } stc_cmu_hrccr_bit_t;

    typedef struct
    {
        __IO uint32_t MRCSTP;
        uint32_t RESERVED0[7];
    } stc_cmu_mrccr_bit_t;

    typedef struct
    {
        __I uint32_t HRCSTBF;
        uint32_t RESERVED0[2];
        __I uint32_t XTALSTBF;
        uint32_t RESERVED1[1];
        __I uint32_t PLLHSTBF;
        uint32_t RESERVED2[2];
    } stc_cmu_oscstbsr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[7];
        __IO uint32_t MCOEN;
    } stc_cmu_mcocfgr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[7];
        __IO uint32_t TPIUCKOE;
    } stc_cmu_tpiuckcfgr_bit_t;

    typedef struct
    {
        __IO uint32_t XTALSTDIE;
        __IO uint32_t XTALSTDRE;
        __IO uint32_t XTALSTDRIS;
        uint32_t RESERVED0[4];
        __IO uint32_t XTALSTDE;
    } stc_cmu_xtalstdcr_bit_t;

    typedef struct
    {
        __IO uint32_t XTALSTDF;
        uint32_t RESERVED0[7];
    } stc_cmu_xtalstdsr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[7];
        __IO uint32_t PLLSRC;
        uint32_t RESERVED1[24];
    } stc_cmu_pllhcfgr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[16];
        __IO uint32_t IEN;
        __IO uint32_t DMAREN;
        __IO uint32_t DMAWEN;
        __IO uint32_t NRES;
        __IO uint32_t NARGS;
        __IO uint32_t RESSIZE;
        __IO uint32_t ARGSIZE;
        __IO uint32_t FLOAT;
        __IO uint32_t EXTMOD;
        uint32_t RESERVED1[5];
        __I uint32_t BUSY;
        __I uint32_t RRDY;
    } stc_cordic_csr_bit_t;

    typedef struct
    {
        __IO uint32_t ARG1_UP_OV_IEN;
        uint32_t RESERVED0[3];
        __IO uint32_t RES1_UP_OV_IEN;
        __IO uint32_t RES1_DW_OV_IEN;
        __IO uint32_t RES2_UP_OV_IEN;
        __IO uint32_t RES2_DW_OV_IEN;
        __IO uint32_t WDATA_LOSS_IEN;
        uint32_t RESERVED1[23];
    } stc_cordic_inten_bit_t;

    typedef struct
    {
        __I uint32_t ARG1_UP_OV_ISR;
        uint32_t RESERVED0[3];
        __I uint32_t RES1_UP_OV_ISR;
        __I uint32_t RES1_DW_OV_ISR;
        __I uint32_t RES2_UP_OV_ISR;
        __I uint32_t RES2_DW_OV_ISR;
        __IO uint32_t WDATA_LOSS_ISR;
        uint32_t RESERVED1[23];
    } stc_cordic_isr_bit_t;

    typedef struct
    {
        __O uint32_t ARG1_UP_OV_ICR;
        uint32_t RESERVED0[3];
        __O uint32_t RES1_UP_OV_ICR;
        __O uint32_t RES1_DW_OV_ICR;
        __O uint32_t RES2_UP_OV_ICR;
        __O uint32_t RES2_DW_OV_ICR;
        __O uint32_t WDATA_LOSS_ICR;
        uint32_t RESERVED1[23];
    } stc_cordic_icr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[1];
        __I uint32_t FLAG;
        uint32_t RESERVED1[30];
    } stc_crc_cr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[6];
        __IO uint32_t ERRIE;
        __IO uint32_t CTCEN;
        uint32_t RESERVED1[24];
    } stc_ctc_cr1_bit_t;

    typedef struct
    {
        __I uint32_t TRIMOK;
        __I uint32_t TRMOVF;
        __I uint32_t TRMUDF;
        __I uint32_t CTCBSY;
        uint32_t RESERVED0[28];
    } stc_ctc_str_bit_t;

    typedef struct
    {
        __IO uint32_t DAE;
        __IO uint32_t DA1E;
        __IO uint32_t DA2E;
        uint32_t RESERVED0[5];
        __IO uint32_t DPSEL;
        __IO uint32_t DAAMP1;
        __IO uint32_t DAAMP2;
        uint32_t RESERVED1[3];
        __IO uint32_t RAMPDIR1;
        __IO uint32_t RAMPDIR2;
    } stc_dac_dacr_bit_t;

    typedef struct
    {
        __IO uint32_t ADCSL1;
        __IO uint32_t ADCSL2;
        __IO uint32_t ADCSL3;
        __IO uint32_t ADCSL4;
        uint32_t RESERVED0[4];
        __I uint32_t DA1SF;
        __I uint32_t DA2SF;
        uint32_t RESERVED1[5];
        __IO uint32_t ADPEN;
    } stc_dac_daadpcr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[6];
        __IO uint32_t DAODIS1;
        __IO uint32_t DAODIS2;
    } stc_dac_daocr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[13];
        __IO uint32_t DEMD1;
        __IO uint32_t RAMPMD1;
        __IO uint32_t LDMD1;
        uint32_t RESERVED1[13];
        __IO uint32_t DEMD2;
        __IO uint32_t RAMPMD2;
        __IO uint32_t LDMD2;
    } stc_dac_dacr2_bit_t;

    typedef struct
    {
        __O uint32_t RSTSWTRG1;
        __O uint32_t STEPSWTRG1;
        __O uint32_t RSTSWTRG2;
        __O uint32_t STEPSWTRG2;
        uint32_t RESERVED0[12];
    } stc_dac_rampswtrgr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __IO uint32_t RAMPLOADSEL1;
        __IO uint32_t CMPSCTL1;
        __IO uint32_t OFSTDIR1;
        __IO uint32_t OFSTMD1;
        uint32_t RESERVED1[4];
        __IO uint32_t RAMPLOADSEL2;
        __IO uint32_t CMPSCTL2;
        __IO uint32_t OFSTDIR2;
        __IO uint32_t OFSTMD2;
    } stc_dac_dacr3_bit_t;

    typedef struct
    {
        __IO uint32_t EN;
        uint32_t RESERVED0[31];
    } stc_dma_en_bit_t;

    typedef struct
    {
        __I uint32_t TRNERR0;
        __I uint32_t TRNERR1;
        __I uint32_t TRNERR2;
        __I uint32_t TRNERR3;
        __I uint32_t TRNERR4;
        __I uint32_t TRNERR5;
        __I uint32_t TRNERR6;
        __I uint32_t TRNERR7;
        uint32_t RESERVED0[8];
        __I uint32_t REQERR0;
        __I uint32_t REQERR1;
        __I uint32_t REQERR2;
        __I uint32_t REQERR3;
        __I uint32_t REQERR4;
        __I uint32_t REQERR5;
        __I uint32_t REQERR6;
        __I uint32_t REQERR7;
        uint32_t RESERVED1[8];
    } stc_dma_intstat0_bit_t;

    typedef struct
    {
        __I uint32_t TC0;
        __I uint32_t TC1;
        __I uint32_t TC2;
        __I uint32_t TC3;
        __I uint32_t TC4;
        __I uint32_t TC5;
        __I uint32_t TC6;
        __I uint32_t TC7;
        uint32_t RESERVED0[8];
        __I uint32_t BTC0;
        __I uint32_t BTC1;
        __I uint32_t BTC2;
        __I uint32_t BTC3;
        __I uint32_t BTC4;
        __I uint32_t BTC5;
        __I uint32_t BTC6;
        __I uint32_t BTC7;
        uint32_t RESERVED1[8];
    } stc_dma_intstat1_bit_t;

    typedef struct
    {
        __IO uint32_t MSKTRNERR0;
        __IO uint32_t MSKTRNERR1;
        __IO uint32_t MSKTRNERR2;
        __IO uint32_t MSKTRNERR3;
        __IO uint32_t MSKTRNERR4;
        __IO uint32_t MSKTRNERR5;
        __IO uint32_t MSKTRNERR6;
        __IO uint32_t MSKTRNERR7;
        uint32_t RESERVED0[8];
        __IO uint32_t MSKREQERR0;
        __IO uint32_t MSKREQERR1;
        __IO uint32_t MSKREQERR2;
        __IO uint32_t MSKREQERR3;
        __IO uint32_t MSKREQERR4;
        __IO uint32_t MSKREQERR5;
        __IO uint32_t MSKREQERR6;
        __IO uint32_t MSKREQERR7;
        uint32_t RESERVED1[8];
    } stc_dma_intmask0_bit_t;

    typedef struct
    {
        __IO uint32_t MSKTC0;
        __IO uint32_t MSKTC1;
        __IO uint32_t MSKTC2;
        __IO uint32_t MSKTC3;
        __IO uint32_t MSKTC4;
        __IO uint32_t MSKTC5;
        __IO uint32_t MSKTC6;
        __IO uint32_t MSKTC7;
        uint32_t RESERVED0[8];
        __IO uint32_t MSKBTC0;
        __IO uint32_t MSKBTC1;
        __IO uint32_t MSKBTC2;
        __IO uint32_t MSKBTC3;
        __IO uint32_t MSKBTC4;
        __IO uint32_t MSKBTC5;
        __IO uint32_t MSKBTC6;
        __IO uint32_t MSKBTC7;
        uint32_t RESERVED1[8];
    } stc_dma_intmask1_bit_t;

    typedef struct
    {
        __IO uint32_t CLRTRNERR0;
        __IO uint32_t CLRTRNERR1;
        __IO uint32_t CLRTRNERR2;
        __IO uint32_t CLRTRNERR3;
        __IO uint32_t CLRTRNERR4;
        __IO uint32_t CLRTRNERR5;
        __IO uint32_t CLRTRNERR6;
        __IO uint32_t CLRTRNERR7;
        uint32_t RESERVED0[8];
        __IO uint32_t CLRREQERR0;
        __IO uint32_t CLRREQERR1;
        __IO uint32_t CLRREQERR2;
        __IO uint32_t CLRREQERR3;
        __IO uint32_t CLRREQERR4;
        __IO uint32_t CLRREQERR5;
        __IO uint32_t CLRREQERR6;
        __IO uint32_t CLRREQERR7;
        uint32_t RESERVED1[8];
    } stc_dma_intclr0_bit_t;

    typedef struct
    {
        __IO uint32_t CLRTC0;
        __IO uint32_t CLRTC1;
        __IO uint32_t CLRTC2;
        __IO uint32_t CLRTC3;
        __IO uint32_t CLRTC4;
        __IO uint32_t CLRTC5;
        __IO uint32_t CLRTC6;
        __IO uint32_t CLRTC7;
        uint32_t RESERVED0[8];
        __IO uint32_t CLRBTC0;
        __IO uint32_t CLRBTC1;
        __IO uint32_t CLRBTC2;
        __IO uint32_t CLRBTC3;
        __IO uint32_t CLRBTC4;
        __IO uint32_t CLRBTC5;
        __IO uint32_t CLRBTC6;
        __IO uint32_t CLRBTC7;
        uint32_t RESERVED1[8];
    } stc_dma_intclr1_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[15];
        __I uint32_t RCFGREQ;
        uint32_t RESERVED1[16];
    } stc_dma_reqstat_bit_t;

    typedef struct
    {
        __I uint32_t DMAACT;
        __I uint32_t RCFGACT;
        uint32_t RESERVED0[30];
    } stc_dma_chstat_bit_t;

    typedef struct
    {
        __IO uint32_t RCFGEN;
        __IO uint32_t RCFGLLP;
        uint32_t RESERVED0[30];
    } stc_dma_rcfgctl_bit_t;

    typedef struct
    {
        __O uint32_t SWREQ0;
        __O uint32_t SWREQ1;
        __O uint32_t SWREQ2;
        __O uint32_t SWREQ3;
        __O uint32_t SWREQ4;
        __O uint32_t SWREQ5;
        __O uint32_t SWREQ6;
        __O uint32_t SWREQ7;
        uint32_t RESERVED0[7];
        __O uint32_t SWRCFGREQ;
        uint32_t RESERVED1[16];
    } stc_dma_swreq_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __IO uint32_t SRPTEN;
        __IO uint32_t DRPTEN;
        __IO uint32_t SNSEQEN;
        __IO uint32_t DNSEQEN;
        uint32_t RESERVED1[2];
        __IO uint32_t LLPEN;
        __IO uint32_t LLPRUN;
        __IO uint32_t IE;
        uint32_t RESERVED2[19];
    } stc_dma_chctl_bit_t;

    typedef struct
    {
        __IO uint32_t START;
        uint32_t RESERVED0[7];
        __IO uint32_t MODE;
        uint32_t RESERVED1[2];
        __IO uint32_t PLL_EN;
        __IO uint32_t PI_EN;
        __IO uint32_t FLL_EN;
        __IO uint32_t JUDGE_EN;
        __IO uint32_t SOGI_SC;
        __IO uint32_t THETA_SEL;
        __IO uint32_t ADC_SEL;
        __IO uint32_t DIN_SEL;
        uint32_t RESERVED2[5];
        __IO uint32_t INTC1_EN;
        __IO uint32_t INTC2_EN;
        __IO uint32_t LVOL_EN;
        __IO uint32_t SRST;
        uint32_t RESERVED3[4];
    } stc_dsogi_pll_cr_bit_t;

    typedef struct
    {
        __IO uint32_t RES;
        __IO uint32_t PLL_FAIL;
        __IO uint32_t INTC1_FLAG;
        __IO uint32_t INTC2_FLAG;
        __IO uint32_t FP_FLAG;
        __IO uint32_t HRPWM_ENTA;
        __IO uint32_t HRPWM_ENTB;
        __IO uint32_t SC_FLAG;
        uint32_t RESERVED0[24];
    } stc_dsogi_pll_st_bit_t;

    typedef struct
    {
        __IO uint32_t F0STP;
        __IO uint32_t F1STP;
        uint32_t RESERVED0[30];
    } stc_efm_fstp_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[16];
        __IO uint32_t ICACHE;
        __IO uint32_t DCACHE;
        __IO uint32_t PREFETE;
        __IO uint32_t CRST;
        uint32_t RESERVED1[12];
    } stc_efm_frmc_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[8];
        __IO uint32_t BUSHLDCTL;
        __IO uint32_t BLKECCWSEL;
        __IO uint32_t BLKECCRSEL;
        uint32_t RESERVED1[5];
        __IO uint32_t KEY1LOCK;
        __IO uint32_t KEY2LOCK;
        uint32_t RESERVED2[14];
    } stc_efm_fwmc_bit_t;

    typedef struct
    {
        __I uint32_t OTPWERR0;
        __I uint32_t PRTWERR0;
        __I uint32_t PGSZERR0;
        __I uint32_t SPSEND0;
        __I uint32_t OPTEND0;
        __I uint32_t COLERR0;
        __I uint32_t ECEROF0;
        __I uint32_t BRMER0;
        __I uint32_t RDY0;
        __I uint32_t SWERR0;
        __I uint32_t ROWERR0;
        uint32_t RESERVED0[5];
        __I uint32_t OTPWERR1;
        __I uint32_t PRTWERR1;
        __I uint32_t PGSZERR1;
        __I uint32_t SPSEND1;
        __I uint32_t OPTEND1;
        __I uint32_t COLERR1;
        __I uint32_t ECEROF1;
        __I uint32_t BRMER1;
        __I uint32_t RDY1;
        __I uint32_t SWERR1;
        __I uint32_t ROWERR1;
        uint32_t RESERVED1[5];
    } stc_efm_fsr_bit_t;

    typedef struct
    {
        __IO uint32_t OTPWERRCLR0;
        __IO uint32_t PRTWERRCLR0;
        __IO uint32_t PGSZERRCLR0;
        uint32_t RESERVED0[1];
        __IO uint32_t OPTENDCLR0;
        __IO uint32_t COLERRCLR0;
        __IO uint32_t ECEROFCLR0;
        __IO uint32_t BRMERCLR0;
        uint32_t RESERVED1[1];
        __IO uint32_t SWERRCLR0;
        __IO uint32_t ROWERRCLR0;
        uint32_t RESERVED2[5];
        __IO uint32_t OTPWERRCLR1;
        __IO uint32_t PRTWERRCLR1;
        __IO uint32_t PGSZERRCLR1;
        uint32_t RESERVED3[1];
        __IO uint32_t OPTENDCLR1;
        __IO uint32_t COLERRCLR1;
        __IO uint32_t ECEROFCLR1;
        __IO uint32_t BRMERCLR1;
        uint32_t RESERVED4[1];
        __IO uint32_t SWERRCLR1;
        __IO uint32_t ROWERRCLR1;
        uint32_t RESERVED5[5];
    } stc_efm_fsclr_bit_t;

    typedef struct
    {
        __IO uint32_t PEERRITE;
        __IO uint32_t OPTENDITE;
        __IO uint32_t COLERRITE;
        uint32_t RESERVED0[29];
    } stc_efm_fite_bit_t;

    typedef struct
    {
        __I uint32_t FSWP;
        uint32_t RESERVED0[31];
    } stc_efm_fswp_bit_t;

    typedef struct
    {
        __IO uint32_t BRM0;
        uint32_t RESERVED0[15];
        __IO uint32_t BRM1;
        uint32_t RESERVED1[15];
    } stc_efm_frmc2_bit_t;

