MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    typedef struct
    {
        __IO uint32_t RLTSWPC;
        uint32_t RESERVED0[31];
    } stc_efm_frltswp_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[31];
        __IO uint32_t EN;
    } stc_efm_mmf_remcr_bit_t;

    typedef struct
    {
        __IO uint32_t WLOCK0;
        uint32_t RESERVED0[3];
        __IO uint32_t WLOCK4;
        uint32_t RESERVED1[27];
    } stc_efm_wlock_bit_t;

    typedef struct
    {
        __IO uint32_t F0NWPRT0;
        __IO uint32_t F0NWPRT1;
        __IO uint32_t F0NWPRT2;
        __IO uint32_t F0NWPRT3;
        __IO uint32_t F0NWPRT4;
        __IO uint32_t F0NWPRT5;
        __IO uint32_t F0NWPRT6;
        __IO uint32_t F0NWPRT7;
        __IO uint32_t F0NWPRT8;
        __IO uint32_t F0NWPRT9;
        __IO uint32_t F0NWPRT10;
        __IO uint32_t F0NWPRT11;
        __IO uint32_t F0NWPRT12;
        __IO uint32_t F0NWPRT13;
        __IO uint32_t F0NWPRT14;
        __IO uint32_t F0NWPRT15;
        __IO uint32_t F0NWPRT16;
        __IO uint32_t F0NWPRT17;
        __IO uint32_t F0NWPRT18;
        __IO uint32_t F0NWPRT19;
        __IO uint32_t F0NWPRT20;
        __IO uint32_t F0NWPRT21;
        __IO uint32_t F0NWPRT22;
        __IO uint32_t F0NWPRT23;
        __IO uint32_t F0NWPRT24;
        __IO uint32_t F0NWPRT25;
        __IO uint32_t F0NWPRT26;
        __IO uint32_t F0NWPRT27;
        __IO uint32_t F0NWPRT28;
        __IO uint32_t F0NWPRT29;
        __IO uint32_t F0NWPRT30;
        __IO uint32_t F0NWPRT31;
    } stc_efm_f0nwprt_bit_t;

    typedef struct
    {
        __IO uint32_t F1NWPRT0;
        __IO uint32_t F1NWPRT1;
        __IO uint32_t F1NWPRT2;
        __IO uint32_t F1NWPRT3;
        __IO uint32_t F1NWPRT4;
        __IO uint32_t F1NWPRT5;
        __IO uint32_t F1NWPRT6;
        __IO uint32_t F1NWPRT7;
        __IO uint32_t F1NWPRT8;
        __IO uint32_t F1NWPRT9;
        __IO uint32_t F1NWPRT10;
        __IO uint32_t F1NWPRT11;
        __IO uint32_t F1NWPRT12;
        __IO uint32_t F1NWPRT13;
        __IO uint32_t F1NWPRT14;
        __IO uint32_t F1NWPRT15;
        __IO uint32_t F1NWPRT16;
        __IO uint32_t F1NWPRT17;
        __IO uint32_t F1NWPRT18;
        __IO uint32_t F1NWPRT19;
        __IO uint32_t F1NWPRT20;
        __IO uint32_t F1NWPRT21;
        __IO uint32_t F1NWPRT22;
        __IO uint32_t F1NWPRT23;
        __IO uint32_t F1NWPRT24;
        __IO uint32_t F1NWPRT25;
        __IO uint32_t F1NWPRT26;
        __IO uint32_t F1NWPRT27;
        __IO uint32_t F1NWPRT28;
        __IO uint32_t F1NWPRT29;
        __IO uint32_t F1NWPRT30;
        __IO uint32_t F1NWPRT31;
    } stc_efm_f1nwprt_bit_t;

    typedef struct
    {
        __IO uint32_t F0ECCOAD;
        uint32_t RESERVED0[15];
        __IO uint32_t F1ECCOAD;
        uint32_t RESERVED1[15];
    } stc_efm_ckcr_bit_t;

    typedef struct
    {
        __IO uint32_t CKPRC;
        uint32_t RESERVED0[31];
    } stc_efm_ckpr_bit_t;

    typedef struct
    {
        __IO uint32_t F0_1ERR;
        __IO uint32_t F0_2ERR;
        uint32_t RESERVED0[14];
        __IO uint32_t F1_1ERR;
        __IO uint32_t F1_2ERR;
        uint32_t RESERVED1[14];
    } stc_efm_cksr_bit_t;

    typedef struct
    {
        __IO uint32_t F0_EIEN;
        uint32_t RESERVED0[15];
        __IO uint32_t F1_EIEN;
        uint32_t RESERVED1[15];
    } stc_efm_eien_bit_t;

    typedef struct
    {
        __IO uint32_t GDIS;
        __IO uint32_t VDIS;
        uint32_t RESERVED0[30];
    } stc_efm_fecccr_bit_t;

    typedef struct
    {
        __IO uint32_t VALID;
        __IO uint32_t FATAL;
        uint32_t RESERVED0[30];
    } stc_efm_ferr0_bit_t;

    typedef struct
    {
        __IO uint32_t VALID;
        __IO uint32_t FATAL;
        uint32_t RESERVED0[30];
    } stc_efm_ferr1_bit_t;

    typedef struct
    {
        __IO uint32_t CMPEN1;
        __IO uint32_t CMPEN2;
        __IO uint32_t CMPEN3;
        __IO uint32_t CMPEN4;
        __IO uint32_t SYSEN;
        __IO uint32_t PWMSEN0;
        __IO uint32_t PWMSEN1;
        __IO uint32_t PWMSEN2;
        __IO uint32_t PWMSEN3;
        __IO uint32_t PWMSEN4;
        __IO uint32_t PWMSEN5;
        uint32_t RESERVED0[4];
        __IO uint32_t FCMERREN;
        __IO uint32_t PORTINEN1;
        __IO uint32_t PORTINEN2;
        __IO uint32_t PORTINEN3;
        __IO uint32_t PORTINEN4;
        __IO uint32_t PORTINEN5;
        uint32_t RESERVED1[1];
        __IO uint32_t INVSEL1;
        __IO uint32_t INVSEL2;
        __IO uint32_t INVSEL3;
        __IO uint32_t INVSEL4;
        __IO uint32_t INVSEL5;
        __IO uint32_t OSCSTPEN;
        __IO uint32_t SRAMECCERREN;
        __IO uint32_t FLASHECCERREN;
        __IO uint32_t LOCKUPEN;
        __IO uint32_t PVDEN;
    } stc_emb_ctl1_bit_t;

    typedef struct
    {
        __IO uint32_t PWMLV0;
        __IO uint32_t PWMLV1;
        __IO uint32_t PWMLV2;
        __IO uint32_t PWMLV3;
        __IO uint32_t PWMLV4;
        __IO uint32_t PWMLV5;
        uint32_t RESERVED0[4];
        __IO uint32_t NFSEL1_2;
        __IO uint32_t NFSEL2_2;
        __IO uint32_t NFSEL3_2;
        __IO uint32_t NFSEL4_2;
        __IO uint32_t NFSEL5_2;
        __IO uint32_t NFMD;
        uint32_t RESERVED1[2];
        __IO uint32_t NFEN1;
        uint32_t RESERVED2[2];
        __IO uint32_t NFEN2;
        uint32_t RESERVED3[2];
        __IO uint32_t NFEN3;
        uint32_t RESERVED4[2];
        __IO uint32_t NFEN4;
        uint32_t RESERVED5[2];
        __IO uint32_t NFEN5;
        uint32_t RESERVED6[1];
    } stc_emb_ctl2_bit_t;

    typedef struct
    {
        __IO uint32_t SOE;
        uint32_t RESERVED0[31];
    } stc_emb_soe_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[1];
        __I uint32_t PWMSF;
        __I uint32_t CMPF;
        __I uint32_t SYSF;
        uint32_t RESERVED1[1];
        __I uint32_t PWMST;
        __I uint32_t CMPST;
        __I uint32_t SYSST;
        __I uint32_t PORTINF1;
        __I uint32_t PORTINF2;
        __I uint32_t PORTINF3;
        __I uint32_t PORTINF4;
        __I uint32_t PORTINF5;
        __I uint32_t FCMERRF;
        __I uint32_t PORTINST1;
        __I uint32_t PORTINST2;
        __I uint32_t PORTINST3;
        __I uint32_t PORTINST4;
        __I uint32_t PORTINST5;
        __I uint32_t OSCF;
        __I uint32_t SRAMECCERRF;
        __I uint32_t FLASHECCERRF;
        __I uint32_t LOCKUPF;
        __I uint32_t PVDF;
        __I uint32_t CMP1F;
        __I uint32_t CMP2F;
        __I uint32_t CMP3F;
        __I uint32_t CMP4F;
        __I uint32_t CMP5F;
        __I uint32_t CMP6F;
        __I uint32_t CMP7F;
        __I uint32_t CMP8F;
    } stc_emb_stat1_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[1];
        __O uint32_t PWMSFCLR;
        __O uint32_t CMPFCLR;
        __O uint32_t SYSFCLR;
        uint32_t RESERVED1[4];
        __O uint32_t PORTINFCLR1;
        __O uint32_t PORTINFCLR2;
        __O uint32_t PORTINFCLR3;
        __O uint32_t PORTINFCLR4;
        __O uint32_t PORTINFCLR5;
        __O uint32_t PORTINFCLR6;
        __O uint32_t PORTINFCLR7;
        __O uint32_t PORTINFCLR8;
        __O uint32_t PORTINFCLR9;
        uint32_t RESERVED2[1];
        __O uint32_t FCMERRFCLR;
        __O uint32_t OSCFCLR;
        __O uint32_t SRAMECCERRFCLR;
        __O uint32_t FLASHECCERRFCLR;
        __O uint32_t LOCKUPFCLR;
        __O uint32_t PVDFCLR;
        __O uint32_t CMP1FCLR;
        __O uint32_t CMP2FCLR;
        __O uint32_t CMP3FCLR;
        __O uint32_t CMP4FCLR;
        __O uint32_t CMP5FCLR;
        __O uint32_t CMP6FCLR;
        __O uint32_t CMP7FCLR;
        __O uint32_t CMP8FCLR;
    } stc_emb_statclr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[1];
        __IO uint32_t PWMSINTEN;
        __IO uint32_t CMPINTEN;
        __IO uint32_t SYSINTEN;
        uint32_t RESERVED1[4];
        __IO uint32_t PORTININTEN1;
        __IO uint32_t PORTININTEN2;
        __IO uint32_t PORTININTEN3;
        __IO uint32_t PORTININTEN4;
        __IO uint32_t PORTININTEN5;
        __IO uint32_t PORTININTEN6;
        __IO uint32_t PORTININTEN7;
        __IO uint32_t PORTININTEN8;
        __IO uint32_t PORTININTEN9;
        uint32_t RESERVED2[7];
        __IO uint32_t XBARINTEN;
        __IO uint32_t PLAINTEN;
        __IO uint32_t DSOGI_PLLINTEN;
        uint32_t RESERVED3[5];
    } stc_emb_inten_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[1];
        __IO uint32_t PWMRSEL;
        __IO uint32_t CMPRSEL;
        __IO uint32_t SYSRSEL;
        uint32_t RESERVED1[4];
        __IO uint32_t PORTINRSEL1;
        __IO uint32_t PORTINRSEL2;
        __IO uint32_t PORTINRSEL3;
        __IO uint32_t PORTINRSEL4;
        __IO uint32_t PORTINRSEL5;
        __IO uint32_t PORTINRSEL6;
        __IO uint32_t PORTINRSEL7;
        __IO uint32_t PORTINRSEL8;
        __IO uint32_t PORTINRSEL9;
        uint32_t RESERVED2[7];
        __IO uint32_t XBARRSEL;
        __IO uint32_t PLARSEL;
        __IO uint32_t DSOGI_PLLRSEL;
        uint32_t RESERVED3[5];
    } stc_emb_rlssel_bit_t;

    typedef struct
    {
        __IO uint32_t PORTINEN6;
        __IO uint32_t PORTINEN7;
        __IO uint32_t PORTINEN8;
        __IO uint32_t PORTINEN9;
        uint32_t RESERVED0[1];
        __IO uint32_t INVSEL6;
        __IO uint32_t INVSEL7;
        __IO uint32_t INVSEL8;
        __IO uint32_t INVSEL9;
        uint32_t RESERVED1[1];
        __IO uint32_t NFSEL6_2;
        __IO uint32_t NFSEL7_2;
        __IO uint32_t NFSEL8_2;
        __IO uint32_t NFSEL9_2;
        uint32_t RESERVED2[4];
        __IO uint32_t NFEN6;
        uint32_t RESERVED3[2];
        __IO uint32_t NFEN7;
        uint32_t RESERVED4[2];
        __IO uint32_t NFEN8;
        uint32_t RESERVED5[2];
        __IO uint32_t NFEN9;
        uint32_t RESERVED6[4];
    } stc_emb_ctl3_bit_t;

    typedef struct
    {
        __IO uint32_t CMPEN5;
        __IO uint32_t CMPEN6;
        __IO uint32_t CMPEN7;
        __IO uint32_t CMPEN8;
        uint32_t RESERVED0[3];
        __IO uint32_t DSOGI_PLLEN;
        __IO uint32_t XBAREN1;
        __IO uint32_t XBAREN2;
        __IO uint32_t XBAREN3;
        __IO uint32_t XBAREN4;
        __IO uint32_t XBAREN5;
        __IO uint32_t XBAREN6;
        uint32_t RESERVED1[6];
        __IO uint32_t XBARISEL1;
        __IO uint32_t XBARISEL2;
        __IO uint32_t XBARISEL3;
        __IO uint32_t XBARISEL4;
        __IO uint32_t XBARISEL5;
        __IO uint32_t XBARISEL6;
        uint32_t RESERVED2[6];
    } stc_emb_ctl4_bit_t;

    typedef struct
    {
        __I uint32_t PORTINF6;
        __I uint32_t PORTINF7;
        __I uint32_t PORTINF8;
        __I uint32_t PORTINF9;
        uint32_t RESERVED0[1];
        __I uint32_t PORTINST6;
        __I uint32_t PORTINST7;
        __I uint32_t PORTINST8;
        __I uint32_t PORTINST9;
        uint32_t RESERVED1[5];
        __I uint32_t DSOGI_PLLST;
        __IO uint32_t DSOGI_PLLF;
        __I uint32_t XBARST1;
        __I uint32_t XBARST2;
        __I uint32_t XBARST3;
        __I uint32_t XBARST4;
        __I uint32_t XBARST5;
        __I uint32_t XBARST6;
        uint32_t RESERVED2[2];
        __IO uint32_t XBARF1;
        __IO uint32_t XBARF2;
        __IO uint32_t XBARF3;
        __IO uint32_t XBARF4;
        __IO uint32_t XBARF5;
        __IO uint32_t XBARF6;
        uint32_t RESERVED3[2];
    } stc_emb_stat2_bit_t;

    typedef struct
    {
        __I uint32_t PLAST0;
        __I uint32_t PLAST1;
        __I uint32_t PLAST2;
        __I uint32_t PLAST3;
        __I uint32_t PLAST4;
        __I uint32_t PLAST5;
        __I uint32_t PLAST6;
        __I uint32_t PLAST7;
        __I uint32_t PLAST8;
        __I uint32_t PLAST9;
        __I uint32_t PLAST10;
        __I uint32_t PLAST11;
        __I uint32_t PLAST12;
        __I uint32_t PLAST13;
        __I uint32_t PLAST14;
        __I uint32_t PLAST15;
        __IO uint32_t PLAF0;
        __IO uint32_t PLAF1;
        __IO uint32_t PLAF2;
        __IO uint32_t PLAF3;
        __IO uint32_t PLAF4;
        __IO uint32_t PLAF5;
        __IO uint32_t PLAF6;
        __IO uint32_t PLAF7;
        __IO uint32_t PLAF8;
        __IO uint32_t PLAF9;
        __IO uint32_t PLAF10;
        __IO uint32_t PLAF11;
        __IO uint32_t PLAF12;
        __IO uint32_t PLAF13;
        __IO uint32_t PLAF14;
        __IO uint32_t PLAF15;
    } stc_emb_stat3_bit_t;

    typedef struct
    {
        __IO uint32_t PLAEN0;
        __IO uint32_t PLAEN1;
        __IO uint32_t PLAEN2;
        __IO uint32_t PLAEN3;
        __IO uint32_t PLAEN4;
        __IO uint32_t PLAEN5;
        __IO uint32_t PLAEN6;
        __IO uint32_t PLAEN7;
        __IO uint32_t PLAEN8;
        __IO uint32_t PLAEN9;
        __IO uint32_t PLAEN10;
        __IO uint32_t PLAEN11;
        __IO uint32_t PLAEN12;
        __IO uint32_t PLAEN13;
        __IO uint32_t PLAEN14;
        __IO uint32_t PLAEN15;
        uint32_t RESERVED0[16];
    } stc_emb_ctl5_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[3];
        __IO uint32_t XNFEN1;
        uint32_t RESERVED1[3];
        __IO uint32_t XNFEN2;
        uint32_t RESERVED2[3];
        __IO uint32_t XNFEN3;
        uint32_t RESERVED3[3];
        __IO uint32_t XNFEN4;
        uint32_t RESERVED4[3];
        __IO uint32_t XNFEN5;
        uint32_t RESERVED5[3];
        __IO uint32_t XNFEN6;
        uint32_t RESERVED6[8];
    } stc_emb_ctl6_bit_t;

    typedef struct
    {
        __O uint32_t SET;
        __O uint32_t CLR;
        uint32_t RESERVED0[14];
        __IO uint32_t CTE;
        uint32_t RESERVED1[15];
    } stc_ermu_eoc_bit_t;

    typedef struct
    {
        __I uint32_t EOS;
        uint32_t RESERVED0[15];
        __I uint32_t CTS;
        uint32_t RESERVED1[15];
    } stc_ermu_eos_bit_t;

    typedef struct
    {
        __IO uint32_t TTE;
        uint32_t RESERVED0[31];
    } stc_ermu_eottc_bit_t;

    typedef struct
    {
        __IO uint32_t WTE;
        uint32_t RESERVED0[15];
        __O uint32_t STP;
        uint32_t RESERVED1[15];
    } stc_ermu_wtc_bit_t;

    typedef struct
    {
        __I uint32_t WTS;
        uint32_t RESERVED0[31];
    } stc_ermu_wts_bit_t;

    typedef struct
    {
        __IO uint32_t LPISE;
        uint32_t RESERVED0[15];
        __IO uint32_t HPISE;
        uint32_t RESERVED1[15];
    } stc_ermu_wtse_bit_t;

    typedef struct
    {
        __IO uint32_t PSE;
        uint32_t RESERVED0[31];
    } stc_ermu_ccps_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[7];
        __IO uint32_t INEXS;
        uint32_t RESERVED1[7];
        __IO uint32_t EXREFE;
        uint32_t RESERVED2[16];
    } stc_fcm_rccr_bit_t;

    typedef struct
    {
        __IO uint32_t ERRIE;
        __IO uint32_t MENDIE;
        __IO uint32_t OVFIE;
        uint32_t RESERVED0[1];
        __IO uint32_t ERRINTRS;
        uint32_t RESERVED1[2];
        __IO uint32_t ERRRE;
        uint32_t RESERVED2[24];
    } stc_fcm_rier_bit_t;

    typedef struct
    {
        __O uint32_t ERRFCLR;
        __O uint32_t MENDFCLR;
        __O uint32_t OVFCLR;
        uint32_t RESERVED0[29];
    } stc_fcm_clr_bit_t;

    typedef struct
    {
        __IO uint32_t START1;
        __IO uint32_t START2;
        __IO uint32_t START3;
        __IO uint32_t START4;
        uint32_t RESERVED0[28];
    } stc_fcm_com_str_bit_t;

    typedef struct
    {
        __I uint32_t ERRF1;
        __I uint32_t MENDF1;
        __I uint32_t OVF1;
        __I uint32_t ERRF2;
        __I uint32_t MENDF2;
        __I uint32_t OVF2;
        __I uint32_t ERRF3;
        __I uint32_t MENDF3;
        __I uint32_t OVF3;
        __I uint32_t ERRF4;
        __I uint32_t MENDF4;
        __I uint32_t OVF4;
        uint32_t RESERVED0[20];
    } stc_fcm_com_sr_bit_t;

    typedef struct
    {
        __IO uint32_t START;
        __IO uint32_t SOFT_RST;
        __IO uint32_t DATA_CLR;
        uint32_t RESERVED0[5];
        __IO uint32_t ENABLE;
        __IO uint32_t CAL_MODE;
        __IO uint32_t DATA_TYPE;
        __IO uint32_t FUNC;
        __IO uint32_t TH_EN;
        __IO uint32_t UNRD_PRO;
        uint32_t RESERVED1[18];
    } stc_fmac_fir_cr_bit_t;

    typedef struct
    {
        __IO uint32_t FIR_DONE_EN;
        uint32_t RESERVED0[31];
    } stc_fmac_fir_int_cr_bit_t;

    typedef struct
    {
        __IO uint32_t FIR_DATA_RDY;
        __IO uint32_t FIR_START_ERR;
        uint32_t RESERVED0[6];
        __I uint32_t FIR_RUN;
        __I uint32_t FIR_CLR_STA;
        __I uint32_t FIR_RAM0_FULL;
        __I uint32_t FIR_RAM1_FULL;
        uint32_t RESERVED1[4];
        __IO uint32_t FIR_INF;
        __IO uint32_t FIR_NAN;
        __IO uint32_t FIR_OOR;
        uint32_t RESERVED2[13];
    } stc_fmac_fir_sta_bit_t;

    typedef struct
    {
        __IO uint32_t CH1_START;
        __IO uint32_t CH2_START;
        __IO uint32_t CH3_START;
        __IO uint32_t CH4_START;
        __IO uint32_t CH5_START;
        __IO uint32_t CH6_START;
        uint32_t RESERVED0[2];
        __IO uint32_t CH1_CAL_MODE;
        __IO uint32_t CH2_CAL_MODE;
        __IO uint32_t CH3_CAL_MODE;
        __IO uint32_t CH4_CAL_MODE;
        __IO uint32_t CH5_CAL_MODE;
        __IO uint32_t CH6_CAL_MODE;
        uint32_t RESERVED1[2];
        __IO uint32_t CH1_DATA_TYPE;
        __IO uint32_t CH2_DATA_TYPE;
        __IO uint32_t CH3_DATA_TYPE;
        __IO uint32_t CH4_DATA_TYPE;
        __IO uint32_t CH5_DATA_TYPE;
        __IO uint32_t CH6_DATA_TYPE;
        uint32_t RESERVED2[2];
        __IO uint32_t CH1_ENABLE;
        __IO uint32_t CH2_ENABLE;
        __IO uint32_t CH3_ENABLE;
        __IO uint32_t CH4_ENABLE;
        __IO uint32_t CH5_ENABLE;
        __IO uint32_t CH6_ENABLE;
        uint32_t RESERVED3[2];
    } stc_fmac_iir_cr1_bit_t;

    typedef struct
    {
        __IO uint32_t CH1_DCLR;
        __IO uint32_t CH2_DCLR;
        __IO uint32_t CH3_DCLR;
        __IO uint32_t CH4_DCLR;
        __IO uint32_t CH5_DCLR;
        __IO uint32_t CH6_DCLR;
        uint32_t RESERVED0[2];
        __IO uint32_t CH1_RST;
        __IO uint32_t CH2_RST;
        __IO uint32_t CH3_RST;
        __IO uint32_t CH4_RST;
        __IO uint32_t CH5_RST;
        __IO uint32_t CH6_RST;
        uint32_t RESERVED1[2];
        __IO uint32_t CH1_TH_EN;
        __IO uint32_t CH2_TH_EN;
        uint32_t RESERVED2[6];
        __IO uint32_t CH1_UNRD_PRO;
        __IO uint32_t CH2_UNRD_PRO;
        __IO uint32_t CH3_UNRD_PRO;
        __IO uint32_t CH4_UNRD_PRO;
        __IO uint32_t CH5_UNRD_PRO;
        __IO uint32_t CH6_UNRD_PRO;
        uint32_t RESERVED3[2];
    } stc_fmac_iir_cr2_bit_t;

    typedef struct
    {
        __IO uint32_t CH1_DONE_EN;
        __IO uint32_t CH2_DONE_EN;
        __IO uint32_t CH3_DONE_EN;
        __IO uint32_t CH4_DONE_EN;
        __IO uint32_t CH5_DONE_EN;
        __IO uint32_t CH6_DONE_EN;
        uint32_t RESERVED0[26];
    } stc_fmac_iir_int_cr_bit_t;

    typedef struct
    {
        __IO uint32_t CH1_START_ERR;
        __IO uint32_t CH2_START_ERR;
        __IO uint32_t CH3_START_ERR;
        __IO uint32_t CH4_START_ERR;
        __IO uint32_t CH5_START_ERR;
        __IO uint32_t CH6_START_ERR;
        uint32_t RESERVED0[2];
        __IO uint32_t CH1_DATA_RDY;
        __IO uint32_t CH2_DATA_RDY;
        __IO uint32_t CH3_DATA_RDY;
        __IO uint32_t CH4_DATA_RDY;
        __IO uint32_t CH5_DATA_RDY;
        __IO uint32_t CH6_DATA_RDY;
        uint32_t RESERVED1[18];
    } stc_fmac_iir_sta1_bit_t;

    typedef struct
    {
        __IO uint32_t CH1_INF;
        __IO uint32_t CH2_INF;
        __IO uint32_t CH3_INF;
        __IO uint32_t CH4_INF;
        __IO uint32_t CH5_INF;
        __IO uint32_t CH6_INF;
        uint32_t RESERVED0[2];
        __IO uint32_t CH1_NAN;
        __IO uint32_t CH2_NAN;
        __IO uint32_t CH3_NAN;
        __IO uint32_t CH4_NAN;
        __IO uint32_t CH5_NAN;
        __IO uint32_t CH6_NAN;
        uint32_t RESERVED1[2];
        __IO uint32_t CH1_OOR;
        __IO uint32_t CH2_OOR;
        __IO uint32_t CH3_OOR;
        __IO uint32_t CH4_OOR;
        __IO uint32_t CH5_OOR;
        __IO uint32_t CH6_OOR;
        uint32_t RESERVED2[10];
    } stc_fmac_iir_sta2_bit_t;

    typedef struct
    {
        __IO uint32_t CH1_XFULL;
        __IO uint32_t CH2_XFULL;
        __IO uint32_t CH3_XFULL;
        __IO uint32_t CH4_XFULL;
        __IO uint32_t CH5_XFULL;
        __IO uint32_t CH6_XFULL;
        uint32_t RESERVED0[2];
        __IO uint32_t CH1_YFULL;
        __IO uint32_t CH2_YFULL;
        __IO uint32_t CH3_YFULL;
        __IO uint32_t CH4_YFULL;
        __IO uint32_t CH5_YFULL;
        __IO uint32_t CH6_YFULL;
        uint32_t RESERVED1[2];
        __IO uint32_t CH1_CFULL;
        __IO uint32_t CH2_CFULL;
        __IO uint32_t CH3_CFULL;
        __IO uint32_t CH4_CFULL;
        __IO uint32_t CH5_CFULL;
        __IO uint32_t CH6_CFULL;
        uint32_t RESERVED2[10];
    } stc_fmac_iir_buf_sta_bit_t;

    typedef struct
    {
        __IO uint32_t RAM_1ERR;
        __IO uint32_t RAM_2ERR;
        uint32_t RESERVED0[30];
    } stc_fmac_ecc_ram0_cksr_bit_t;

    typedef struct
    {
        __IO uint32_t EIEN;
        uint32_t RESERVED0[31];
    } stc_fmac_ecc_ram0_eien_bit_t;

    typedef struct
    {
        __IO uint32_t RAM_1ERR;
        __IO uint32_t RAM_2ERR;
        uint32_t RESERVED0[30];
    } stc_fmac_ecc_ram1_cksr_bit_t;

    typedef struct
    {
        __IO uint32_t EIEN;
        uint32_t RESERVED0[31];
    } stc_fmac_ecc_ram1_eien_bit_t;

    typedef struct
    {
        __I uint32_t PIN00;
        __I uint32_t PIN01;
        __I uint32_t PIN02;
        __I uint32_t PIN03;
        __I uint32_t PIN04;
        __I uint32_t PIN05;
        __I uint32_t PIN06;
        __I uint32_t PIN07;
        __I uint32_t PIN08;
        __I uint32_t PIN09;
        __I uint32_t PIN10;
        __I uint32_t PIN11;
        __I uint32_t PIN12;
        __I uint32_t PIN13;
        __I uint32_t PIN14;
        __I uint32_t PIN15;
    } stc_gpio_pidr_bit_t;

    typedef struct
    {
        __IO uint32_t POUT00;
        __IO uint32_t POUT01;
        __IO uint32_t POUT02;
        __IO uint32_t POUT03;
        __IO uint32_t POUT04;
        __IO uint32_t POUT05;
        __IO uint32_t POUT06;
        __IO uint32_t POUT07;
        __IO uint32_t POUT08;
        __IO uint32_t POUT09;
        __IO uint32_t POUT10;
        __IO uint32_t POUT11;
        __IO uint32_t POUT12;
        __IO uint32_t POUT13;
        __IO uint32_t POUT14;
        __IO uint32_t POUT15;
    } stc_gpio_podr_bit_t;

    typedef struct
    {
        __IO uint32_t POUTE00;
        __IO uint32_t POUTE01;
        __IO uint32_t POUTE02;
        __IO uint32_t POUTE03;
        __IO uint32_t POUTE04;
        __IO uint32_t POUTE05;
        __IO uint32_t POUTE06;
        __IO uint32_t POUTE07;
        __IO uint32_t POUTE08;
        __IO uint32_t POUTE09;
        __IO uint32_t POUTE10;
        __IO uint32_t POUTE11;
        __IO uint32_t POUTE12;
        __IO uint32_t POUTE13;
        __IO uint32_t POUTE14;
        __IO uint32_t POUTE15;
    } stc_gpio_poer_bit_t;

    typedef struct
    {
        __O uint32_t POS00;
        __O uint32_t POS01;
        __O uint32_t POS02;
        __O uint32_t POS03;
        __O uint32_t POS04;
        __O uint32_t POS05;
        __O uint32_t POS06;
        __O uint32_t POS07;
        __O uint32_t POS08;
        __O uint32_t POS09;
        __O uint32_t POS10;
        __O uint32_t POS11;
        __O uint32_t POS12;
        __O uint32_t POS13;
        __O uint32_t POS14;
        __O uint32_t POS15;
    } stc_gpio_posr_bit_t;

    typedef struct
    {
        __O uint32_t POR00;
        __O uint32_t POR01;
        __O uint32_t POR02;
        __O uint32_t POR03;
        __O uint32_t POR04;
        __O uint32_t POR05;
        __O uint32_t POR06;
        __O uint32_t POR07;
        __O uint32_t POR08;
        __O uint32_t POR09;
        __O uint32_t POR10;
        __O uint32_t POR11;
        __O uint32_t POR12;
        __O uint32_t POR13;
        __O uint32_t POR14;
        __O uint32_t POR15;
    } stc_gpio_porr_bit_t;

