MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    typedef struct
    {
        __O uint32_t POT00;
        __O uint32_t POT01;
        __O uint32_t POT02;
        __O uint32_t POT03;
        __O uint32_t POT04;
        __O uint32_t POT05;
        __O uint32_t POT06;
        __O uint32_t POT07;
        __O uint32_t POT08;
        __O uint32_t POT09;
        __O uint32_t POT10;
        __O uint32_t POT11;
        __O uint32_t POT12;
        __O uint32_t POT13;
        __O uint32_t POT14;
        __O uint32_t POT15;
    } stc_gpio_potr_bit_t;

    typedef struct
    {
        __IO uint32_t WE;
        uint32_t RESERVED0[15];
    } stc_gpio_pwpr_bit_t;

    typedef struct
    {
        __IO uint32_t POUT;
        __IO uint32_t POUTE;
        __IO uint32_t NOD;
        uint32_t RESERVED0[3];
        __IO uint32_t PUU;
        __IO uint32_t PUD;
        __I uint32_t PIN;
        __IO uint32_t INVE;
        __IO uint32_t CINSEL;
        uint32_t RESERVED1[1];
        __IO uint32_t INTE;
        uint32_t RESERVED2[1];
        __IO uint32_t LTE;
        __IO uint32_t DDIS;
    } stc_gpio_pcr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[8];
        __IO uint32_t BFE;
        uint32_t RESERVED1[7];
    } stc_gpio_pfsr_bit_t;

    typedef struct
    {
        __IO uint32_t START;
        __IO uint32_t FST_GRP;
        __IO uint32_t KMSG_END;
        uint32_t RESERVED0[3];
        __IO uint32_t LKEY;
        uint32_t RESERVED1[1];
        __IO uint32_t BUSY;
        __IO uint32_t CYC_END;
        __IO uint32_t HMAC_END;
        uint32_t RESERVED2[3];
        __IO uint32_t HCIE;
        __IO uint32_t HEIE;
        uint32_t RESERVED3[16];
    } stc_hash_cr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[17];
        __I uint32_t CAPDIRA;
        uint32_t RESERVED1[14];
    } stc_hrpwm_capar_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[17];
        __I uint32_t CAPDIRB;
        uint32_t RESERVED1[14];
    } stc_hrpwm_capbr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[17];
        __IO uint32_t OFFSETDIR;
        uint32_t RESERVED1[14];
    } stc_hrpwm_eefoffsetar_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[17];
        __IO uint32_t OFFSETDIR;
        uint32_t RESERVED1[14];
    } stc_hrpwm_eefoffsetbr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[17];
        __IO uint32_t WINDIR;
        uint32_t RESERVED1[14];
    } stc_hrpwm_eefwinar_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[17];
        __IO uint32_t WINDIR;
        uint32_t RESERVED1[14];
    } stc_hrpwm_eefwinbr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[8];
        __IO uint32_t SPPERIA;
        __IO uint32_t SPPERIB;
        __IO uint32_t OVFPERI;
        __IO uint32_t UDFPERI;
        uint32_t RESERVED1[20];
    } stc_hrpwm_vperr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[28];
        __IO uint32_t OUTENA;
        uint32_t RESERVED1[3];
    } stc_hrpwm_pcnar1_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[28];
        __IO uint32_t OUTENA;
        uint32_t RESERVED1[3];
    } stc_hrpwm_bpcnar1_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[28];
        __IO uint32_t OUTENB;
        uint32_t RESERVED1[3];
    } stc_hrpwm_pcnbr1_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[28];
        __IO uint32_t OUTENB;
        uint32_t RESERVED1[3];
    } stc_hrpwm_bpcnbr1_bit_t;

    typedef struct
    {
        __IO uint32_t AOSENDLYPRT;
        __IO uint32_t AOSENVPE;
        __IO uint32_t AOSENCAPB;
        __IO uint32_t AOSENCAPA;
        __IO uint32_t AOSENUDF;
        __IO uint32_t AOSENOVF;
        __IO uint32_t AOSENF;
        __IO uint32_t AOSENE;
        __IO uint32_t AOSEND;
        __IO uint32_t AOSENC;
        __IO uint32_t AOSENB;
        __IO uint32_t AOSENA;
        __IO uint32_t AOSENSCMB;
        __IO uint32_t AOSENSCMA;
        uint32_t RESERVED0[18];
    } stc_hrpwm_aoseoutselr_bit_t;

    typedef struct
    {
        __IO uint32_t AOSENDLYPRT;
        __IO uint32_t AOSENVPE;
        __IO uint32_t AOSENCAPB;
        __IO uint32_t AOSENCAPA;
        __IO uint32_t AOSENUDF;
        __IO uint32_t AOSENOVF;
        __IO uint32_t AOSENF;
        __IO uint32_t AOSENE;
        __IO uint32_t AOSEND;
        __IO uint32_t AOSENC;
        __IO uint32_t AOSENB;
        __IO uint32_t AOSENA;
        __IO uint32_t AOSENSCMB;
        __IO uint32_t AOSENSCMA;
        uint32_t RESERVED0[18];
    } stc_hrpwm_baoseoutselr_bit_t;

    typedef struct
    {
        __IO uint32_t INTENA;
        __IO uint32_t INTENB;
        __IO uint32_t INTENC;
        __IO uint32_t INTEND;
        __IO uint32_t INTENE;
        __IO uint32_t INTENF;
        __IO uint32_t INTENOVF;
        __IO uint32_t INTENUDF;
        uint32_t RESERVED0[6];
        __IO uint32_t INTENCAPA;
        __IO uint32_t INTENCAPB;
        __IO uint32_t INTENSAU;
        __IO uint32_t INTENSAD;
        __IO uint32_t INTENSBU;
        __IO uint32_t INTENSBD;
        uint32_t RESERVED1[4];
        __IO uint32_t INTENVPE;
        uint32_t RESERVED2[7];
    } stc_hrpwm_iconr_bit_t;

    typedef struct
    {
        __IO uint32_t INTENA;
        __IO uint32_t INTENB;
        __IO uint32_t INTENC;
        __IO uint32_t INTEND;
        __IO uint32_t INTENE;
        __IO uint32_t INTENF;
        __IO uint32_t INTENOVF;
        __IO uint32_t NTENUDF;
        uint32_t RESERVED0[6];
        __IO uint32_t INTENCAPA;
        __IO uint32_t INTENCAPB;
        __IO uint32_t INTENSAU;
        __IO uint32_t INTENSAD;
        __IO uint32_t INTENSBU;
        __IO uint32_t INTENSBD;
        uint32_t RESERVED1[4];
        __IO uint32_t INTENVPE;
        uint32_t RESERVED2[7];
    } stc_hrpwm_biconr_bit_t;

    typedef struct
    {
        __IO uint32_t DTCEN;
        __IO uint32_t SEPA;
        uint32_t RESERVED0[2];
        __IO uint32_t DTBENU;
        __IO uint32_t DTBEND;
        __IO uint32_t DTBTRU;
        __IO uint32_t DTBTRD;
        __IO uint32_t SDTR;
        __IO uint32_t SDTF;
        __IO uint32_t DTBENSD;
        uint32_t RESERVED1[1];
        __IO uint32_t DTFLK;
        __IO uint32_t DTRLK;
        __IO uint32_t DTFSLK;
        __IO uint32_t DTRSLK;
        uint32_t RESERVED2[16];
    } stc_hrpwm_dconr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[8];
        __IO uint32_t SDTR;
        __IO uint32_t SDTF;
        uint32_t RESERVED1[22];
    } stc_hrpwm_bdconr_bit_t;

    typedef struct
    {
        __IO uint32_t INVCAEN;
        __IO uint32_t INVCBEN;
        __IO uint32_t SWAPEN;
        __IO uint32_t SWAPMD;
        __IO uint32_t HALF;
        __IO uint32_t PRDLK;
        __IO uint32_t EEFM;
        uint32_t RESERVED0[9];
        __IO uint32_t CMSCAUEN;
        __IO uint32_t CMSCADEN;
        __IO uint32_t CMSCBUEN;
        __IO uint32_t CMSCBDEN;
        uint32_t RESERVED1[12];
    } stc_hrpwm_gconr1_bit_t;

    typedef struct
    {
        __IO uint32_t INVCAEN;
        __IO uint32_t INVCBEN;
        __IO uint32_t SWAPEN;
        __IO uint32_t SWAPMD;
        __IO uint32_t HALF;
        __IO uint32_t PRDLK;
        __IO uint32_t EEFM;
        uint32_t RESERVED0[9];
        __IO uint32_t CMSCAUEN;
        __IO uint32_t CMSCADEN;
        __IO uint32_t CMSCBUEN;
        __IO uint32_t CMSCBDEN;
        __IO uint32_t BFSEL0;
        __IO uint32_t BFSEL1;
        __IO uint32_t BFSEL2;
        __IO uint32_t BFSEL3;
        __IO uint32_t BFSEL4;
        uint32_t RESERVED1[7];
    } stc_hrpwm_bgconr1_bit_t;

    typedef struct
    {
        __IO uint32_t START;
        uint32_t RESERVED0[1];
        __IO uint32_t MODE;
        __IO uint32_t RETRIG;
        uint32_t RESERVED1[4];
        __IO uint32_t OVSTP;
        uint32_t RESERVED2[4];
        __IO uint32_t TRGCALASEN;
        __IO uint32_t TRGCALMDEN;
        __IO uint32_t TRGCALASMD;
        uint32_t RESERVED3[16];
    } stc_hrpwm_gconr_bit_t;

    typedef struct
    {
        __IO uint32_t BENAE;
        uint32_t RESERVED0[1];
        __IO uint32_t BTRUAE;
        __IO uint32_t BTRDAE;
        __IO uint32_t BENBF;
        uint32_t RESERVED1[1];
        __IO uint32_t BTRUBF;
        __IO uint32_t BTRDBF;
        __IO uint32_t BENP;
        uint32_t RESERVED2[1];
        __IO uint32_t BTRUP;
        __IO uint32_t BTRDP;
        __IO uint32_t BENVPE;
        uint32_t RESERVED3[1];
        __IO uint32_t BTRUVPE;
        __IO uint32_t BTRDVPE;
        __IO uint32_t BENSPA;
        uint32_t RESERVED4[1];
        __IO uint32_t BTRUSPA;
        __IO uint32_t BTRDSPA;
        __IO uint32_t BENSPB;
        uint32_t RESERVED5[1];
        __IO uint32_t BTRUSPB;
        __IO uint32_t BTRDSPB;
        uint32_t RESERVED6[3];
        __IO uint32_t BENPCN;
        __IO uint32_t BTRUPCN;
        __IO uint32_t BTRDPCN;
        __IO uint32_t BTRU0VPE;
        __IO uint32_t BTRU0PVPE;
    } stc_hrpwm_bconr1_bit_t;

    typedef struct
    {
        __IO uint32_t BENEEFOFF;
        __IO uint32_t BTRUEEFOFF;
        __IO uint32_t BTRDEEFOFF;
        __IO uint32_t BENEEFWIN;
        __IO uint32_t BTRUEEFWIN;
        __IO uint32_t BTRDEEFWIN;
        __IO uint32_t BTRU0EEFOFF;
        __IO uint32_t BTRU0EEFWIN;
        __IO uint32_t BTRU0PEEFOFF;
        __IO uint32_t BTRU0PEEFWIN;
        uint32_t RESERVED0[2];
        __IO uint32_t BENCTL;
        __IO uint32_t BTRUCTL;
        __IO uint32_t BTRDCTL;
        uint32_t RESERVED1[1];
        __IO uint32_t BTRU0AE;
        __IO uint32_t BTRU0BF;
        __IO uint32_t BTRU0P;
        __IO uint32_t BTRU0SPA;
        __IO uint32_t BTRU0SPB;
        __IO uint32_t BTRU0DT;
        __IO uint32_t BTRU0CTL;
        __IO uint32_t BTRU0PAE;
        __IO uint32_t BTRU0PBF;
        __IO uint32_t BTRU0PP;
        __IO uint32_t BTRU0PSPA;
        __IO uint32_t BTRU0PSPB;
        __IO uint32_t BTRU0PDT;
        __IO uint32_t BTRU0PCTL;
        __IO uint32_t BTRU0PCN;
        __IO uint32_t BTRU0PPCN;
    } stc_hrpwm_bconr2_bit_t;

    typedef struct
    {
        __IO uint32_t U1U;
        __IO uint32_t U2U;
        __IO uint32_t U3U;
        __IO uint32_t U4U;
        __IO uint32_t U5U;
        __IO uint32_t U6U;
        __IO uint32_t U7U;
        __IO uint32_t U8U;
        uint32_t RESERVED0[8];
        __IO uint32_t VPEU;
        __IO uint32_t UDFU;
        __IO uint32_t OVFU;
        uint32_t RESERVED1[2];
        __IO uint32_t STPU;
        __IO uint32_t GBEN;
        __IO uint32_t SBTRUSFTMD;
        __IO uint32_t GBENHDCLREN;
        uint32_t RESERVED2[7];
    } stc_hrpwm_gbcr_bit_t;

    typedef struct
    {
        __IO uint32_t GCMAER;
        __IO uint32_t GCMBFR;
        __IO uint32_t PERAR;
        __IO uint32_t SCMAR;
        __IO uint32_t SCMBR;
        __IO uint32_t EEFOFFSETAR;
        __IO uint32_t EEFWINAR;
        __IO uint32_t DTAR;
        __IO uint32_t CTLR;
        __IO uint32_t PHSCMPAR;
        __IO uint32_t VPER;
        uint32_t RESERVED0[1];
        __IO uint32_t PCN;
        uint32_t RESERVED1[19];
    } stc_hrpwm_gbcfg_bit_t;

    typedef struct
    {
        __IO uint32_t IDLEBMA;
        __IO uint32_t IDLESA;
        __IO uint32_t DIDLA;
        __IO uint32_t DLYCHA;
        __IO uint32_t CHPA;
        uint32_t RESERVED0[3];
        __IO uint32_t DLYPRTEN;
        uint32_t RESERVED1[3];
        __IO uint32_t DLYSTRG;
        uint32_t RESERVED2[3];
        __IO uint32_t IDLEBMB;
        __IO uint32_t IDLESB;
        __IO uint32_t DIDLB;
        __IO uint32_t DLYCHB;
        __IO uint32_t CHPB;
        __IO uint32_t BIDLE;
        __IO uint32_t BIAR;
        uint32_t RESERVED3[1];
        __IO uint32_t INTENDLYPRT;
        __IO uint32_t FOLLOW;
        uint32_t RESERVED4[6];
    } stc_hrpwm_idlecr_bit_t;

    typedef struct
    {
        __IO uint32_t CMAF;
        __IO uint32_t CMBF;
        __IO uint32_t CMCF;
        __IO uint32_t CMDF;
        __IO uint32_t CMEF;
        __IO uint32_t CMFF;
        __IO uint32_t OVFF;
        __IO uint32_t UDFF;
        uint32_t RESERVED0[1];
        __IO uint32_t CMSAUF;
        __IO uint32_t CMSADF;
        __IO uint32_t CMSBUF;
        __IO uint32_t CMSBDF;
        uint32_t RESERVED1[3];
        __IO uint32_t VPEF;
        uint32_t RESERVED2[9];
        __IO uint32_t CAPAF;
        __IO uint32_t CAPBF;
        uint32_t RESERVED3[3];
        __I uint32_t DIRF;
    } stc_hrpwm_stflr1_bit_t;

    typedef struct
    {
        __IO uint32_t DLYIDLEA;
        __IO uint32_t DLYIDLEB;
        __IO uint32_t DLYPRT;
        __IO uint32_t CPPSTAT;
        __IO uint32_t OASTAT;
        __IO uint32_t OBSTAT;
        __IO uint32_t IPPSTAT;
        uint32_t RESERVED0[1];
        __IO uint32_t PHSCMP6F;
        __IO uint32_t PHSCMP7F;
        uint32_t RESERVED1[1];
        __IO uint32_t PHSCMP1F;
        __IO uint32_t PHSCMP2F;
        __IO uint32_t PHSCMP3F;
        __IO uint32_t PHSCMP4F;
        __IO uint32_t PHSCMP5F;
        __IO uint32_t OSTOVF;
        uint32_t RESERVED2[15];
    } stc_hrpwm_stflr2_bit_t;

    typedef struct
    {
        __IO uint32_t HSTAGCMA7;
        __IO uint32_t HSTAGCMB7;
        __IO uint32_t HSTAGCMA8;
        __IO uint32_t HSTAGCMB8;
        uint32_t RESERVED0[3];
        __IO uint32_t STAS;
        __IO uint32_t HSTA8;
        __IO uint32_t HSTA9;
        __IO uint32_t HSTA10;
        __IO uint32_t HSTA11;
        __IO uint32_t HSTASCMB7;
        __IO uint32_t HSTASCMB8;
        uint32_t RESERVED1[2];
        __IO uint32_t HSTA16;
        __IO uint32_t HSTA17;
        __IO uint32_t HSTA18;
        __IO uint32_t HSTA19;
        __IO uint32_t HSTA20;
        __IO uint32_t HSTA21;
        __IO uint32_t HSTA22;
        __IO uint32_t HSTA23;
        __IO uint32_t HSTAGCMF2;
        __IO uint32_t HSTAGCMF3;
        __IO uint32_t HSTAGCMF4;
        __IO uint32_t HSTAGCMF5;
        __IO uint32_t HSTAGCMF6;
        __IO uint32_t HSTAGCMF7;
        __IO uint32_t HSTAGCMF8;
        uint32_t RESERVED2[1];
    } stc_hrpwm_hstar1_bit_t;

    typedef struct
    {
        __IO uint32_t HSTAEXEV1;
        __IO uint32_t HSTAEXEV2;
        __IO uint32_t HSTAEXEV3;
        __IO uint32_t HSTAEXEV4;
        __IO uint32_t HSTAEXEV5;
        __IO uint32_t HSTAEXEV6;
        __IO uint32_t HSTAEXEV7;
        __IO uint32_t HSTAEXEV8;
        __IO uint32_t HSTAEXEV9;
        __IO uint32_t HSTAEXEV10;
        __IO uint32_t HSTAGCMA1;
        __IO uint32_t HSTAGCMB1;
        __IO uint32_t HSTAGCMA2;
        __IO uint32_t HSTAGCMB2;
        __IO uint32_t HSTAGCMA3;
        __IO uint32_t HSTAGCMB3;
        __IO uint32_t HSTAGCMA4;
        __IO uint32_t HSTAGCMB4;
        __IO uint32_t HSTAGCMA5;
        __IO uint32_t HSTAGCMB5;
        __IO uint32_t HSTAGCMA6;
        __IO uint32_t HSTAGCMB6;
        __IO uint32_t HSTASCMA1;
        __IO uint32_t HSTASCMB2;
        __IO uint32_t HSTASCMB3;
        __IO uint32_t HSTASCMB4;
        __IO uint32_t HSTASCMB5;
        __IO uint32_t HSTASCMB6;
        __IO uint32_t HSTAGCME1;
        __IO uint32_t HSTAGCMF1;
        __IO uint32_t HSTAOVF1;
        __IO uint32_t HSTAUDF1;
    } stc_hrpwm_hstar2_bit_t;

    typedef struct
    {
        __IO uint32_t HCLEGCMA7;
        __IO uint32_t HCLEGCMB7;
        __IO uint32_t HCLEGCMA8;
        __IO uint32_t HCLEGCMB8;
        __IO uint32_t HCLEGCMA9;
        __IO uint32_t HCLEGCMB9;
        uint32_t RESERVED0[1];
        __IO uint32_t CLES;
        __IO uint32_t HCLE8;
        __IO uint32_t HCLE9;
        __IO uint32_t HCLE10;
        __IO uint32_t HCLE11;
        __IO uint32_t HCLESCMB7;
        __IO uint32_t HCLESCMB8;
        uint32_t RESERVED1[2];
        __IO uint32_t HCLE16;
        __IO uint32_t HCLE17;
        __IO uint32_t HCLE18;
        __IO uint32_t HCLE19;
        __IO uint32_t HCLE20;
        __IO uint32_t HCLE21;
        __IO uint32_t HCLE22;
        __IO uint32_t HCLE23;
        __IO uint32_t HCLEGCMF2;
        __IO uint32_t HCLEGCMF3;
        __IO uint32_t HCLEGCMF4;
        __IO uint32_t HCLEGCMF5;
        __IO uint32_t HCLEGCMF6;
        __IO uint32_t HCLEGCMF7;
        __IO uint32_t HCLEGCMF8;
        uint32_t RESERVED2[1];
    } stc_hrpwm_hclrr1_bit_t;

    typedef struct
    {
        __IO uint32_t HCLEEXEV1;
        __IO uint32_t HCLEEXEV2;
        __IO uint32_t HCLEEXEV3;
        __IO uint32_t HCLEEXEV4;
        __IO uint32_t HCLEEXEV5;
        __IO uint32_t HCLEEXEV6;
        __IO uint32_t HCLEEXEV7;
        __IO uint32_t HCLEEXEV8;
        __IO uint32_t HCLEEXEV9;
        __IO uint32_t HCLEEXEV10;
        __IO uint32_t HCLEGCMA1;
        __IO uint32_t HCLEGCMB1;
        __IO uint32_t HCLEGCMA2;
        __IO uint32_t HCLEGCMB2;
        __IO uint32_t HCLEGCMA3;
        __IO uint32_t HCLEGCMB3;
        __IO uint32_t HCLEGCMA4;
        __IO uint32_t HCLEGCMB4;
        __IO uint32_t HCLEGCMA5;
        __IO uint32_t HCLEGCMB5;
        __IO uint32_t HCLEGCMA6;
        __IO uint32_t HCLEGCMB6;
        __IO uint32_t HCLESCMB1;
        __IO uint32_t HCLESCMB2;
        __IO uint32_t HCLESCMB3;
        __IO uint32_t HCLESCMB4;
        __IO uint32_t HCLESCMB5;
        __IO uint32_t HCLESCMB6;
        __IO uint32_t HCLEGCME1;
        __IO uint32_t HCLEGCMF1;
        __IO uint32_t HCLEOVF1;
        __IO uint32_t HCLEUDF1;
    } stc_hrpwm_hclrr2_bit_t;

    typedef struct
    {
        __IO uint32_t HCPAGCMA6;
        __IO uint32_t HCPAGCMB6;
        __IO uint32_t HCPAR6;
        __IO uint32_t HCPAF6;
        __IO uint32_t HCPAGCMA7;
        __IO uint32_t HCPAGCMB7;
        __IO uint32_t HCPAR7;
        __IO uint32_t HCPAF7;
        __IO uint32_t HCPA8;
        __IO uint32_t HCPA9;
        __IO uint32_t HCPA10;
        __IO uint32_t HCPA11;
        uint32_t RESERVED0[4];
        __IO uint32_t HCPA16;
        __IO uint32_t HCPA17;
        __IO uint32_t HCPA18;
        __IO uint32_t HCPA19;
        __IO uint32_t HCPA20;
        __IO uint32_t HCPA21;
        __IO uint32_t HCPA22;
        __IO uint32_t HCPA23;
        __IO uint32_t HCPAGCMA8;
        __IO uint32_t HCPAGCMB8;
        __IO uint32_t HCPAR8;
        __IO uint32_t HCPAF8;
        uint32_t RESERVED1[4];
    } stc_hrpwm_hcpar1_bit_t;

    typedef struct
    {
        __IO uint32_t HCPAEEV1;
        __IO uint32_t HCPAEEV2;
        __IO uint32_t HCPAEEV3;
        __IO uint32_t HCPAEEV4;
        __IO uint32_t HCPAEEV5;
        __IO uint32_t HCPAEEV6;
        __IO uint32_t HCPAEEV7;
        __IO uint32_t HCPAEEV8;
        __IO uint32_t HCPAEEV9;
        __IO uint32_t HCPAEEV10;
        __IO uint32_t HCPAEN;
        uint32_t RESERVED0[1];
        __IO uint32_t HCPAGCMA1;
        __IO uint32_t HCPAGCMB1;
        __IO uint32_t HCPAR1;
        __IO uint32_t HCPAF1;
        __IO uint32_t HCPAGCMA2;
        __IO uint32_t HCPAGCMB2;
        __IO uint32_t HCPAR2;
        __IO uint32_t HCPAF2;
        __IO uint32_t HCPAGCMA3;
        __IO uint32_t HCPAGCMB3;
        __IO uint32_t HCPAR3;
        __IO uint32_t HCPAF3;
        __IO uint32_t HCPAGCMA4;
        __IO uint32_t HCPAGCMB4;
        __IO uint32_t HCPAR4;
        __IO uint32_t HCPAF4;
        __IO uint32_t HCPAGCMA5;
        __IO uint32_t HCPAGCMB5;
        __IO uint32_t HCPAR5;
        __IO uint32_t HCPAF5;
    } stc_hrpwm_hcpar2_bit_t;

    typedef struct
    {
        __IO uint32_t HCPBGCMA6;
        __IO uint32_t HCPBGCMB6;
        __IO uint32_t HCPBR6;
        __IO uint32_t HCPBF6;
        __IO uint32_t HCPBGCMA7;
        __IO uint32_t HCPBGCMB7;
        __IO uint32_t HCPBR7;
        __IO uint32_t HCPBF7;
        __IO uint32_t HCPB8;
        __IO uint32_t HCPB9;
        __IO uint32_t HCPB10;
        __IO uint32_t HCPB11;
        uint32_t RESERVED0[4];
        __IO uint32_t HCPB16;
        __IO uint32_t HCPB17;
        __IO uint32_t HCPB18;
        __IO uint32_t HCPB19;
        __IO uint32_t HCPB20;
        __IO uint32_t HCPB21;
        __IO uint32_t HCPB22;
        __IO uint32_t HCPB23;
        __IO uint32_t HCPBGCMA8;
        __IO uint32_t HCPBGCMB8;
        __IO uint32_t HCPBR8;
        __IO uint32_t HCPBF8;
        uint32_t RESERVED1[4];
    } stc_hrpwm_hcpbr1_bit_t;

    typedef struct
    {
        __IO uint32_t HCPBEEV1;
        __IO uint32_t HCPBEEV2;
        __IO uint32_t HCPBEEV3;
        __IO uint32_t HCPBEEV4;
        __IO uint32_t HCPBEEV5;
        __IO uint32_t HCPBEEV6;
        __IO uint32_t HCPBEEV7;
        __IO uint32_t HCPBEEV8;
        __IO uint32_t HCPBEEV9;
        __IO uint32_t HCPBEEV10;
        __IO uint32_t HCPBEN;
        uint32_t RESERVED0[1];
        __IO uint32_t HCPBGCMA1;
        __IO uint32_t HCPBGCMB1;
        __IO uint32_t HCPBR1;
        __IO uint32_t HCPBF1;
        __IO uint32_t HCPBGCMA2;
        __IO uint32_t HCPBGCMB2;
        __IO uint32_t HCPBR2;
        __IO uint32_t HCPBF2;
        __IO uint32_t HCPBGCMA3;
        __IO uint32_t HCPBGCMB3;
        __IO uint32_t HCPBR3;
        __IO uint32_t HCPBF3;
        __IO uint32_t HCPBGCMA4;
        __IO uint32_t HCPBGCMB4;
        __IO uint32_t HCPBR4;
        __IO uint32_t HCPBF4;
        __IO uint32_t HCPBGCMA5;
        __IO uint32_t HCPBGCMB5;
        __IO uint32_t HCPBR5;
        __IO uint32_t HCPBF5;
    } stc_hrpwm_hcpbr2_bit_t;

    typedef struct
    {
        __IO uint32_t EE1LAT;
        uint32_t RESERVED0[4];
        __IO uint32_t EE1TMO;
        __IO uint32_t EE2LAT;
        uint32_t RESERVED1[4];
        __IO uint32_t EE2TMO;
        __IO uint32_t EE3LAT;
        uint32_t RESERVED2[4];
        __IO uint32_t EE3TMO;
        __IO uint32_t EE4LAT;
        uint32_t RESERVED3[4];
        __IO uint32_t EE4TMO;
        __IO uint32_t EE5LAT;
        uint32_t RESERVED4[4];
        __IO uint32_t EE5TMO;
        __IO uint32_t EEINTPOL;
        uint32_t RESERVED5[1];
    } stc_hrpwm_eefltcr1_bit_t;

    typedef struct
    {
        __IO uint32_t EE6LAT;
        uint32_t RESERVED0[4];
        __IO uint32_t EE6TMO;
        __IO uint32_t EE7LAT;
        uint32_t RESERVED1[4];
        __IO uint32_t EE7TMO;
        __IO uint32_t EE8LAT;
        uint32_t RESERVED2[4];
        __IO uint32_t EE8TMO;
        __IO uint32_t EE9LAT;
        uint32_t RESERVED3[4];
        __IO uint32_t EE9TMO;
        __IO uint32_t EE10LAT;
        uint32_t RESERVED4[4];
        __IO uint32_t EE10TMO;
        uint32_t RESERVED5[2];
    } stc_hrpwm_eefltcr2_bit_t;

    typedef struct
    {
        __IO uint32_t EEVACE;
        __O uint32_t EEVACRES;
        __IO uint32_t EEVARSTM;
        uint32_t RESERVED0[29];
    } stc_hrpwm_eefltcr3_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[3];
        __IO uint32_t EN;
        uint32_t RESERVED1[12];
        __IO uint32_t RAMPEN;
        uint32_t RESERVED2[2];
        __IO uint32_t RAMPSS;
        uint32_t RESERVED3[2];
        __IO uint32_t PSHPLL;
        __IO uint32_t TRGHLF;
        __IO uint32_t GTGCMF;
        __IO uint32_t GTGCMB;
        uint32_t RESERVED4[6];
    } stc_hrpwm_cr_bit_t;

    typedef struct
    {
        __IO uint32_t PHSEN;
        uint32_t RESERVED0[5];
        __IO uint32_t PHSFORCA;
        __IO uint32_t PHSFORCB;
        __IO uint32_t BENPHS;
        __IO uint32_t BTRUPHS;
        __IO uint32_t BTRDPHS;
        uint32_t RESERVED1[21];
    } stc_hrpwm_phsctl_bit_t;

    typedef struct
    {
        __IO uint32_t EEV1;
        __IO uint32_t EEV2;
        __IO uint32_t EEV3;
        __IO uint32_t EEV4;
        __IO uint32_t EEV5;
        __IO uint32_t EEV6;
        __IO uint32_t EEV7;
        __IO uint32_t EEV8;
        __IO uint32_t EEV9;
        __IO uint32_t EEV10;
        uint32_t RESERVED0[22];
    } stc_hrpwm_udircfg_bit_t;

    typedef struct
    {
        __IO uint32_t EEV1;
        __IO uint32_t EEV2;
        __IO uint32_t EEV3;
        __IO uint32_t EEV4;
        __IO uint32_t EEV5;
        __IO uint32_t EEV6;
        __IO uint32_t EEV7;
        __IO uint32_t EEV8;
        __IO uint32_t EEV9;
        __IO uint32_t EEV10;
        uint32_t RESERVED0[22];
    } stc_hrpwm_ddircfg_bit_t;

