MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    typedef struct
    {
        __IO uint32_t EMBEVT0;
        __IO uint32_t EMBEVT1;
        __IO uint32_t EMBEVT2;
        __IO uint32_t EMBEVT3;
        __IO uint32_t EMBEVT4;
        __IO uint32_t EMBEVT5;
        __IO uint32_t EMBEVT6;
        __IO uint32_t EMBEVT7;
        uint32_t RESERVED0[1];
        __IO uint32_t EEV1;
        __IO uint32_t EEV2;
        __IO uint32_t EEV3;
        __IO uint32_t EEV4;
        __IO uint32_t EEV5;
        uint32_t RESERVED1[18];
    } stc_hrpwm_tripoutsel_bit_t;

    typedef struct
    {
        __IO uint32_t ENABLE;
        __IO uint32_t MODE;
        uint32_t RESERVED0[30];
    } stc_hrpwm_dectl_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[2];
        __IO uint32_t TRIPSELA;
        uint32_t RESERVED1[3];
        __IO uint32_t TRIPSELB;
        uint32_t RESERVED2[9];
        __IO uint32_t TRIPENABLE;
        uint32_t RESERVED3[15];
    } stc_hrpwm_deactctl_bit_t;

    typedef struct
    {
        __IO uint32_t DEACTIVE;
        uint32_t RESERVED0[31];
    } stc_hrpwm_destat_bit_t;

    typedef struct
    {
        __IO uint32_t DEACTIVE;
        uint32_t RESERVED0[31];
    } stc_hrpwm_defrc_bit_t;

    typedef struct
    {
        __IO uint32_t DEACTIVE;
        uint32_t RESERVED0[31];
    } stc_hrpwm_declr_bit_t;

    typedef struct
    {
        __IO uint32_t ENABLE;
        uint32_t RESERVED0[31];
    } stc_hrpwm_demonctl_bit_t;

    typedef struct
    {
        __IO uint32_t ENABLEA;
        uint32_t RESERVED0[1];
        __IO uint32_t INVERTA;
        __IO uint32_t SELBLOCKA;
        uint32_t RESERVED1[8];
        __IO uint32_t POLSELA;
        uint32_t RESERVED2[3];
        __IO uint32_t ENABLEB;
        uint32_t RESERVED3[1];
        __IO uint32_t INVERTB;
        __IO uint32_t SELBLOCKB;
        uint32_t RESERVED4[8];
        __IO uint32_t POLSELB;
        uint32_t RESERVED5[3];
    } stc_hrpwm_mindbcfg_bit_t;

    typedef struct
    {
        __IO uint32_t BYPASS;
        uint32_t RESERVED0[31];
    } stc_hrpwm_lutctla_bit_t;

    typedef struct
    {
        __IO uint32_t BYPASS;
        uint32_t RESERVED0[31];
    } stc_hrpwm_lutctlb_bit_t;

    typedef struct
    {
        __IO uint32_t CAL;
        __IO uint32_t CALEN;
        uint32_t RESERVED0[6];
        __IO uint32_t CALENF;
        __IO uint32_t ERRF;
        __IO uint32_t CALIE;
        uint32_t RESERVED1[21];
    } stc_hrpwm_common_calcr_bit_t;

    typedef struct
    {
        __IO uint32_t CMSA4;
        __IO uint32_t CMSB4;
        __IO uint32_t OVF4;
        __IO uint32_t UDF4;
        __IO uint32_t CMSA5;
        __IO uint32_t CMSB5;
        __IO uint32_t OVF5;
        __IO uint32_t UDF5;
        __IO uint32_t CMSA6;
        __IO uint32_t CMSB6;
        __IO uint32_t OVF6;
        __IO uint32_t UDF6;
        __IO uint32_t CMSA7;
        __IO uint32_t CMSB7;
        __IO uint32_t OVF7;
        __IO uint32_t UDF7;
        __IO uint32_t CMSA8;
        __IO uint32_t CMSB8;
        __IO uint32_t OVF8;
        __IO uint32_t UDF8;
        uint32_t RESERVED0[4];
        __IO uint32_t EEV3;
        __IO uint32_t EEV4;
        __IO uint32_t EEV5;
        __IO uint32_t EEV6;
        __IO uint32_t EEV7;
        __IO uint32_t EEV8;
        __IO uint32_t EEV9;
        __IO uint32_t EEV10;
    } stc_hrpwm_common_glaosselr6_bit_t;

    typedef struct
    {
        __IO uint32_t CMSA4;
        __IO uint32_t CMSB4;
        __IO uint32_t OVF4;
        __IO uint32_t UDF4;
        __IO uint32_t CMSA5;
        __IO uint32_t CMSB5;
        __IO uint32_t OVF5;
        __IO uint32_t UDF5;
        __IO uint32_t CMSA6;
        __IO uint32_t CMSB6;
        __IO uint32_t OVF6;
        __IO uint32_t UDF6;
        __IO uint32_t CMSA7;
        __IO uint32_t CMSB7;
        __IO uint32_t OVF7;
        __IO uint32_t UDF7;
        __IO uint32_t CMSA8;
        __IO uint32_t CMSB8;
        __IO uint32_t OVF8;
        __IO uint32_t UDF8;
        uint32_t RESERVED0[4];
        __IO uint32_t EEV3;
        __IO uint32_t EEV4;
        __IO uint32_t EEV5;
        __IO uint32_t EEV6;
        __IO uint32_t EEV7;
        __IO uint32_t EEV8;
        __IO uint32_t EEV9;
        __IO uint32_t EEV10;
    } stc_hrpwm_common_glaosselr5_bit_t;

    typedef struct
    {
        __IO uint32_t CMSA4;
        __IO uint32_t CMSB4;
        __IO uint32_t OVF4;
        __IO uint32_t UDF4;
        __IO uint32_t CMSA5;
        __IO uint32_t CMSB5;
        __IO uint32_t OVF5;
        __IO uint32_t UDF5;
        __IO uint32_t CMSA6;
        __IO uint32_t CMSB6;
        __IO uint32_t OVF6;
        __IO uint32_t UDF6;
        __IO uint32_t CMSA7;
        __IO uint32_t CMSB7;
        __IO uint32_t OVF7;
        __IO uint32_t UDF7;
        __IO uint32_t CMSA8;
        __IO uint32_t CMSB8;
        __IO uint32_t OVF8;
        __IO uint32_t UDF8;
        uint32_t RESERVED0[4];
        __IO uint32_t EEV3;
        __IO uint32_t EEV4;
        __IO uint32_t EEV5;
        __IO uint32_t EEV6;
        __IO uint32_t EEV7;
        __IO uint32_t EEV8;
        __IO uint32_t EEV9;
        __IO uint32_t EEV10;
    } stc_hrpwm_common_glaosselr4_bit_t;

    typedef struct
    {
        __IO uint32_t CMSA1;
        __IO uint32_t CMSB1;
        __IO uint32_t OVF1;
        __IO uint32_t UDF1;
        __IO uint32_t CMSA2;
        __IO uint32_t CMSB2;
        __IO uint32_t OVF2;
        __IO uint32_t UDF2;
        __IO uint32_t CMSA3;
        __IO uint32_t CMSB3;
        __IO uint32_t OVF3;
        __IO uint32_t UDF3;
        __IO uint32_t CMSA4;
        __IO uint32_t CMSB4;
        __IO uint32_t OVF4;
        __IO uint32_t UDF4;
        __IO uint32_t CMSA5;
        __IO uint32_t CMSB5;
        __IO uint32_t OVF5;
        __IO uint32_t UDF5;
        __IO uint32_t CMSA6;
        __IO uint32_t CMSB6;
        __IO uint32_t OVF6;
        __IO uint32_t UDF6;
        __IO uint32_t EEV1;
        __IO uint32_t EEV2;
        __IO uint32_t EEV3;
        __IO uint32_t EEV4;
        __IO uint32_t EEV5;
        __IO uint32_t EEV6;
        __IO uint32_t EEV7;
        __IO uint32_t EEV8;
    } stc_hrpwm_common_glaosselr3_bit_t;

    typedef struct
    {
        __IO uint32_t CMSA1;
        __IO uint32_t CMSB1;
        __IO uint32_t OVF1;
        __IO uint32_t UDF1;
        __IO uint32_t CMSA2;
        __IO uint32_t CMSB2;
        __IO uint32_t OVF2;
        __IO uint32_t UDF2;
        __IO uint32_t CMSA3;
        __IO uint32_t CMSB3;
        __IO uint32_t OVF3;
        __IO uint32_t UDF3;
        __IO uint32_t CMSA4;
        __IO uint32_t CMSB4;
        __IO uint32_t OVF4;
        __IO uint32_t UDF4;
        __IO uint32_t CMSA5;
        __IO uint32_t CMSB5;
        __IO uint32_t OVF5;
        __IO uint32_t UDF5;
        __IO uint32_t CMSA6;
        __IO uint32_t CMSB6;
        __IO uint32_t OVF6;
        __IO uint32_t UDF6;
        __IO uint32_t EEV1;
        __IO uint32_t EEV2;
        __IO uint32_t EEV3;
        __IO uint32_t EEV4;
        __IO uint32_t EEV5;
        __IO uint32_t EEV6;
        __IO uint32_t EEV7;
        __IO uint32_t EEV8;
    } stc_hrpwm_common_glaosselr2_bit_t;

    typedef struct
    {
        __IO uint32_t CMSA1;
        __IO uint32_t CMSB1;
        __IO uint32_t OVF1;
        __IO uint32_t UDF1;
        __IO uint32_t CMSA2;
        __IO uint32_t CMSB2;
        __IO uint32_t OVF2;
        __IO uint32_t UDF2;
        __IO uint32_t CMSA3;
        __IO uint32_t CMSB3;
        __IO uint32_t OVF3;
        __IO uint32_t UDF3;
        __IO uint32_t CMSA4;
        __IO uint32_t CMSB4;
        __IO uint32_t OVF4;
        __IO uint32_t UDF4;
        __IO uint32_t CMSA5;
        __IO uint32_t CMSB5;
        __IO uint32_t OVF5;
        __IO uint32_t UDF5;
        __IO uint32_t CMSA6;
        __IO uint32_t CMSB6;
        __IO uint32_t OVF6;
        __IO uint32_t UDF6;
        __IO uint32_t EEV1;
        __IO uint32_t EEV2;
        __IO uint32_t EEV3;
        __IO uint32_t EEV4;
        __IO uint32_t EEV5;
        __IO uint32_t EEV6;
        __IO uint32_t EEV7;
        __IO uint32_t EEV8;
    } stc_hrpwm_common_glaosselr1_bit_t;

    typedef struct
    {
        __O uint32_t SFTSRA1;
        __O uint32_t SFTSRA2;
        __O uint32_t SFTSRA3;
        __O uint32_t SFTSRA4;
        __O uint32_t SFTSRA5;
        __O uint32_t SFTSRA6;
        __O uint32_t SFTSRA7;
        __O uint32_t SFTSRA8;
        uint32_t RESERVED0[8];
        __O uint32_t SFTSRB1;
        __O uint32_t SFTSRB2;
        __O uint32_t SFTSRB3;
        __O uint32_t SFTSRB4;
        __O uint32_t SFTSRB5;
        __O uint32_t SFTSRB6;
        __O uint32_t SFTSRB7;
        __O uint32_t SFTSRB8;
        uint32_t RESERVED1[8];
    } stc_hrpwm_common_sftsrr_bit_t;

    typedef struct
    {
        __O uint32_t SCAP1A;
        __O uint32_t SCAP1B;
        __O uint32_t SCAP2A;
        __O uint32_t SCAP2B;
        __O uint32_t SCAP3A;
        __O uint32_t SCAP3B;
        __O uint32_t SCAP4A;
        __O uint32_t SCAP4B;
        __O uint32_t SCAP5A;
        __O uint32_t SCAP5B;
        __O uint32_t SCAP6A;
        __O uint32_t SCAP6B;
        __O uint32_t SCAP7A;
        __O uint32_t SCAP7B;
        __O uint32_t SCAP8A;
        __O uint32_t SCAP8B;
        uint32_t RESERVED0[16];
    } stc_hrpwm_common_scapr_bit_t;

    typedef struct
    {
        __O uint32_t SSTAIDL1A;
        __O uint32_t SSTAIDL1B;
        __O uint32_t SSTAIDL2A;
        __O uint32_t SSTAIDL2B;
        __O uint32_t SSTAIDL3A;
        __O uint32_t SSTAIDL3B;
        __O uint32_t SSTAIDL4A;
        __O uint32_t SSTAIDL4B;
        __O uint32_t SSTAIDL5A;
        __O uint32_t SSTAIDL5B;
        __O uint32_t SSTAIDL6A;
        __O uint32_t SSTAIDL6B;
        __O uint32_t SSTAIDL7A;
        __O uint32_t SSTAIDL7B;
        __O uint32_t SSTAIDL8A;
        __O uint32_t SSTAIDL8B;
        uint32_t RESERVED0[16];
    } stc_hrpwm_common_sstaidlr_bit_t;

    typedef struct
    {
        __IO uint32_t SSTARUN1A;
        __IO uint32_t SSTARUN1B;
        __IO uint32_t SSTARUN2A;
        __IO uint32_t SSTARUN2B;
        __IO uint32_t SSTARUN3A;
        __IO uint32_t SSTARUN3B;
        __IO uint32_t SSTARUN4A;
        __IO uint32_t SSTARUN4B;
        __IO uint32_t SSTARUN5A;
        __IO uint32_t SSTARUN5B;
        __IO uint32_t SSTARUN6A;
        __IO uint32_t SSTARUN6B;
        __IO uint32_t SSTARUN7A;
        __IO uint32_t SSTARUN7B;
        __IO uint32_t SSTARUN8A;
        __IO uint32_t SSTARUN8B;
        uint32_t RESERVED0[16];
    } stc_hrpwm_common_sstarunr1_bit_t;

    typedef struct
    {
        __O uint32_t SSTARUN1A2;
        __O uint32_t SSTARUN1B2;
        __O uint32_t SSTARUN2A2;
        __O uint32_t SSTARUN2B2;
        __O uint32_t SSTARUN3A2;
        __O uint32_t SSTARUN3B2;
        __O uint32_t SSTARUN4A2;
        __O uint32_t SSTARUN4B2;
        __O uint32_t SSTARUN5A2;
        __O uint32_t SSTARUN5B2;
        __O uint32_t SSTARUN6A2;
        __O uint32_t SSTARUN6B2;
        __O uint32_t SSTARUN7A2;
        __O uint32_t SSTARUN7B2;
        __O uint32_t SSTARUN8A2;
        __O uint32_t SSTARUN8B2;
        uint32_t RESERVED0[16];
    } stc_hrpwm_common_sstarunr2_bit_t;

    typedef struct
    {
        __IO uint32_t DLYSTRGU1;
        __IO uint32_t DLYSTRGU2;
        __IO uint32_t DLYSTRGU3;
        __IO uint32_t DLYSTRGU4;
        __IO uint32_t DLYSTRGU5;
        __IO uint32_t DLYSTRGU6;
        __IO uint32_t DLYSTRGU7;
        __IO uint32_t DLYSTRGU8;
        uint32_t RESERVED0[24];
    } stc_hrpwm_common_sstadidlr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __IO uint32_t BKDLY1;
        __IO uint32_t BKDLY2;
        __IO uint32_t BKDLY3;
        __IO uint32_t BKDLY4;
        __IO uint32_t BKDLY5;
        __IO uint32_t BKDLY6;
        __IO uint32_t BKDLY7;
        __IO uint32_t BKDLY8;
        uint32_t RESERVED1[20];
    } stc_hrpwm_common_gctlr_bit_t;

    typedef struct
    {
        __IO uint32_t BTRU1EN;
        __IO uint32_t BTRU2EN;
        __IO uint32_t BTRU3EN;
        __IO uint32_t BTRU4EN;
        __IO uint32_t BTRU5EN;
        __IO uint32_t BTRU6EN;
        __IO uint32_t BTRU7EN;
        __IO uint32_t BTRU8EN;
        uint32_t RESERVED0[8];
        __O uint32_t BTRU1SFT;
        __O uint32_t BTRU2SFT;
        __O uint32_t BTRU3SFT;
        __O uint32_t BTRU4SFT;
        __O uint32_t BTRU5SFT;
        __O uint32_t BTRU6SFT;
        __O uint32_t BTRU7SFT;
        __O uint32_t BTRU8SFT;
        uint32_t RESERVED1[6];
        __IO uint32_t OSTBTRU1;
        __IO uint32_t OSTENU1;
    } stc_hrpwm_common_gbconr_bit_t;

    typedef struct
    {
        __IO uint32_t U1BTRENF;
        __IO uint32_t U2BTRENF;
        __IO uint32_t U3BTRENF;
        __IO uint32_t U4BTRENF;
        __IO uint32_t U5BTRENF;
        __IO uint32_t U6BTRENF;
        __IO uint32_t U7BTRENF;
        __IO uint32_t U8BTRENF;
        uint32_t RESERVED0[24];
    } stc_hrpwm_common_gbsflr_bit_t;

    typedef struct
    {
        __IO uint32_t BMEN;
        __IO uint32_t BMCTN;
        uint32_t RESERVED0[8];
        __IO uint32_t BMTMR1;
        __IO uint32_t BMTMR2;
        __IO uint32_t BMTMR3;
        __IO uint32_t BMTMR4;
        __IO uint32_t BMTMR5;
        __IO uint32_t BMTMR6;
        __IO uint32_t BMOPTF;
        __IO uint32_t BMOVFF;
        __IO uint32_t INTENBMOVF;
        __IO uint32_t BENBMCMP;
        __IO uint32_t BENBMP;
        __IO uint32_t BMMD;
        uint32_t RESERVED1[2];
        __IO uint32_t BMTMR7;
        __IO uint32_t BMTMR8;
        uint32_t RESERVED2[5];
        __IO uint32_t BMCMPHDCTLEN;
    } stc_hrpwm_common_bmcr_bit_t;

    typedef struct
    {
        __IO uint32_t SSTRG;
        __IO uint32_t OVF1;
        __IO uint32_t UDF1;
        __IO uint32_t GCMA1;
        __IO uint32_t GCMB1;
        __IO uint32_t OVF2;
        __IO uint32_t UDF2;
        __IO uint32_t GCMA2;
        __IO uint32_t GCMB2;
        __IO uint32_t OVF3;
        __IO uint32_t UDF3;
        __IO uint32_t GCMA3;
        __IO uint32_t GCMB3;
        __IO uint32_t OVF4;
        __IO uint32_t UDF4;
        __IO uint32_t GCMA4;
        __IO uint32_t GCMB4;
        __IO uint32_t OVF5;
        __IO uint32_t UDF5;
        __IO uint32_t GCMA5;
        __IO uint32_t GCMB5;
        __IO uint32_t OVF6;
        __IO uint32_t UDF6;
        __IO uint32_t GCMA6;
        __IO uint32_t GCMB6;
        __IO uint32_t T1OVFEEV7;
        __IO uint32_t T1UDFEEV7;
        __IO uint32_t T4OVFEEV8;
        __IO uint32_t T4UDFEEV8;
        __IO uint32_t EEV7;
        __IO uint32_t EEV8;
        uint32_t RESERVED0[1];
    } stc_hrpwm_common_bmstrg1_bit_t;

    typedef struct
    {
        __IO uint32_t IEV0;
        __IO uint32_t IEV1;
        __IO uint32_t IEV2;
        __IO uint32_t IEV3;
        uint32_t RESERVED0[12];
        __IO uint32_t OVF7;
        __IO uint32_t UDF7;
        __IO uint32_t GCMA7;
        __IO uint32_t GCMB7;
        __IO uint32_t OVF8;
        __IO uint32_t UDF8;
        __IO uint32_t GCMA8;
        __IO uint32_t GCMB8;
        uint32_t RESERVED1[8];
    } stc_hrpwm_common_bmstrg2_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[2];
        __IO uint32_t EE1POL;
        uint32_t RESERVED1[2];
        __IO uint32_t EE1FAST;
        uint32_t RESERVED2[2];
        __IO uint32_t EE2POL;
        uint32_t RESERVED3[2];
        __IO uint32_t EE2FAST;
        uint32_t RESERVED4[2];
        __IO uint32_t EE3POL;
        uint32_t RESERVED5[2];
        __IO uint32_t EE3FAST;
        uint32_t RESERVED6[2];
        __IO uint32_t EE4POL;
        uint32_t RESERVED7[2];
        __IO uint32_t EE4FAST;
        uint32_t RESERVED8[2];
        __IO uint32_t EE5POL;
        uint32_t RESERVED9[2];
        __IO uint32_t EE5FAST;
        uint32_t RESERVED10[2];
    } stc_hrpwm_common_eecr1_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[2];
        __IO uint32_t EE6POL;
        uint32_t RESERVED1[5];
        __IO uint32_t EE7POL;
        uint32_t RESERVED2[5];
        __IO uint32_t EE8POL;
        uint32_t RESERVED3[5];
        __IO uint32_t EE9POL;
        uint32_t RESERVED4[5];
        __IO uint32_t EE10POL;
        uint32_t RESERVED5[5];
    } stc_hrpwm_common_eecr2_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[6];
        __IO uint32_t SRCDIR;
        uint32_t RESERVED1[25];
    } stc_hrpwm_common_synocr_bit_t;

    typedef struct
    {
        __IO uint32_t NOFIENTA;
        uint32_t RESERVED0[3];
        __IO uint32_t NOFIENTB;
        uint32_t RESERVED1[3];
        __IO uint32_t NOFIENTC;
        uint32_t RESERVED2[3];
        __IO uint32_t NOFIENTD;
        uint32_t RESERVED3[19];
    } stc_hrpwm_common_fcntr_bit_t;

    typedef struct
    {
        __IO uint32_t SSTA1;
        __IO uint32_t SSTA2;
        __IO uint32_t SSTA3;
        __IO uint32_t SSTA4;
        __IO uint32_t SSTA5;
        __IO uint32_t SSTA6;
        __IO uint32_t SSTA7;
        __IO uint32_t SSTA8;
        uint32_t RESERVED0[24];
    } stc_hrpwm_common_sstar_bit_t;

    typedef struct
    {
        __O uint32_t SSTP1;
        __O uint32_t SSTP2;
        __O uint32_t SSTP3;
        __O uint32_t SSTP4;
        __O uint32_t SSTP5;
        __O uint32_t SSTP6;
        __O uint32_t SSTP7;
        __O uint32_t SSTP8;
        uint32_t RESERVED0[24];
    } stc_hrpwm_common_sstpr_bit_t;

    typedef struct
    {
        __O uint32_t SCLE1;
        __O uint32_t SCLE2;
        __O uint32_t SCLE3;
        __O uint32_t SCLE4;
        __O uint32_t SCLE5;
        __O uint32_t SCLE6;
        __O uint32_t SCLE7;
        __O uint32_t SCLE8;
        uint32_t RESERVED0[24];
    } stc_hrpwm_common_sclrr_bit_t;

    typedef struct
    {
        __O uint32_t SUPD1;
        __O uint32_t SUPD2;
        __O uint32_t SUPD3;
        __O uint32_t SUPD4;
        __O uint32_t SUPD5;
        __O uint32_t SUPD6;
        __O uint32_t SUPD7;
        __O uint32_t SUPD8;
        uint32_t RESERVED0[24];
    } stc_hrpwm_common_supdr_bit_t;

    typedef struct
    {
        __IO uint32_t CNTER;
        __IO uint32_t UPDAR;
        uint32_t RESERVED0[2];
        __IO uint32_t HRPERAR;
        __IO uint32_t HRGCMAR;
        __IO uint32_t HRGCMBR;
        __IO uint32_t HRGCMER;
        __IO uint32_t HRGCMFR;
        __IO uint32_t SCMAR;
        __IO uint32_t SCMBR;
        __IO uint32_t HRDTDAR;
        __IO uint32_t HRDTUAR;
        __IO uint32_t EEOFSETAR;
        __IO uint32_t EEWINAR;
        __IO uint32_t VPERR;
        __IO uint32_t PCNAR1;
        __IO uint32_t PCNAR2;
        __IO uint32_t PCNAR3;
        __IO uint32_t PCNAR4;
        __IO uint32_t PCNAR5;
        __IO uint32_t PCNBR1;
        __IO uint32_t PCNBR2;
        __IO uint32_t PCNBR3;
        __IO uint32_t PCNBR4;
        __IO uint32_t PCNBR5;
        __IO uint32_t ICONR;
        __IO uint32_t AOSEOUTSELR;
        __IO uint32_t DCONR;
        __IO uint32_t GCONR1;
        __IO uint32_t GCONR;
        __IO uint32_t BCONR1;
    } stc_hrpwm_common_bdupr1_bit_t;

    typedef struct
    {
        __IO uint32_t BCONR2;
        __IO uint32_t GBCR;
        __IO uint32_t GBCFG;
        __IO uint32_t IDLECR;
        __IO uint32_t CHPCR;
        __IO uint32_t HASTR1;
        __IO uint32_t HASTR2;
        __IO uint32_t HCLR1;
        __IO uint32_t HCLR2;
        __IO uint32_t EEFLTR1;
        __IO uint32_t EEFLTR2;
        __IO uint32_t EEFLTR3;
        __IO uint32_t LINCR1;
        __IO uint32_t CR;
        __IO uint32_t PHSCTL;
        __IO uint32_t LINCR2;
        __IO uint32_t PHSCMP1A;
        __IO uint32_t PHSCMP2A;
        __IO uint32_t PHSCMP3A;
        __IO uint32_t PHSCMP4A;
        __IO uint32_t PHSCMP5A;
        __IO uint32_t PHSCMP6A;
        __IO uint32_t PHSCMP7A;
        uint32_t RESERVED0[9];
    } stc_hrpwm_common_bdupr2_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[1];
        __IO uint32_t SYSEN;
        uint32_t RESERVED1[3];
        __IO uint32_t PWMSEN0;
        __IO uint32_t PWMSEN1;
        __IO uint32_t PWMSEN2;
        __IO uint32_t PWMSEN3;
        __IO uint32_t PWMSEN4;
        __IO uint32_t PWMSEN5;
        __IO uint32_t PWMSEN6;
        __IO uint32_t PWMSEN7;
        uint32_t RESERVED2[3];
        __IO uint32_t EMBINEN1;
        __IO uint32_t EMBINEN2;
        __IO uint32_t EMBINEN3;
        __IO uint32_t EMBINEN4;
        __IO uint32_t EMBINEN5;
        __IO uint32_t EMBINEN6;
        __IO uint32_t EMBINEN7;
        __IO uint32_t EMBINEN8;
        uint32_t RESERVED3[3];
        __IO uint32_t SYSFAULTEN1;
        __IO uint32_t SYSFAULTEN2;
        __IO uint32_t SYSFAULTEN3;
        __IO uint32_t SYSFAULTEN4;
        __IO uint32_t SYSFAULTEN5;
    } stc_hrpwm_emb_ctl1_bit_t;

    typedef struct
    {
        __IO uint32_t PWMLV0;
        __IO uint32_t PWMLV1;
        __IO uint32_t PWMLV2;
        __IO uint32_t PWMLV3;
        __IO uint32_t PWMLV4;
        __IO uint32_t PWMLV5;
        __IO uint32_t PWMLV6;
        __IO uint32_t PWMLV7;
        uint32_t RESERVED0[8];
        __IO uint32_t INVSEL1;
        __IO uint32_t INVSEL2;
        __IO uint32_t INVSEL3;
        __IO uint32_t INVSEL4;
        __IO uint32_t INVSEL5;
        __IO uint32_t INVSEL6;
        __IO uint32_t INVSEL7;
        __IO uint32_t INVSEL8;
        uint32_t RESERVED1[7];
        __IO uint32_t NFMD;
    } stc_hrpwm_emb_ctl2_bit_t;

    typedef struct
    {
        __IO uint32_t SOE;
        uint32_t RESERVED0[31];
    } stc_hrpwm_emb_soe_bit_t;

    typedef struct
    {
        __I uint32_t PWMSF;
        __I uint32_t SYSF;
        uint32_t RESERVED0[1];
        __I uint32_t PWMST;
        __I uint32_t SYSST;
        uint32_t RESERVED1[3];
        __I uint32_t EMBINF1;
        __I uint32_t EMBINF2;
        __I uint32_t EMBINF3;
        __I uint32_t EMBINF4;
        __I uint32_t EMBINF5;
        __I uint32_t EMBINF6;
        __I uint32_t EMBINF7;
        __I uint32_t EMBINF8;
        uint32_t RESERVED2[1];
        __I uint32_t EMBINST1;
        __I uint32_t EMBINST2;
        __I uint32_t EMBINST3;
        __I uint32_t EMBINST4;
        __I uint32_t EMBINST5;
        __I uint32_t EMBINST6;
        __I uint32_t EMBINST7;
        __I uint32_t EMBINST8;
        uint32_t RESERVED3[2];
        __I uint32_t SYSFAULTF1;
        __I uint32_t SYSFAULTF2;
        __I uint32_t SYSFAULTF3;
        __I uint32_t SYSFAULTF4;
        __I uint32_t SYSFAULTF5;
    } stc_hrpwm_emb_stat_bit_t;

    typedef struct
    {
        __O uint32_t PWMSFCLR;
        __O uint32_t SYSFCLR;
        uint32_t RESERVED0[6];
        __O uint32_t EMBINFCLR1;
        __O uint32_t EMBINFCLR2;
        __O uint32_t EMBINFCLR3;
        __O uint32_t EMBINFCLR4;
        __O uint32_t EMBINFCLR5;
        __O uint32_t EMBINFCLR6;
        __O uint32_t EMBINFCLR7;
        __O uint32_t EMBINFCLR8;
        uint32_t RESERVED1[11];
        __O uint32_t SYSFAULTF1CLR;
        __O uint32_t SYSFAULTF2CLR;
        __O uint32_t SYSFAULTF3CLR;
        __O uint32_t SYSFAULTF4CLR;
        __O uint32_t SYSFAULTF5CLR;
    } stc_hrpwm_emb_statclr_bit_t;

    typedef struct
    {
        __IO uint32_t PWMSINTEN;
        __IO uint32_t SYSINTEN;
        uint32_t RESERVED0[6];
        __IO uint32_t EMBININTEN1;
        __IO uint32_t EMBININTEN2;
        __IO uint32_t EMBININTEN3;
        __IO uint32_t EMBININTEN4;
        __IO uint32_t EMBININTEN5;
        __IO uint32_t EMBININTEN6;
        __IO uint32_t EMBININTEN7;
        __IO uint32_t EMBININTEN8;
        uint32_t RESERVED1[16];
    } stc_hrpwm_emb_inten_bit_t;

    typedef struct
    {
        __IO uint32_t PWMRSEL;
        __IO uint32_t SYSRSEL;
        uint32_t RESERVED0[6];
        __IO uint32_t EMBINRSEL1;
        __IO uint32_t EMBINRSEL2;
        __IO uint32_t EMBINRSEL3;
        __IO uint32_t EMBINRSEL4;
        __IO uint32_t EMBINRSEL5;
        __IO uint32_t EMBINRSEL6;
        __IO uint32_t EMBINRSEL7;
        __IO uint32_t EMBINRSEL8;
        uint32_t RESERVED1[16];
    } stc_hrpwm_emb_rlssel_bit_t;

