MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    typedef struct
    {
        uint32_t RESERVED0[3];
        __IO uint32_t NFEN1;
        uint32_t RESERVED1[3];
        __IO uint32_t NFEN2;
        uint32_t RESERVED2[3];
        __IO uint32_t NFEN3;
        uint32_t RESERVED3[3];
        __IO uint32_t NFEN4;
        uint32_t RESERVED4[3];
        __IO uint32_t NFEN5;
        uint32_t RESERVED5[3];
        __IO uint32_t NFEN6;
        uint32_t RESERVED6[3];
        __IO uint32_t NFEN7;
        uint32_t RESERVED7[3];
        __IO uint32_t NFEN8;
    } stc_hrpwm_emb_ctl3_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[28];
        __IO uint32_t FBLKE;
        __IO uint32_t FBLKS;
        __IO uint32_t EMBSNS;
        uint32_t RESERVED1[1];
    } stc_hrpwm_emb_ctl4_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __O uint32_t EMBCRES;
        __IO uint32_t EMBARSTM;
        uint32_t RESERVED1[26];
    } stc_hrpwm_emb_ctl5_bit_t;

    typedef struct
    {
        __IO uint32_t PE;
        __IO uint32_t SMBUS;
        __IO uint32_t SMBALRTEN;
        __IO uint32_t SMBDEFAULTEN;
        __IO uint32_t SMBHOSTEN;
        __IO uint32_t SMBALRTPTEN;
        __IO uint32_t GCEN;
        __IO uint32_t RESTART;
        __IO uint32_t START;
        __IO uint32_t STOP;
        __IO uint32_t ACK;
        uint32_t RESERVED0[4];
        __IO uint32_t SWRST;
        uint32_t RESERVED1[16];
    } stc_i2c_cr1_bit_t;

    typedef struct
    {
        __IO uint32_t STARTIE;
        __IO uint32_t SLADDR0IE;
        __IO uint32_t SLADDR1IE;
        __IO uint32_t TENDIE;
        __IO uint32_t STOPIE;
        uint32_t RESERVED0[1];
        __IO uint32_t RFULLIE;
        __IO uint32_t TEMPTYIE;
        __IO uint32_t SLADDR2IE;
        __IO uint32_t ARLOIE;
        uint32_t RESERVED1[1];
        __IO uint32_t RFREQIE;
        __IO uint32_t NACKIE;
        __IO uint32_t PECERRIE;
        __IO uint32_t TMOUTIE;
        __IO uint32_t TCIE;
        uint32_t RESERVED2[3];
        __IO uint32_t SMBALRTPTIE;
        __IO uint32_t GENCALLIE;
        __IO uint32_t SMBDEFAULTIE;
        __IO uint32_t SMBHOSTIE;
        __IO uint32_t SMBALRTIE;
        uint32_t RESERVED3[8];
    } stc_i2c_cr2_bit_t;

    typedef struct
    {
        __IO uint32_t TMOUTEN;
        __IO uint32_t LTMOUT;
        __IO uint32_t HTMOUT;
        __IO uint32_t TEXTEN;
        uint32_t RESERVED0[3];
        __IO uint32_t FACKEN;
        __IO uint32_t MRTEICTL;
        uint32_t RESERVED1[23];
    } stc_i2c_cr3_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[10];
        __IO uint32_t BUSWAIT;
        __IO uint32_t NACKTRA_CLREN;
        __IO uint32_t BUSFREE_CLREN;
        uint32_t RESERVED1[19];
    } stc_i2c_cr4_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[12];
        __IO uint32_t SLADDR0EN;
        uint32_t RESERVED1[2];
        __IO uint32_t ADDRMOD0;
        uint32_t RESERVED2[10];
        __IO uint32_t MASK0EN;
        uint32_t RESERVED3[5];
    } stc_i2c_slr0_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[12];
        __IO uint32_t SLADDR1EN;
        uint32_t RESERVED1[2];
        __IO uint32_t ADDRMOD1;
        uint32_t RESERVED2[10];
        __IO uint32_t MASK1EN;
        uint32_t RESERVED3[5];
    } stc_i2c_slr1_bit_t;

    typedef struct
    {
        __I uint32_t STARTF;
        __I uint32_t SLADDR0F;
        __I uint32_t SLADDR1F;
        __I uint32_t TENDF;
        __I uint32_t STOPF;
        uint32_t RESERVED0[1];
        __I uint32_t RFULLF;
        __I uint32_t TEMPTYF;
        __I uint32_t SLADDR2F;
        __I uint32_t ARLOF;
        __I uint32_t ACKRF;
        __I uint32_t TCRF;
        __I uint32_t NACKF;
        __I uint32_t PECERRF;
        __I uint32_t TMOUTF;
        __I uint32_t TCF;
        __IO uint32_t MSL;
        __I uint32_t BUSY;
        __IO uint32_t TRA;
        __I uint32_t SMBALRTPTF;
        __I uint32_t GENCALLF;
        __I uint32_t SMBDEFAULTF;
        __I uint32_t SMBHOSTF;
        __I uint32_t SMBALRTF;
        __I uint32_t TFEMPTY;
        __I uint32_t TFFULL;
        __I uint32_t RFEMPTY;
        __I uint32_t RFFULL;
        uint32_t RESERVED1[3];
        __I uint32_t RFREQ;
    } stc_i2c_sr_bit_t;

    typedef struct
    {
        __O uint32_t STARTFCLR;
        __O uint32_t SLADDR0FCLR;
        __O uint32_t SLADDR1FCLR;
        __O uint32_t TENDFCLR;
        __O uint32_t STOPFCLR;
        uint32_t RESERVED0[1];
        __O uint32_t RFULLFCLR;
        uint32_t RESERVED1[1];
        __O uint32_t SLADDR2FCLR;
        __O uint32_t ARLOFCLR;
        __O uint32_t RFREQCLR;
        uint32_t RESERVED2[1];
        __O uint32_t NACKFCLR;
        __O uint32_t PECERRFCLR;
        __O uint32_t TMOUTFCLR;
        __O uint32_t TCFCLR;
        uint32_t RESERVED3[3];
        __O uint32_t SMBALRTPTFCLR;
        __O uint32_t GENCALLFCLR;
        __O uint32_t SMBDEFAULTFCLR;
        __O uint32_t SMBHOSTFCLR;
        __O uint32_t SMBALRTFCLR;
        uint32_t RESERVED4[8];
    } stc_i2c_clr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[23];
        __IO uint32_t FMPLUSEN;
        uint32_t RESERVED1[8];
    } stc_i2c_ccr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __IO uint32_t DNFEN;
        __IO uint32_t ANFEN;
        uint32_t RESERVED1[26];
    } stc_i2c_fltr_bit_t;

    typedef struct
    {
        __IO uint32_t FEN;
        __IO uint32_t TFFLUSH;
        __IO uint32_t RFFLUSH;
        __IO uint32_t NACKTFFLUSH;
        uint32_t RESERVED0[28];
    } stc_i2c_fstr_bit_t;

    typedef struct
    {
        __IO uint32_t PECINREF;
        __IO uint32_t PECOUTREF;
        __IO uint32_t PECOUTXOR;
        uint32_t RESERVED0[5];
    } stc_i2c_peccr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[12];
        __IO uint32_t SLADDR2EN;
        uint32_t RESERVED1[2];
        __IO uint32_t ADDRMOD2;
        uint32_t RESERVED2[10];
        __IO uint32_t MASK2EN;
        uint32_t RESERVED3[5];
    } stc_i2c_slr2_bit_t;

    typedef struct
    {
        __IO uint32_t AUTOEND;
        __IO uint32_t PECBYTE;
        __IO uint32_t AUTONAK;
        __IO uint32_t RELOAD;
        __IO uint32_t NBCTRL;
        __IO uint32_t PECEN;
        uint32_t RESERVED0[1];
        __IO uint32_t RSPECCLR;
    } stc_i2c_nbcr_bit_t;

    typedef struct
    {
        __I uint32_t SWDTAUTS;
        __I uint32_t SWDTITS;
        uint32_t RESERVED0[10];
        __I uint32_t SWDTSLPOFF;
        uint32_t RESERVED1[3];
        __I uint32_t WDTAUTS;
        __I uint32_t WDTITS;
        uint32_t RESERVED2[10];
        __I uint32_t WDTSLPOFF;
        uint32_t RESERVED3[3];
    } stc_icg_icg0_bit_t;

    typedef struct
    {
        __I uint32_t HRCFREQSEL;
        uint32_t RESERVED0[7];
        __I uint32_t HRCSTOP;
        uint32_t RESERVED1[9];
        __I uint32_t BORDIS;
        uint32_t RESERVED2[13];
    } stc_icg_icg1_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __I uint32_t ERMUOUTDIS;
        uint32_t RESERVED1[27];
    } stc_icg_icg8_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[1];
        __IO uint32_t SWDTEN;
        __IO uint32_t PVD1EN;
        __IO uint32_t PVD2EN;
        uint32_t RESERVED1[1];
        __IO uint32_t XTALSTPEN;
        uint32_t RESERVED2[3];
        __IO uint32_t RECCERREN;
        __IO uint32_t BUSERREN;
        __IO uint32_t WDTEN;
        __IO uint32_t FECCERREN;
        __IO uint32_t ERMUEN;
        uint32_t RESERVED3[18];
    } stc_intc_nmier_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[1];
        __I uint32_t SWDTF;
        __I uint32_t PVD1F;
        __I uint32_t PVD2F;
        uint32_t RESERVED1[1];
        __I uint32_t XTALSTPF;
        uint32_t RESERVED2[3];
        __I uint32_t RECCERRF;
        __I uint32_t BUSERRF;
        __I uint32_t WDTF;
        __I uint32_t FECCERRF;
        __I uint32_t ERMUF;
        uint32_t RESERVED3[18];
    } stc_intc_nmifr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[1];
        __O uint32_t SWDTFCLR;
        __O uint32_t PVD1FCLR;
        __O uint32_t PVD2FCLR;
        uint32_t RESERVED1[1];
        __O uint32_t XTALSTPFCLR;
        uint32_t RESERVED2[3];
        __O uint32_t RECCERRFCLR;
        __O uint32_t BUSERRFCLR;
        __O uint32_t WDTFCLR;
        __O uint32_t FECCERRFCLR;
        __O uint32_t ERMUFCLR;
        uint32_t RESERVED3[18];
    } stc_intc_nmifcr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[2];
        __IO uint32_t EIRQFS;
        __IO uint32_t EIRQRS;
        uint32_t RESERVED1[3];
        __IO uint32_t EFEN;
        uint32_t RESERVED2[7];
        __IO uint32_t NOCEN;
        uint32_t RESERVED3[16];
    } stc_intc_eirqcr_bit_t;

    typedef struct
    {
        __IO uint32_t EIRQWKEN0;
        __IO uint32_t EIRQWKEN1;
        __IO uint32_t EIRQWKEN2;
        __IO uint32_t EIRQWKEN3;
        __IO uint32_t EIRQWKEN4;
        __IO uint32_t EIRQWKEN5;
        __IO uint32_t EIRQWKEN6;
        __IO uint32_t EIRQWKEN7;
        __IO uint32_t EIRQWKEN8;
        __IO uint32_t EIRQWKEN9;
        __IO uint32_t EIRQWKEN10;
        __IO uint32_t EIRQWKEN11;
        __IO uint32_t EIRQWKEN12;
        __IO uint32_t EIRQWKEN13;
        __IO uint32_t EIRQWKEN14;
        __IO uint32_t EIRQWKEN15;
        __IO uint32_t SWDTWKEN;
        __IO uint32_t PVD1WKEN;
        __IO uint32_t PVD2WKEN;
        __IO uint32_t CMP1WKEN;
        __IO uint32_t CMP8WKEN;
        uint32_t RESERVED0[1];
        __IO uint32_t TMR02CMPWKEN;
        __IO uint32_t TMR01CMPWKEN;
        __IO uint32_t CMP2WKEN;
        __IO uint32_t CMP3WKEN;
        __IO uint32_t RXWKEN;
        __IO uint32_t SPIWKEN;
        __IO uint32_t CMP4WKEN;
        __IO uint32_t CMP5WKEN;
        __IO uint32_t CMP6WKEN;
        __IO uint32_t CMP7WKEN;
    } stc_intc_wken_bit_t;

    typedef struct
    {
        __I uint32_t EIF0;
        __I uint32_t EIF1;
        __I uint32_t EIF2;
        __I uint32_t EIF3;
        __I uint32_t EIF4;
        __I uint32_t EIF5;
        __I uint32_t EIF6;
        __I uint32_t EIF7;
        __I uint32_t EIF8;
        __I uint32_t EIF9;
        __I uint32_t EIF10;
        __I uint32_t EIF11;
        __I uint32_t EIF12;
        __I uint32_t EIF13;
        __I uint32_t EIF14;
        __I uint32_t EIF15;
        uint32_t RESERVED0[16];
    } stc_intc_eifr_bit_t;

    typedef struct
    {
        __IO uint32_t EIFCLR0;
        __IO uint32_t EIFCLR1;
        __IO uint32_t EIFCLR2;
        __IO uint32_t EIFCLR3;
        __IO uint32_t EIFCLR4;
        __IO uint32_t EIFCLR5;
        __IO uint32_t EIFCLR6;
        __IO uint32_t EIFCLR7;
        __IO uint32_t EIFCLR8;
        __IO uint32_t EIFCLR9;
        __IO uint32_t EIFCLR10;
        __IO uint32_t EIFCLR11;
        __IO uint32_t EIFCLR12;
        __IO uint32_t EIFCLR13;
        __IO uint32_t EIFCLR14;
        __IO uint32_t EIFCLR15;
        uint32_t RESERVED0[16];
    } stc_intc_eifcr_bit_t;

    typedef struct
    {
        __IO uint32_t IOCIEN;
        __IO uint32_t DZCIEN;
        __IO uint32_t OFCIEN;
        __IO uint32_t UFCIEN;
        __IO uint32_t IXCIEN;
        __IO uint32_t IDCIEN;
        uint32_t RESERVED0[26];
    } stc_intc_fpuier_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[23];
        __IO uint32_t TDC;
        uint32_t RESERVED1[8];
    } stc_mcan_dbtp_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __IO uint32_t LBCK;
        uint32_t RESERVED1[2];
        __IO uint32_t RX;
        uint32_t RESERVED2[5];
        __I uint32_t PVAL;
        uint32_t RESERVED3[7];
        __I uint32_t SVAL;
        uint32_t RESERVED4[10];
    } stc_mcan_test_bit_t;

    typedef struct
    {
        __IO uint32_t INIT;
        __IO uint32_t CCE;
        __IO uint32_t ASM;
        __I uint32_t CSA;
        __IO uint32_t CSR;
        __IO uint32_t MON;
        __IO uint32_t DAR;
        __IO uint32_t TEST;
        __IO uint32_t FDOE;
        __IO uint32_t BRSE;
        __IO uint32_t UTSU;
        __IO uint32_t WMM;
        __IO uint32_t PXHD;
        __IO uint32_t EFBI;
        __IO uint32_t TXP;
        __IO uint32_t NISO;
        uint32_t RESERVED0[16];
    } stc_mcan_cccr_bit_t;

    typedef struct
    {
        __IO uint32_t ETOC;
        uint32_t RESERVED0[31];
    } stc_mcan_tocc_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[15];
        __I uint32_t RP;
        uint32_t RESERVED1[16];
    } stc_mcan_ecr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[5];
        __I uint32_t EP;
        __I uint32_t EW;
        __I uint32_t BO;
        uint32_t RESERVED1[3];
        __I uint32_t RESI;
        __I uint32_t RBRS;
        __I uint32_t RFDF;
        __I uint32_t PXE;
        uint32_t RESERVED2[17];
    } stc_mcan_psr_bit_t;

    typedef struct
    {
        __IO uint32_t RF0N;
        __IO uint32_t RF0W;
        __IO uint32_t RF0F;
        __IO uint32_t RF0L;
        __IO uint32_t RF1N;
        __IO uint32_t RF1W;
        __IO uint32_t RF1F;
        __IO uint32_t RF1L;
        __IO uint32_t HPM;
        __IO uint32_t TC;
        __IO uint32_t TCF;
        __IO uint32_t TFE;
        __IO uint32_t TEFN;
        __IO uint32_t TEFW;
        __IO uint32_t TEFF;
        __IO uint32_t TEFL;
        __IO uint32_t TSW;
        __IO uint32_t MRAF;
        __IO uint32_t TOO;
        __IO uint32_t DRX;
        __IO uint32_t BEC;
        __IO uint32_t BEU;
        __IO uint32_t ELO;
        __IO uint32_t EP;
        __IO uint32_t EW;
        __IO uint32_t BO;
        __IO uint32_t WDI;
        __IO uint32_t PEA;
        __IO uint32_t PED;
        __IO uint32_t ARA;
        uint32_t RESERVED0[2];
    } stc_mcan_ir_bit_t;

    typedef struct
    {
        __IO uint32_t RF0NE;
        __IO uint32_t RF0WE;
        __IO uint32_t RF0FE;
        __IO uint32_t RF0LE;
        __IO uint32_t RF1NE;
        __IO uint32_t RF1WE;
        __IO uint32_t RF1FE;
        __IO uint32_t RF1LE;
        __IO uint32_t HPME;
        __IO uint32_t TCE;
        __IO uint32_t TCFE;
        __IO uint32_t TFEE;
        __IO uint32_t TEFNE;
        __IO uint32_t TEFWE;
        __IO uint32_t TEFFE;
        __IO uint32_t TEFLE;
        __IO uint32_t TSWE;
        __IO uint32_t MRAFE;
        __IO uint32_t TOOE;
        __IO uint32_t DRXE;
        __IO uint32_t BECE;
        __IO uint32_t BEUE;
        __IO uint32_t ELOE;
        __IO uint32_t EPE;
        __IO uint32_t EWE;
        __IO uint32_t BOE;
        __IO uint32_t WDIE;
        __IO uint32_t PEAE;
        __IO uint32_t PEDE;
        __IO uint32_t ARAE;
        uint32_t RESERVED0[2];
    } stc_mcan_ie_bit_t;

    typedef struct
    {
        __IO uint32_t RF0NL;
        __IO uint32_t RF0WL;
        __IO uint32_t RF0FL;
        __IO uint32_t RF0LL;
        __IO uint32_t RF1NL;
        __IO uint32_t RF1WL;
        __IO uint32_t RF1FL;
        __IO uint32_t RF1LL;
        __IO uint32_t HPML;
        __IO uint32_t TCL;
        __IO uint32_t TCFL;
        __IO uint32_t TFEL;
        __IO uint32_t TEFNL;
        __IO uint32_t TEFWL;
        __IO uint32_t TEFFL;
        __IO uint32_t TEFLL;
        __IO uint32_t TSWL;
        __IO uint32_t MRAFL;
        __IO uint32_t TOOL;
        __IO uint32_t DRXL;
        __IO uint32_t BECL;
        __IO uint32_t BEUL;
        __IO uint32_t ELOL;
        __IO uint32_t EPL;
        __IO uint32_t EWL;
        __IO uint32_t BOL;
        __IO uint32_t WDIL;
        __IO uint32_t PEAL;
        __IO uint32_t PEDL;
        __IO uint32_t ARAL;
        uint32_t RESERVED0[2];
    } stc_mcan_ils_bit_t;

    typedef struct
    {
        __IO uint32_t EINT0;
        __IO uint32_t EINT1;
        uint32_t RESERVED0[30];
    } stc_mcan_ile_bit_t;

    typedef struct
    {
        __IO uint32_t RRFE;
        __IO uint32_t RRFS;
        uint32_t RESERVED0[30];
    } stc_mcan_gfc_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[15];
        __I uint32_t FLST;
        uint32_t RESERVED1[16];
    } stc_mcan_hpms_bit_t;

    typedef struct
    {
        __IO uint32_t ND0;
        __IO uint32_t ND1;
        __IO uint32_t ND2;
        __IO uint32_t ND3;
        __IO uint32_t ND4;
        __IO uint32_t ND5;
        __IO uint32_t ND6;
        __IO uint32_t ND7;
        __IO uint32_t ND8;
        __IO uint32_t ND9;
        __IO uint32_t ND10;
        __IO uint32_t ND11;
        __IO uint32_t ND12;
        __IO uint32_t ND13;
        __IO uint32_t ND14;
        __IO uint32_t ND15;
        __IO uint32_t ND16;
        __IO uint32_t ND17;
        __IO uint32_t ND18;
        __IO uint32_t ND19;
        __IO uint32_t ND20;
        __IO uint32_t ND21;
        __IO uint32_t ND22;
        __IO uint32_t ND23;
        __IO uint32_t ND24;
        __IO uint32_t ND25;
        __IO uint32_t ND26;
        __IO uint32_t ND27;
        __IO uint32_t ND28;
        __IO uint32_t ND29;
        __IO uint32_t ND30;
        __IO uint32_t ND31;
    } stc_mcan_ndat1_bit_t;

    typedef struct
    {
        __IO uint32_t ND32;
        __IO uint32_t ND33;
        __IO uint32_t ND34;
        __IO uint32_t ND35;
        __IO uint32_t ND36;
        __IO uint32_t ND37;
        __IO uint32_t ND38;
        __IO uint32_t ND39;
        __IO uint32_t ND40;
        __IO uint32_t ND41;
        __IO uint32_t ND42;
        __IO uint32_t ND43;
        __IO uint32_t ND44;
        __IO uint32_t ND45;
        __IO uint32_t ND46;
        __IO uint32_t ND47;
        __IO uint32_t ND48;
        __IO uint32_t ND49;
        __IO uint32_t ND50;
        __IO uint32_t ND51;
        __IO uint32_t ND52;
        __IO uint32_t ND53;
        __IO uint32_t ND54;
        __IO uint32_t ND55;
        __IO uint32_t ND56;
        __IO uint32_t ND57;
        __IO uint32_t ND58;
        __IO uint32_t ND59;
        __IO uint32_t ND60;
        __IO uint32_t ND61;
        __IO uint32_t ND62;
        __IO uint32_t ND63;
    } stc_mcan_ndat2_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[31];
        __IO uint32_t F0OM;
    } stc_mcan_rxf0c_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[24];
        __I uint32_t F0F;
        __I uint32_t RF0L;
        uint32_t RESERVED1[6];
    } stc_mcan_rxf0s_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[31];
        __IO uint32_t F1OM;
    } stc_mcan_rxf1c_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[24];
        __I uint32_t F1F;
        __I uint32_t RF1L;
        uint32_t RESERVED1[6];
    } stc_mcan_rxf1s_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[30];
        __IO uint32_t TFQM;
        uint32_t RESERVED1[1];
    } stc_mcan_txbc_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[21];
        __I uint32_t TFQF;
        uint32_t RESERVED1[10];
    } stc_mcan_txfqs_bit_t;

    typedef struct
    {
        __I uint32_t TRP0;
        __I uint32_t TRP1;
        __I uint32_t TRP2;
        __I uint32_t TRP3;
        __I uint32_t TRP4;
        __I uint32_t TRP5;
        __I uint32_t TRP6;
        __I uint32_t TRP7;
        __I uint32_t TRP8;
        __I uint32_t TRP9;
        __I uint32_t TRP10;
        __I uint32_t TRP11;
        __I uint32_t TRP12;
        __I uint32_t TRP13;
        __I uint32_t TRP14;
        __I uint32_t TRP15;
        __I uint32_t TRP16;
        __I uint32_t TRP17;
        __I uint32_t TRP18;
        __I uint32_t TRP19;
        __I uint32_t TRP20;
        __I uint32_t TRP21;
        __I uint32_t TRP22;
        __I uint32_t TRP23;
        __I uint32_t TRP24;
        __I uint32_t TRP25;
        __I uint32_t TRP26;
        __I uint32_t TRP27;
        __I uint32_t TRP28;
        __I uint32_t TRP29;
        __I uint32_t TRP30;
        __I uint32_t TRP31;
    } stc_mcan_txbrp_bit_t;

    typedef struct
    {
        __IO uint32_t AR0;
        __IO uint32_t AR1;
        __IO uint32_t AR2;
        __IO uint32_t AR3;
        __IO uint32_t AR4;
        __IO uint32_t AR5;
        __IO uint32_t AR6;
        __IO uint32_t AR7;
        __IO uint32_t AR8;
        __IO uint32_t AR9;
        __IO uint32_t AR10;
        __IO uint32_t AR11;
        __IO uint32_t AR12;
        __IO uint32_t AR13;
        __IO uint32_t AR14;
        __IO uint32_t AR15;
        __IO uint32_t AR16;
        __IO uint32_t AR17;
        __IO uint32_t AR18;
        __IO uint32_t AR19;
        __IO uint32_t AR20;
        __IO uint32_t AR21;
        __IO uint32_t AR22;
        __IO uint32_t AR23;
        __IO uint32_t AR24;
        __IO uint32_t AR25;
        __IO uint32_t AR26;
        __IO uint32_t AR27;
        __IO uint32_t AR28;
        __IO uint32_t AR29;
        __IO uint32_t AR30;
        __IO uint32_t AR31;
    } stc_mcan_txbar_bit_t;

    typedef struct
    {
        __IO uint32_t CR0;
        __IO uint32_t CR1;
        __IO uint32_t CR2;
        __IO uint32_t CR3;
        __IO uint32_t CR4;
        __IO uint32_t CR5;
        __IO uint32_t CR6;
        __IO uint32_t CR7;
        __IO uint32_t CR8;
        __IO uint32_t CR9;
        __IO uint32_t CR10;
        __IO uint32_t CR11;
        __IO uint32_t CR12;
        __IO uint32_t CR13;
        __IO uint32_t CR14;
        __IO uint32_t CR15;
        __IO uint32_t CR16;
        __IO uint32_t CR17;
        __IO uint32_t CR18;
        __IO uint32_t CR19;
        __IO uint32_t CR20;
        __IO uint32_t CR21;
        __IO uint32_t CR22;
        __IO uint32_t CR23;
        __IO uint32_t CR24;
        __IO uint32_t CR25;
        __IO uint32_t CR26;
        __IO uint32_t CR27;
        __IO uint32_t CR28;
        __IO uint32_t CR29;
        __IO uint32_t CR30;
        __IO uint32_t CR31;
    } stc_mcan_txbcr_bit_t;

    typedef struct
    {
        __I uint32_t TO0;
        __I uint32_t TO1;
        __I uint32_t TO2;
        __I uint32_t TO3;
        __I uint32_t TO4;
        __I uint32_t TO5;
        __I uint32_t TO6;
        __I uint32_t TO7;
        __I uint32_t TO8;
        __I uint32_t TO9;
        __I uint32_t TO10;
        __I uint32_t TO11;
        __I uint32_t TO12;
        __I uint32_t TO13;
        __I uint32_t TO14;
        __I uint32_t TO15;
        __I uint32_t TO16;
        __I uint32_t TO17;
        __I uint32_t TO18;
        __I uint32_t TO19;
        __I uint32_t TO20;
        __I uint32_t TO21;
        __I uint32_t TO22;
        __I uint32_t TO23;
        __I uint32_t TO24;
        __I uint32_t TO25;
        __I uint32_t TO26;
        __I uint32_t TO27;
        __I uint32_t TO28;
        __I uint32_t TO29;
        __I uint32_t TO30;
        __I uint32_t TO31;
    } stc_mcan_txbto_bit_t;

    typedef struct
    {
        __I uint32_t CF0;
        __I uint32_t CF1;
        __I uint32_t CF2;
        __I uint32_t CF3;
        __I uint32_t CF4;
        __I uint32_t CF5;
        __I uint32_t CF6;
        __I uint32_t CF7;
        __I uint32_t CF8;
        __I uint32_t CF9;
        __I uint32_t CF10;
        __I uint32_t CF11;
        __I uint32_t CF12;
        __I uint32_t CF13;
        __I uint32_t CF14;
        __I uint32_t CF15;
        __I uint32_t CF16;
        __I uint32_t CF17;
        __I uint32_t CF18;
        __I uint32_t CF19;
        __I uint32_t CF20;
        __I uint32_t CF21;
        __I uint32_t CF22;
        __I uint32_t CF23;
        __I uint32_t CF24;
        __I uint32_t CF25;
        __I uint32_t CF26;
        __I uint32_t CF27;
        __I uint32_t CF28;
        __I uint32_t CF29;
        __I uint32_t CF30;
        __I uint32_t CF31;
    } stc_mcan_txbcf_bit_t;

