MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    typedef struct
    {
        __IO uint32_t TIE0;
        __IO uint32_t TIE1;
        __IO uint32_t TIE2;
        __IO uint32_t TIE3;
        __IO uint32_t TIE4;
        __IO uint32_t TIE5;
        __IO uint32_t TIE6;
        __IO uint32_t TIE7;
        __IO uint32_t TIE8;
        __IO uint32_t TIE9;
        __IO uint32_t TIE10;
        __IO uint32_t TIE11;
        __IO uint32_t TIE12;
        __IO uint32_t TIE13;
        __IO uint32_t TIE14;
        __IO uint32_t TIE15;
        __IO uint32_t TIE16;
        __IO uint32_t TIE17;
        __IO uint32_t TIE18;
        __IO uint32_t TIE19;
        __IO uint32_t TIE20;
        __IO uint32_t TIE21;
        __IO uint32_t TIE22;
        __IO uint32_t TIE23;
        __IO uint32_t TIE24;
        __IO uint32_t TIE25;
        __IO uint32_t TIE26;
        __IO uint32_t TIE27;
        __IO uint32_t TIE28;
        __IO uint32_t TIE29;
        __IO uint32_t TIE30;
        __IO uint32_t TIE31;
    } stc_mcan_txbtie_bit_t;

    typedef struct
    {
        __IO uint32_t CFIE0;
        __IO uint32_t CFIE1;
        __IO uint32_t CFIE2;
        __IO uint32_t CFIE3;
        __IO uint32_t CFIE4;
        __IO uint32_t CFIE5;
        __IO uint32_t CFIE6;
        __IO uint32_t CFIE7;
        __IO uint32_t CFIE8;
        __IO uint32_t CFIE9;
        __IO uint32_t CFIE10;
        __IO uint32_t CFIE11;
        __IO uint32_t CFIE12;
        __IO uint32_t CFIE13;
        __IO uint32_t CFIE14;
        __IO uint32_t CFIE15;
        __IO uint32_t CFIE16;
        __IO uint32_t CFIE17;
        __IO uint32_t CFIE18;
        __IO uint32_t CFIE19;
        __IO uint32_t CFIE20;
        __IO uint32_t CFIE21;
        __IO uint32_t CFIE22;
        __IO uint32_t CFIE23;
        __IO uint32_t CFIE24;
        __IO uint32_t CFIE25;
        __IO uint32_t CFIE26;
        __IO uint32_t CFIE27;
        __IO uint32_t CFIE28;
        __IO uint32_t CFIE29;
        __IO uint32_t CFIE30;
        __IO uint32_t CFIE31;
    } stc_mcan_txbcie_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[24];
        __I uint32_t EFF;
        __I uint32_t TEFL;
        uint32_t RESERVED1[6];
    } stc_mcan_txefs_bit_t;

    typedef struct
    {
        __IO uint32_t RAM_1ERR;
        __IO uint32_t RAM_2ERR;
        uint32_t RESERVED0[30];
    } stc_mcanram_cksr_bit_t;

    typedef struct
    {
        __IO uint32_t EIEN;
        uint32_t RESERVED0[31];
    } stc_mcanram_eien_bit_t;

    typedef struct
    {
        __I uint32_t SMPU1EAF;
        __I uint32_t SMPU2EAF;
        uint32_t RESERVED0[30];
    } stc_mpu_sr_bit_t;

    typedef struct
    {
        __O uint32_t SMPU1ECLR;
        __O uint32_t SMPU2ECLR;
        uint32_t RESERVED0[30];
    } stc_mpu_eclr_bit_t;

    typedef struct
    {
        __IO uint32_t MPUWE;
        uint32_t RESERVED0[31];
    } stc_mpu_wp_bit_t;

    typedef struct
    {
        __IO uint32_t ENCRYPTRDP;
        __IO uint32_t ENCRYPTWRP;
        __IO uint32_t HASHRDP;
        __IO uint32_t HASHWRP;
        __IO uint32_t TRNGRDP;
        __IO uint32_t TRNGWRP;
        __IO uint32_t CRCRDP;
        __IO uint32_t CRCWRP;
        __IO uint32_t EFMRDP;
        __IO uint32_t EFMWRP;
        __IO uint32_t ERMURDP;
        __IO uint32_t ERMUWRP;
        __IO uint32_t WDTRDP;
        __IO uint32_t WDTWRP;
        __IO uint32_t SWDTRDP;
        __IO uint32_t SWDTWRP;
        __IO uint32_t XCMPRDP;
        __IO uint32_t XCMPWRP;
        uint32_t RESERVED0[2];
        __IO uint32_t DMPURDP;
        __IO uint32_t DMPUWRP;
        __IO uint32_t SRAMCRDP;
        __IO uint32_t SRAMCWRP;
        __IO uint32_t INTCRDP;
        __IO uint32_t INTCWRP;
        __IO uint32_t SYSCRDP;
        __IO uint32_t SYSCWRP;
        __IO uint32_t MSTPRDP;
        __IO uint32_t MSTPWRP;
        uint32_t RESERVED1[1];
        __IO uint32_t BUSERRE;
    } stc_mpu_ippr_bit_t;

    typedef struct
    {
        __IO uint32_t RG0E;
        __IO uint32_t RG1E;
        __IO uint32_t RG2E;
        __IO uint32_t RG3E;
        __IO uint32_t RG4E;
        __IO uint32_t RG5E;
        __IO uint32_t RG6E;
        __IO uint32_t RG7E;
        __IO uint32_t RG8E;
        __IO uint32_t RG9E;
        __IO uint32_t RG10E;
        __IO uint32_t RG11E;
        __IO uint32_t RG12E;
        __IO uint32_t RG13E;
        __IO uint32_t RG14E;
        __IO uint32_t RG15E;
        uint32_t RESERVED0[16];
    } stc_mpu_srge_bit_t;

    typedef struct
    {
        __IO uint32_t RG0WP;
        __IO uint32_t RG1WP;
        __IO uint32_t RG2WP;
        __IO uint32_t RG3WP;
        __IO uint32_t RG4WP;
        __IO uint32_t RG5WP;
        __IO uint32_t RG6WP;
        __IO uint32_t RG7WP;
        __IO uint32_t RG8WP;
        __IO uint32_t RG9WP;
        __IO uint32_t RG10WP;
        __IO uint32_t RG11WP;
        __IO uint32_t RG12WP;
        __IO uint32_t RG13WP;
        __IO uint32_t RG14WP;
        __IO uint32_t RG15WP;
        uint32_t RESERVED0[16];
    } stc_mpu_srgwp_bit_t;

    typedef struct
    {
        __IO uint32_t RG0RP;
        __IO uint32_t RG1RP;
        __IO uint32_t RG2RP;
        __IO uint32_t RG3RP;
        __IO uint32_t RG4RP;
        __IO uint32_t RG5RP;
        __IO uint32_t RG6RP;
        __IO uint32_t RG7RP;
        __IO uint32_t RG8RP;
        __IO uint32_t RG9RP;
        __IO uint32_t RG10RP;
        __IO uint32_t RG11RP;
        __IO uint32_t RG12RP;
        __IO uint32_t RG13RP;
        __IO uint32_t RG14RP;
        __IO uint32_t RG15RP;
        uint32_t RESERVED0[16];
    } stc_mpu_srgrp_bit_t;

    typedef struct
    {
        __IO uint32_t SMPUBRP;
        __IO uint32_t SMPUBWP;
        uint32_t RESERVED0[5];
        __IO uint32_t SMPUE;
        uint32_t RESERVED1[24];
    } stc_mpu_scr_bit_t;

    typedef struct
    {
        __IO uint32_t OTSE;
        uint32_t RESERVED0[15];
    } stc_ots_ctl_bit_t;

    typedef struct
    {
        __IO uint32_t TMR0_1_A;
        __IO uint32_t TMR0_1_B;
        __IO uint32_t TMR0_2_A;
        __IO uint32_t TMR0_2_B;
        uint32_t RESERVED0[4];
        __IO uint32_t HRPWM_1;
        __IO uint32_t HRPWM_2;
        __IO uint32_t HRPWM_3;
        __IO uint32_t HRPWM_4;
        __IO uint32_t HRPWM_5;
        __IO uint32_t HRPWM_6;
        __IO uint32_t HRPWM_7;
        __IO uint32_t HRPWM_8;
        uint32_t RESERVED1[7];
        __IO uint32_t TMR6_1;
        __IO uint32_t TMR6_2;
        __IO uint32_t TMR6_3;
        __IO uint32_t TMR6_4;
        __IO uint32_t TMR6_5;
        __IO uint32_t TMR6_6;
        uint32_t RESERVED2[3];
    } stc_peric_tmr_synenr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[2];
        __IO uint32_t USART1_NFE;
        uint32_t RESERVED1[29];
    } stc_peric_usart1_nfc_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[2];
        __IO uint32_t SPI1_NFE;
        uint32_t RESERVED1[29];
    } stc_peric_spi1_nfc_bit_t;

    typedef struct
    {
        __O uint32_t START;
        __O uint32_t CLEAR;
        __O uint32_t FSM_RST;
        uint32_t RESERVED0[4];
        __IO uint32_t PID_EN;
        __IO uint32_t U1P1_EN;
        __IO uint32_t U1P2_EN;
        uint32_t RESERVED1[3];
        __IO uint32_t U3P1_EN;
        __IO uint32_t U3P2_EN;
        __IO uint32_t U3P2_WAIT;
        uint32_t RESERVED2[2];
        __IO uint32_t U3P3_EN;
        __IO uint32_t U3P4_EN;
        __IO uint32_t U3P4_WAIT;
        __IO uint32_t U3P4_TYPE;
        __IO uint32_t U4P1_EN;
        __IO uint32_t U5P1_EN;
        __IO uint32_t U5P2_EN;
        uint32_t RESERVED3[4];
        __IO uint32_t IMODE;
        __IO uint32_t DMODE;
        __IO uint32_t ISAT_EN;
    } stc_pid_cr_bit_t;

    typedef struct
    {
        __IO uint32_t DATA_RDY;
        uint32_t RESERVED0[7];
        __IO uint32_t CAL_OOR;
        __IO uint32_t CAL_INF;
        __IO uint32_t CAL_NAN;
        uint32_t RESERVED1[21];
    } stc_pid_sta_bit_t;

    typedef struct
    {
        __IO uint32_t INT_EN;
        uint32_t RESERVED0[7];
        __IO uint32_t EMIN_SEL;
        __IO uint32_t IMIN_SEL;
        __IO uint32_t DMIN_SEL;
        __IO uint32_t UMIN_SEL;
        __IO uint32_t U1MIN_SEL;
        __IO uint32_t U3MIN_SEL;
        __IO uint32_t U5MIN_SEL;
        __IO uint32_t KFMIN_SEL;
        uint32_t RESERVED1[14];
        __IO uint32_t REF_INIT;
        __IO uint32_t RAMP_EN;
    } stc_pid_cr2_bit_t;

    typedef struct
    {
        __IO uint32_t CMP_EN;
        uint32_t RESERVED0[14];
        __IO uint32_t BMODE;
        __IO uint32_t CMP_INT_EN;
        __IO uint32_t BURST_INT_EN;
        uint32_t RESERVED1[6];
        __IO uint32_t BURST_INT_SEL;
        uint32_t RESERVED2[7];
    } stc_pid_cmp_cr_bit_t;

    typedef struct
    {
        __IO uint32_t CMP_STA;
        uint32_t RESERVED0[7];
        __IO uint32_t BSTA;
        __IO uint32_t BST_DONE;
        uint32_t RESERVED1[22];
    } stc_pid_cmp_csta_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[6];
        __IO uint32_t OEN;
        uint32_t RESERVED1[2];
        __IO uint32_t FFRST;
        uint32_t RESERVED2[22];
    } stc_pla_ctl_bit_t;

    typedef struct
    {
        __IO uint32_t SRAMH;
        uint32_t RESERVED0[3];
        __IO uint32_t SRAM1;
        uint32_t RESERVED1[6];
        __IO uint32_t PLA;
        uint32_t RESERVED2[2];
        __IO uint32_t DMA1;
        __IO uint32_t DMA2;
        __IO uint32_t FCM;
        __IO uint32_t AOS;
        __IO uint32_t CTC;
        __IO uint32_t CORDIC;
        __IO uint32_t SKE;
        __IO uint32_t HASH;
        __IO uint32_t TRNG;
        __IO uint32_t CRC;
        uint32_t RESERVED3[1];
        __IO uint32_t PID;
        __IO uint32_t PID_CMP;
        uint32_t RESERVED4[2];
        __IO uint32_t XCMP;
        __IO uint32_t SDFM;
        __IO uint32_t DSOGI_PLL;
    } stc_pwc_fcg0_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __IO uint32_t I2C1;
        __IO uint32_t I2C2;
        __IO uint32_t I2C3;
        uint32_t RESERVED1[9];
        __IO uint32_t SPI1;
        __IO uint32_t SPI2;
        __IO uint32_t SPI3;
        uint32_t RESERVED2[5];
        __IO uint32_t FMAC;
        uint32_t RESERVED3[3];
        __IO uint32_t MCAN1;
        __IO uint32_t MCAN2;
        __IO uint32_t MCAN3;
        uint32_t RESERVED4[1];
    } stc_pwc_fcg1_bit_t;

    typedef struct
    {
        __IO uint32_t TMR6_1;
        __IO uint32_t TMR6_2;
        __IO uint32_t TMR6_3;
        __IO uint32_t TMR6_4;
        __IO uint32_t TMR6_5;
        __IO uint32_t TMR6_6;
        uint32_t RESERVED0[6];
        __IO uint32_t TMR0_1;
        __IO uint32_t TMR0_2;
        uint32_t RESERVED1[1];
        __IO uint32_t EMB;
        __IO uint32_t HRPWM_1;
        __IO uint32_t HRPWM_2;
        __IO uint32_t HRPWM_3;
        __IO uint32_t HRPWM_4;
        __IO uint32_t HRPWM_5;
        __IO uint32_t HRPWM_6;
        __IO uint32_t HRPWM_7;
        __IO uint32_t HRPWM_8;
        uint32_t RESERVED2[6];
        __IO uint32_t TRLPWM;
        __IO uint32_t XBAR;
    } stc_pwc_fcg2_bit_t;

    typedef struct
    {
        __IO uint32_t ADC1;
        __IO uint32_t ADC2;
        __IO uint32_t ADC3;
        __IO uint32_t CMBIAS;
        __IO uint32_t DAC1;
        __IO uint32_t DAC2;
        __IO uint32_t DAC3;
        __IO uint32_t DAC4;
        __IO uint32_t CMP12;
        __IO uint32_t CMP34;
        __IO uint32_t CMP56;
        __IO uint32_t CMP78;
        __IO uint32_t OTS;
        __IO uint32_t VREF;
        __IO uint32_t ADC4;
        uint32_t RESERVED0[5];
        __IO uint32_t USART1;
        __IO uint32_t USART2;
        __IO uint32_t USART3;
        __IO uint32_t USART4;
        uint32_t RESERVED1[8];
    } stc_pwc_fcg3_bit_t;

    typedef struct
    {
        __IO uint32_t PRT0;
        uint32_t RESERVED0[31];
    } stc_pwc_fcg0pc_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[6];
        __IO uint32_t ADBUFS;
        __IO uint32_t ADBUFE;
    } stc_pwc_pwrc4_bit_t;

    typedef struct
    {
        __IO uint32_t EXVCCINEN;
        uint32_t RESERVED0[4];
        __IO uint32_t PVD1EN;
        __IO uint32_t PVD2EN;
        uint32_t RESERVED1[1];
    } stc_pwc_pvdcr0_bit_t;

    typedef struct
    {
        __IO uint32_t PVD1IRE;
        __IO uint32_t PVD1IRS;
        __IO uint32_t PVD1CMPOE;
        uint32_t RESERVED0[1];
        __IO uint32_t PVD2IRE;
        __IO uint32_t PVD2IRS;
        __IO uint32_t PVD2CMPOE;
        uint32_t RESERVED1[1];
    } stc_pwc_pvdcr1_bit_t;

    typedef struct
    {
        __IO uint32_t PVD1NFDIS;
        uint32_t RESERVED0[3];
        __IO uint32_t PVD2NFDIS;
        uint32_t RESERVED1[3];
    } stc_pwc_pvdfcr_bit_t;

    typedef struct
    {
        __IO uint32_t SWRCMP;
        __IO uint32_t WDRCMP;
        __IO uint32_t SWRIOCLR;
        __IO uint32_t WDRIOCLR;
        __IO uint32_t SWRDAC;
        __IO uint32_t WDRDAC;
        __IO uint32_t SWRTNE;
        __IO uint32_t WDRTNE;
    } stc_pwc_pwrc6_bit_t;

    typedef struct
    {
        __IO uint32_t RAMPDC0;
        __IO uint32_t RAMPDC1;
        __IO uint32_t RAMPDC2;
        uint32_t RESERVED0[4];
        __IO uint32_t RAMPDC7;
        __IO uint32_t RAMPDC8;
        uint32_t RESERVED1[23];
    } stc_pwc_rampc0_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[2];
        __IO uint32_t PRAMPDC2;
        uint32_t RESERVED1[2];
        __IO uint32_t PRAMPDC5;
        __IO uint32_t PRAMPDC6;
        uint32_t RESERVED2[4];
        __IO uint32_t PRAMPDC11;
        uint32_t RESERVED3[20];
    } stc_pwc_pramlpc_bit_t;

    typedef struct
    {
        __IO uint32_t LPMF;
        uint32_t RESERVED0[15];
    } stc_pwc_lpmcsr_bit_t;

    typedef struct
    {
        __IO uint32_t LPMFC;
        uint32_t RESERVED0[15];
    } stc_pwc_lpmcscr_bit_t;

    typedef struct
    {
        __IO uint32_t PVD1NMIS;
        uint32_t RESERVED0[3];
        __IO uint32_t PVD2NMIS;
        uint32_t RESERVED1[3];
    } stc_pwc_pvdicr_bit_t;

    typedef struct
    {
        __IO uint32_t PVD1MON;
        __IO uint32_t PVD1DETFLG;
        uint32_t RESERVED0[2];
        __IO uint32_t PVD2MON;
        __IO uint32_t PVD2DETFLG;
        uint32_t RESERVED1[2];
    } stc_pwc_pvddsr_bit_t;

    typedef struct
    {
        __IO uint32_t FLNWT;
        __IO uint32_t CKSMRC;
        uint32_t RESERVED0[13];
        __IO uint32_t STOP;
    } stc_pwc_stpmcr_bit_t;

    typedef struct
    {
        __IO uint32_t FPRCB0;
        __IO uint32_t FPRCB1;
        uint32_t RESERVED0[1];
        __IO uint32_t FPRCB3;
        uint32_t RESERVED1[12];
    } stc_pwc_fprc_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[8];
        __IO uint32_t ERMU;
        uint32_t RESERVED1[2];
        __IO uint32_t PLA;
        uint32_t RESERVED2[2];
        __IO uint32_t DMA1;
        __IO uint32_t DMA2;
        __IO uint32_t FCM;
        __IO uint32_t AOS;
        __IO uint32_t CTC;
        __IO uint32_t CORDIC;
        __IO uint32_t SKE;
        __IO uint32_t HASH;
        __IO uint32_t TRNG;
        __IO uint32_t CRC;
        uint32_t RESERVED3[1];
        __IO uint32_t PID;
        __IO uint32_t PID_CMP;
        uint32_t RESERVED4[2];
        __IO uint32_t XCMP;
        __IO uint32_t SDFM;
        __IO uint32_t DSOGI_PLL;
    } stc_rmu_frst0_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __IO uint32_t I2C1;
        __IO uint32_t I2C2;
        __IO uint32_t I2C3;
        uint32_t RESERVED1[9];
        __IO uint32_t SPI1;
        __IO uint32_t SPI2;
        __IO uint32_t SPI3;
        uint32_t RESERVED2[5];
        __IO uint32_t FMAC;
        uint32_t RESERVED3[3];
        __IO uint32_t MCAN1;
        __IO uint32_t MCAN2;
        __IO uint32_t MCAN3;
        uint32_t RESERVED4[1];
    } stc_rmu_frst1_bit_t;

    typedef struct
    {
        __IO uint32_t TMR6;
        uint32_t RESERVED0[11];
        __IO uint32_t TMR0_1;
        __IO uint32_t TMR0_2;
        uint32_t RESERVED1[1];
        __IO uint32_t EMB;
        __IO uint32_t HRPWM;
        uint32_t RESERVED2[13];
        __IO uint32_t TRLPWM;
        __IO uint32_t XBAR;
    } stc_rmu_frst2_bit_t;

    typedef struct
    {
        __IO uint32_t ADC1;
        __IO uint32_t ADC2;
        __IO uint32_t ADC3;
        __IO uint32_t ADC4;
        __IO uint32_t DAC1;
        __IO uint32_t DAC2;
        __IO uint32_t DAC3;
        __IO uint32_t DAC4;
        __IO uint32_t CMP12;
        __IO uint32_t CMP34;
        __IO uint32_t CMP56;
        __IO uint32_t CMP78;
        __IO uint32_t OTS;
        __IO uint32_t VREF;
        uint32_t RESERVED0[6];
        __IO uint32_t USART1;
        __IO uint32_t USART2;
        __IO uint32_t USART3;
        __IO uint32_t USART4;
        uint32_t RESERVED1[8];
    } stc_rmu_frst3_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[5];
        __IO uint32_t LKUPREN;
        uint32_t RESERVED1[2];
    } stc_rmu_prstcr0_bit_t;

    typedef struct
    {
        __IO uint32_t PORF;
        __IO uint32_t PINRF;
        __IO uint32_t BORF;
        __IO uint32_t PVD1RF;
        __IO uint32_t PVD2RF;
        __IO uint32_t WDRF;
        __IO uint32_t SWDRF;
        uint32_t RESERVED0[1];
        __IO uint32_t SWRF;
        __IO uint32_t MPUERF;
        uint32_t RESERVED1[1];
        __IO uint32_t RAECRF;
        __IO uint32_t CKFERF;
        __IO uint32_t XTALERF;
        __IO uint32_t LKUPRF;
        __IO uint32_t FLECRF;
        __IO uint32_t ERMURF;
        uint32_t RESERVED2[13];
        __IO uint32_t MULTIRF;
        __IO uint32_t CLRF;
    } stc_rmu_rstf0_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[5];
        __IO uint32_t SCDEN;
        __IO uint32_t CKABEN;
        __IO uint32_t CHEN;
        __IO uint32_t CHINSEL;
        __IO uint32_t SDCLKSYNC;
        __IO uint32_t SDDATASYNC;
        __IO uint32_t SDCLKSEL;
        uint32_t RESERVED1[18];
        __IO uint32_t CKOUTSRC;
        __IO uint32_t SDFMEN;
    } stc_sdfm_chcfgr1_bit_t;

    typedef struct
    {
        __IO uint32_t DFEN;
        __O uint32_t JSWSTART;
        uint32_t RESERVED0[1];
        __IO uint32_t JSYNC;
        __IO uint32_t JSCAN;
        __IO uint32_t JDMAEN;
        __IO uint32_t JSCAN_TYPE;
        uint32_t RESERVED1[10];
        __O uint32_t RSWSTART;
        __IO uint32_t RCONT;
        __IO uint32_t RSYNC;
        uint32_t RESERVED2[1];
        __IO uint32_t RDMAEN;
        uint32_t RESERVED3[7];
        __IO uint32_t FAST;
        __IO uint32_t AWFSEL;
        __IO uint32_t OVDEL;
    } stc_sdfm_fltcr1_bit_t;

    typedef struct
    {
        __IO uint32_t JEOCIE;
        __IO uint32_t REOCIE;
        __IO uint32_t JOVRIE;
        __IO uint32_t ROVRIE;
        __IO uint32_t AWDIE;
        __IO uint32_t SCDIE;
        __IO uint32_t CKABIE;
        uint32_t RESERVED0[25];
    } stc_sdfm_fltcr2_bit_t;

    typedef struct
    {
        __I uint32_t JEOCF;
        __I uint32_t REOCF;
        __I uint32_t JOVRF;
        __I uint32_t ROVRF;
        __I uint32_t AWDF;
        uint32_t RESERVED0[8];
        __I uint32_t JCIP;
        __I uint32_t RCIP;
        uint32_t RESERVED1[17];
    } stc_sdfm_fltisr_bit_t;

    typedef struct
    {
        __O uint32_t CLRJEOCF;
        uint32_t RESERVED0[1];
        __O uint32_t CLRJOVRF;
        __O uint32_t CLRROVRF;
        uint32_t RESERVED1[28];
    } stc_sdfm_flticr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __I uint32_t RPEND;
        uint32_t RESERVED1[27];
    } stc_sdfm_fltrdatar_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[5];
        __IO uint32_t WTSYNCEN;
        __IO uint32_t FFSYNCLREN;
        __IO uint32_t WTSCLREN;
        uint32_t RESERVED1[7];
        __I uint32_t WTSYNFLG;
        __O uint32_t WTSYNCLR;
        uint32_t RESERVED2[15];
    } stc_sdfm_fltfifoctl_bit_t;

    typedef struct
    {
        __IO uint32_t EN_CEVT1;
        __IO uint32_t EN_CEVT2;
        __IO uint32_t HZEN;
        uint32_t RESERVED0[2];
        __IO uint32_t CEVFILTER_EN;
        uint32_t RESERVED1[5];
        __IO uint32_t CEVT1DIGFILTSEL;
        __IO uint32_t CEVT2DIGFILTSEL;
        uint32_t RESERVED2[18];
        __O uint32_t FILINIT;
    } stc_sdfm_fltcparm_bit_t;

    typedef struct
    {
        __IO uint32_t START;
        uint32_t RESERVED0[31];
    } stc_ske_ctrl_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[11];
        __IO uint32_t DEC;
        __IO uint32_t UP_CFG;
        uint32_t RESERVED1[3];
        __IO uint32_t DMAEN;
        __IO uint32_t IRQEN;
        uint32_t RESERVED2[14];
    } stc_ske_cfg_bit_t;

    typedef struct
    {
        __I uint32_t BUSY;
        __IO uint32_t MID_O_VALID;
        uint32_t RESERVED0[30];
    } stc_ske_sr1_bit_t;

    typedef struct
    {
        __IO uint32_t CORE_DONE;
        uint32_t RESERVED0[31];
    } stc_ske_sr2_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[16];
        __IO uint32_t LAST;
        uint32_t RESERVED1[15];
    } stc_ske_din_cr_bit_t;

    typedef struct
    {
        __IO uint32_t SPIMDS;
        __IO uint32_t TXMDS;
        __IO uint32_t RXMDS;
        __IO uint32_t MSTR;
        __IO uint32_t SPLPBK;
        __IO uint32_t SPLPBK2;
        __IO uint32_t SPE;
        __IO uint32_t CSUSPE;
        __IO uint32_t EIE;
        __IO uint32_t TXIE;
        __IO uint32_t RXIE;
        __IO uint32_t IDIE;
        __IO uint32_t MODFE;
        __IO uint32_t PATE;
        __IO uint32_t PAOE;
        __IO uint32_t PAE;
        uint32_t RESERVED0[16];
    } stc_spi_cr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[2];
        __IO uint32_t CTMDS;
        uint32_t RESERVED1[3];
        __IO uint32_t SPRDTD;
        uint32_t RESERVED2[1];
        __IO uint32_t SS0PV;
        __IO uint32_t SS1PV;
        __IO uint32_t SS2PV;
        __IO uint32_t SS3PV;
        uint32_t RESERVED3[20];
    } stc_spi_cfg1_bit_t;

    typedef struct
    {
        __IO uint32_t OVRERF;
        __I uint32_t IDLNF;
        __IO uint32_t MODFERF;
        __IO uint32_t PERF;
        __IO uint32_t UDRERF;
        __I uint32_t TDEF;
        __I uint32_t FMIDLF;
        __I uint32_t RDFF;
        uint32_t RESERVED0[24];
    } stc_spi_sr_bit_t;

    typedef struct
    {
        __IO uint32_t CPHA;
        __IO uint32_t CPOL;
        uint32_t RESERVED0[10];
        __IO uint32_t LSBF;
        __IO uint32_t MIDIE;
        __IO uint32_t MSSDLE;
        __IO uint32_t MSSIE;
        uint32_t RESERVED1[16];
    } stc_spi_cfg2_bit_t;

    typedef struct
    {
        __IO uint32_t WTPRC;
        uint32_t RESERVED0[31];
    } stc_sramc_wtpr_bit_t;

    typedef struct
    {
        __IO uint32_t CACHE_ECCOAD;
        __IO uint32_t SRAM1_ECCOAD;
        uint32_t RESERVED0[1];
        __IO uint32_t SRAMH_ECCOAD;
        uint32_t RESERVED1[27];
        __IO uint32_t SRAMH_SWAP;
    } stc_sramc_ckcr_bit_t;

    typedef struct
    {
        __IO uint32_t CKPRC;
        uint32_t RESERVED0[31];
    } stc_sramc_ckpr_bit_t;

    typedef struct
    {
        __IO uint32_t CACHE_1ERR;
        __IO uint32_t CACHE_2ERR;
        __IO uint32_t SRAM1_1ERR;
        __IO uint32_t SRAM1_2ERR;
        uint32_t RESERVED0[2];
        __IO uint32_t SRAMH_1ERR;
        __IO uint32_t SRAMH_2ERR;
        uint32_t RESERVED1[24];
    } stc_sramc_cksr_bit_t;

    typedef struct
    {
        __IO uint32_t EIEN;
        uint32_t RESERVED0[31];
    } stc_sramc_sram1_eien_bit_t;

    typedef struct
    {
        __IO uint32_t EIEN;
        uint32_t RESERVED0[31];
    } stc_sramc_sramh_eien_bit_t;

    typedef struct
    {
        __IO uint32_t EIEN;
        uint32_t RESERVED0[31];
    } stc_sramc_cache_eien_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[16];
        __IO uint32_t SLPOFF;
        uint32_t RESERVED1[14];
        __IO uint32_t ITS;
    } stc_swdt_cr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[16];
        __IO uint32_t UDF;
        __IO uint32_t REF;
        uint32_t RESERVED1[14];
    } stc_swdt_sr_bit_t;

