MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    typedef struct
    {
        __IO uint32_t CSTA;
        __IO uint32_t CAPMDA;
        __IO uint32_t CMENA;
        __IO uint32_t OVENA;
        uint32_t RESERVED0[4];
        __IO uint32_t SYNSA;
        __IO uint32_t SYNCLKA;
        uint32_t RESERVED1[2];
        __IO uint32_t HSTAA;
        __IO uint32_t HSTPA;
        __IO uint32_t HCLEA;
        __IO uint32_t HICPA;
        __IO uint32_t CSTB;
        __IO uint32_t CAPMDB;
        __IO uint32_t CMENB;
        __IO uint32_t OVENB;
        uint32_t RESERVED2[4];
        __IO uint32_t SYNSB;
        __IO uint32_t SYNCLKB;
        uint32_t RESERVED3[2];
        __IO uint32_t HSTAB;
        __IO uint32_t HSTPB;
        __IO uint32_t HCLEB;
        __IO uint32_t HICPB;
    } stc_tmr0_bconr_bit_t;

    typedef struct
    {
        __IO uint32_t CMFA;
        __IO uint32_t OVFA;
        __IO uint32_t ICPA;
        uint32_t RESERVED0[5];
        __IO uint32_t SYDA;
        uint32_t RESERVED1[7];
        __IO uint32_t CMFB;
        __IO uint32_t OVFB;
        __IO uint32_t ICPB;
        uint32_t RESERVED2[5];
        __IO uint32_t SYDB;
        uint32_t RESERVED3[7];
    } stc_tmr0_stflr_bit_t;

    typedef struct
    {
        __IO uint32_t START;
        __IO uint32_t DIR;
        __IO uint32_t MODE;
        uint32_t RESERVED0[5];
        __IO uint32_t OVSTP;
        __IO uint32_t FODIR;
        uint32_t RESERVED1[6];
        __IO uint32_t ZMSKREV;
        __IO uint32_t ZMSKPOS;
        uint32_t RESERVED2[14];
    } stc_tmr6_gconr_bit_t;

    typedef struct
    {
        __IO uint32_t INTENA;
        __IO uint32_t INTENB;
        __IO uint32_t INTENC;
        __IO uint32_t INTEND;
        __IO uint32_t INTENE;
        __IO uint32_t INTENF;
        __IO uint32_t INTENOVF;
        __IO uint32_t INTENUDF;
        __IO uint32_t INTENDTE;
        uint32_t RESERVED0[7];
        __IO uint32_t INTENSAU;
        __IO uint32_t INTENSAD;
        __IO uint32_t INTENSBU;
        __IO uint32_t INTENSBD;
        uint32_t RESERVED1[12];
    } stc_tmr6_iconr_bit_t;

    typedef struct
    {
        __IO uint32_t BENA;
        __IO uint32_t BSEA;
        __IO uint32_t BTRUA;
        __IO uint32_t BTRDA;
        __IO uint32_t BENB;
        __IO uint32_t BSEB;
        __IO uint32_t BTRUB;
        __IO uint32_t BTRDB;
        __IO uint32_t BENP;
        __IO uint32_t BSEP;
        __IO uint32_t BTRUP;
        __IO uint32_t BTRDP;
        uint32_t RESERVED0[4];
        __IO uint32_t BENSPA;
        __IO uint32_t BSESPA;
        __IO uint32_t BTRUSPA;
        __IO uint32_t BTRDSPA;
        __IO uint32_t BENSPB;
        __IO uint32_t BSESPB;
        __IO uint32_t BTRUSPB;
        __IO uint32_t BTRDSPB;
        uint32_t RESERVED1[8];
    } stc_tmr6_bconr_bit_t;

    typedef struct
    {
        __IO uint32_t DTCEN;
        __IO uint32_t SEPA;
        uint32_t RESERVED0[2];
        __IO uint32_t DTBENU;
        __IO uint32_t DTBEND;
        __IO uint32_t DTBTRU;
        __IO uint32_t DTBTRD;
        uint32_t RESERVED1[3];
        __IO uint32_t DTREFCTL;
        uint32_t RESERVED2[20];
    } stc_tmr6_dconr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[28];
        __IO uint32_t OUTENA;
        uint32_t RESERVED1[2];
        __IO uint32_t CAPMDA;
    } stc_tmr6_pcnar_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[28];
        __IO uint32_t OUTENB;
        uint32_t RESERVED1[2];
        __IO uint32_t CAPMDB;
    } stc_tmr6_pcnbr_bit_t;

    typedef struct
    {
        __IO uint32_t NOFIENGA;
        uint32_t RESERVED0[3];
        __IO uint32_t NOFIENGB;
        uint32_t RESERVED1[3];
        __IO uint32_t NOFIENGPLA;
        uint32_t RESERVED2[23];
    } stc_tmr6_fcngr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[8];
        __IO uint32_t SPPERIA;
        __IO uint32_t SPPERIB;
        uint32_t RESERVED1[14];
        __IO uint32_t PCTRL;
        uint32_t RESERVED2[7];
    } stc_tmr6_vperr_bit_t;

    typedef struct
    {
        __IO uint32_t CMAF;
        __IO uint32_t CMBF;
        __IO uint32_t CMCF;
        __IO uint32_t CMDF;
        __IO uint32_t CMEF;
        __IO uint32_t CMFF;
        __IO uint32_t OVFF;
        __IO uint32_t UDFF;
        __I uint32_t DTEF;
        __IO uint32_t CMSAUF;
        __IO uint32_t CMSADF;
        __IO uint32_t CMSBUF;
        __IO uint32_t CMSBDF;
        uint32_t RESERVED0[13];
        __IO uint32_t CMAF2;
        __IO uint32_t CMBF2;
        uint32_t RESERVED1[3];
        __I uint32_t DIRF;
    } stc_tmr6_stflr_bit_t;

    typedef struct
    {
        __IO uint32_t HSTA0;
        __IO uint32_t HSTA1;
        __IO uint32_t HSTA2;
        __IO uint32_t HSTA3;
        uint32_t RESERVED0[3];
        __IO uint32_t STAS;
        __IO uint32_t HSTA8;
        __IO uint32_t HSTA9;
        __IO uint32_t HSTA10;
        __IO uint32_t HSTA11;
        __IO uint32_t HSTA12;
        __IO uint32_t HSTA13;
        uint32_t RESERVED1[2];
        __IO uint32_t HSTA16;
        __IO uint32_t HSTA17;
        __IO uint32_t HSTA18;
        __IO uint32_t HSTA19;
        __IO uint32_t HSTA20;
        __IO uint32_t HSTA21;
        __IO uint32_t HSTA22;
        __IO uint32_t HSTA23;
        uint32_t RESERVED2[2];
        __IO uint32_t HSTA26;
        __IO uint32_t HSTA27;
        uint32_t RESERVED3[4];
    } stc_tmr6_hstar_bit_t;

    typedef struct
    {
        __IO uint32_t HSTP0;
        __IO uint32_t HSTP1;
        __IO uint32_t HSTP2;
        __IO uint32_t HSTP3;
        uint32_t RESERVED0[3];
        __IO uint32_t STPS;
        __IO uint32_t HSTP8;
        __IO uint32_t HSTP9;
        __IO uint32_t HSTP10;
        __IO uint32_t HSTP11;
        __IO uint32_t HSTP12;
        __IO uint32_t HSTP13;
        uint32_t RESERVED1[2];
        __IO uint32_t HSTP16;
        __IO uint32_t HSTP17;
        __IO uint32_t HSTP18;
        __IO uint32_t HSTP19;
        __IO uint32_t HSTP20;
        __IO uint32_t HSTP21;
        __IO uint32_t HSTP22;
        __IO uint32_t HSTP23;
        uint32_t RESERVED2[2];
        __IO uint32_t HSTP26;
        __IO uint32_t HSTP27;
        uint32_t RESERVED3[4];
    } stc_tmr6_hstpr_bit_t;

    typedef struct
    {
        __IO uint32_t HCLE0;
        __IO uint32_t HCLE1;
        __IO uint32_t HCLE2;
        __IO uint32_t HCLE3;
        uint32_t RESERVED0[3];
        __IO uint32_t CLES;
        __IO uint32_t HCLE8;
        __IO uint32_t HCLE9;
        __IO uint32_t HCLE10;
        __IO uint32_t HCLE11;
        __IO uint32_t HCLE12;
        __IO uint32_t HCLE13;
        uint32_t RESERVED1[2];
        __IO uint32_t HCLE16;
        __IO uint32_t HCLE17;
        __IO uint32_t HCLE18;
        __IO uint32_t HCLE19;
        __IO uint32_t HCLE20;
        __IO uint32_t HCLE21;
        __IO uint32_t HCLE22;
        __IO uint32_t HCLE23;
        uint32_t RESERVED2[2];
        __IO uint32_t HCLE26;
        __IO uint32_t HCLE27;
        uint32_t RESERVED3[4];
    } stc_tmr6_hclrr_bit_t;

    typedef struct
    {
        __IO uint32_t HUPD0;
        __IO uint32_t HUPD1;
        __IO uint32_t HUPD2;
        __IO uint32_t HUPD3;
        uint32_t RESERVED0[3];
        __IO uint32_t UPDS;
        __IO uint32_t HUPD8;
        __IO uint32_t HUPD9;
        __IO uint32_t HUPD10;
        __IO uint32_t HUPD11;
        __IO uint32_t HUPD12;
        __IO uint32_t HUPD13;
        uint32_t RESERVED1[2];
        __IO uint32_t HUPD16;
        __IO uint32_t HUPD17;
        __IO uint32_t HUPD18;
        __IO uint32_t HUPD19;
        __IO uint32_t HUPD20;
        __IO uint32_t HUPD21;
        __IO uint32_t HUPD22;
        __IO uint32_t HUPD23;
        uint32_t RESERVED2[2];
        __IO uint32_t HUPD26;
        __IO uint32_t HUPD27;
        uint32_t RESERVED3[4];
    } stc_tmr6_hupdr_bit_t;

    typedef struct
    {
        __IO uint32_t HCPA0;
        __IO uint32_t HCPA1;
        __IO uint32_t HCPA2;
        __IO uint32_t HCPA3;
        uint32_t RESERVED0[4];
        __IO uint32_t HCPA8;
        __IO uint32_t HCPA9;
        __IO uint32_t HCPA10;
        __IO uint32_t HCPA11;
        __IO uint32_t HCPA12;
        __IO uint32_t HCPA13;
        uint32_t RESERVED1[2];
        __IO uint32_t HCPA16;
        __IO uint32_t HCPA17;
        __IO uint32_t HCPA18;
        __IO uint32_t HCPA19;
        __IO uint32_t HCPA20;
        __IO uint32_t HCPA21;
        __IO uint32_t HCPA22;
        __IO uint32_t HCPA23;
        __IO uint32_t HCPA24;
        __IO uint32_t HCPA25;
        __IO uint32_t HCPA26;
        __IO uint32_t HCPA27;
        uint32_t RESERVED2[4];
    } stc_tmr6_hcpar_bit_t;

    typedef struct
    {
        __IO uint32_t HCPB0;
        __IO uint32_t HCPB1;
        __IO uint32_t HCPB2;
        __IO uint32_t HCPB3;
        uint32_t RESERVED0[4];
        __IO uint32_t HCPB8;
        __IO uint32_t HCPB9;
        __IO uint32_t HCPB10;
        __IO uint32_t HCPB11;
        __IO uint32_t HCPB12;
        __IO uint32_t HCPB13;
        uint32_t RESERVED1[2];
        __IO uint32_t HCPB16;
        __IO uint32_t HCPB17;
        __IO uint32_t HCPB18;
        __IO uint32_t HCPB19;
        __IO uint32_t HCPB20;
        __IO uint32_t HCPB21;
        __IO uint32_t HCPB22;
        __IO uint32_t HCPB23;
        __IO uint32_t HCPB24;
        __IO uint32_t HCPB25;
        __IO uint32_t HCPB26;
        __IO uint32_t HCPB27;
        uint32_t RESERVED2[4];
    } stc_tmr6_hcpbr_bit_t;

    typedef struct
    {
        __IO uint32_t HCUP0;
        __IO uint32_t HCUP1;
        __IO uint32_t HCUP2;
        __IO uint32_t HCUP3;
        __IO uint32_t HCUP4;
        __IO uint32_t HCUP5;
        __IO uint32_t HCUP6;
        __IO uint32_t HCUP7;
        __IO uint32_t HCUP8;
        __IO uint32_t HCUP9;
        __IO uint32_t HCUP10;
        __IO uint32_t HCUP11;
        __IO uint32_t HCUP12;
        __IO uint32_t HCUP13;
        uint32_t RESERVED0[2];
        __IO uint32_t HCUP16;
        __IO uint32_t HCUP17;
        __IO uint32_t HCUP18;
        __IO uint32_t HCUP19;
        __IO uint32_t HCUP20;
        __IO uint32_t HCUP21;
        __IO uint32_t HCUP22;
        __IO uint32_t HCUP23;
        uint32_t RESERVED1[2];
        __IO uint32_t HCUP26;
        __IO uint32_t HCUP27;
        uint32_t RESERVED2[4];
    } stc_tmr6_hcupr_bit_t;

    typedef struct
    {
        __IO uint32_t HCDO0;
        __IO uint32_t HCDO1;
        __IO uint32_t HCDO2;
        __IO uint32_t HCDO3;
        __IO uint32_t HCDO4;
        __IO uint32_t HCDO5;
        __IO uint32_t HCDO6;
        __IO uint32_t HCDO7;
        __IO uint32_t HCDO8;
        __IO uint32_t HCDO9;
        __IO uint32_t HCDO10;
        __IO uint32_t HCDO11;
        __IO uint32_t HCDO12;
        __IO uint32_t HCDO13;
        uint32_t RESERVED0[2];
        __IO uint32_t HCDO16;
        __IO uint32_t HCDO17;
        __IO uint32_t HCDO18;
        __IO uint32_t HCDO19;
        __IO uint32_t HCDO20;
        __IO uint32_t HCDO21;
        __IO uint32_t HCDO22;
        __IO uint32_t HCDO23;
        uint32_t RESERVED1[2];
        __IO uint32_t HCDO26;
        __IO uint32_t HCDO27;
        uint32_t RESERVED2[4];
    } stc_tmr6_hcdor_bit_t;

    typedef struct
    {
        __IO uint32_t NOFIENTA;
        uint32_t RESERVED0[3];
        __IO uint32_t NOFIENTB;
        uint32_t RESERVED1[3];
        __IO uint32_t NOFIENTC;
        uint32_t RESERVED2[3];
        __IO uint32_t NOFIENTD;
        uint32_t RESERVED3[19];
    } stc_tmr6_common_fcntr_bit_t;

    typedef struct
    {
        __IO uint32_t SSTA1;
        __IO uint32_t SSTA2;
        __IO uint32_t SSTA3;
        __IO uint32_t SSTA4;
        __IO uint32_t SSTA5;
        __IO uint32_t SSTA6;
        uint32_t RESERVED0[26];
    } stc_tmr6_common_sstar_bit_t;

    typedef struct
    {
        __IO uint32_t SSTP1;
        __IO uint32_t SSTP2;
        __IO uint32_t SSTP3;
        __IO uint32_t SSTP4;
        __IO uint32_t SSTP5;
        __IO uint32_t SSTP6;
        uint32_t RESERVED0[26];
    } stc_tmr6_common_sstpr_bit_t;

    typedef struct
    {
        __IO uint32_t SCLE1;
        __IO uint32_t SCLE2;
        __IO uint32_t SCLE3;
        __IO uint32_t SCLE4;
        __IO uint32_t SCLE5;
        __IO uint32_t SCLE6;
        uint32_t RESERVED0[26];
    } stc_tmr6_common_sclrr_bit_t;

    typedef struct
    {
        __IO uint32_t SUPD1;
        __IO uint32_t SUPD2;
        __IO uint32_t SUPD3;
        __IO uint32_t SUPD4;
        __IO uint32_t SUPD5;
        __IO uint32_t SUPD6;
        uint32_t RESERVED0[26];
    } stc_tmr6_common_supdr_bit_t;

    typedef struct
    {
        __IO uint32_t TRLPWMEN;
        __IO uint32_t BRAKEPOL;
        __IO uint32_t POLARITY;
        __IO uint32_t CBCEB;
        __IO uint32_t RESUMEALIGNEN;
        uint32_t RESERVED0[19];
        __IO uint32_t SFTSHUTDOWN;
        __IO uint32_t SFTOPEN;
        uint32_t RESERVED1[6];
    } stc_trlpwm_cr_bit_t;

    typedef struct
    {
        __I uint32_t BRAKE;
        uint32_t RESERVED0[31];
    } stc_trlpwm_brakesr_bit_t;

    typedef struct
    {
        __I uint32_t SHUTDOWNSEQOCCUR;
        uint32_t RESERVED0[31];
    } stc_trlpwm_isr_bit_t;

    typedef struct
    {
        __IO uint32_t SHUTDOWNSEQOCCURCLR;
        uint32_t RESERVED0[31];
    } stc_trlpwm_icr_bit_t;

    typedef struct
    {
        __IO uint32_t SHUTDOWNSEQOCCURIE;
        uint32_t RESERVED0[31];
    } stc_trlpwm_ier_bit_t;

    typedef struct
    {
        __IO uint32_t TRLPWMLEG1EN;
        __IO uint32_t OUTPUTSTAGEBYPASS;
        __IO uint32_t INPUTPOLINV;
        __IO uint32_t ANPCEN;
        uint32_t RESERVED0[28];
    } stc_trlpwm_ctlleg_bit_t;

    typedef struct
    {
        __IO uint32_t EN;
        __IO uint32_t RUN;
        uint32_t RESERVED0[2];
        __IO uint32_t RNGHMSEL;
        uint32_t RESERVED1[27];
    } stc_trng_cr_bit_t;

    typedef struct
    {
        __IO uint32_t LOAD;
        uint32_t RESERVED0[31];
    } stc_trng_mr_bit_t;

    typedef struct
    {
        __I uint32_t PE;
        __I uint32_t FE;
        uint32_t RESERVED0[1];
        __I uint32_t ORE;
        __I uint32_t BE;
        __I uint32_t RXNE;
        __I uint32_t TC;
        __I uint32_t TXE;
        __I uint32_t RTOF;
        __I uint32_t WKUP;
        __I uint32_t LBD;
        __I uint32_t TEND;
        __I uint32_t LBM;
        __I uint32_t ABRE;
        __I uint32_t ABROVR;
        __I uint32_t ABRBUSY;
        __I uint32_t MPB;
        __I uint32_t ABRF;
        uint32_t RESERVED1[14];
    } stc_usart_sr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[9];
        __IO uint32_t MPID;
        uint32_t RESERVED1[6];
    } stc_usart_tdr_bit_t;

    typedef struct
    {
        __IO uint32_t RTOE;
        __IO uint32_t RTOIE;
        __IO uint32_t RE;
        __IO uint32_t TE;
        __IO uint32_t SLME;
        __IO uint32_t RIE;
        __IO uint32_t TCIE;
        __IO uint32_t TXEIE;
        __IO uint32_t TENDIE;
        __IO uint32_t PS;
        __IO uint32_t PCE;
        __IO uint32_t ABREI;
        __IO uint32_t M;
        __IO uint32_t ABREN;
        uint32_t RESERVED0[1];
        __IO uint32_t OVER8;
        __IO uint32_t CPE;
        __IO uint32_t CFE;
        uint32_t RESERVED1[1];
        __IO uint32_t CORE;
        __IO uint32_t CRTOF;
        __IO uint32_t CBE;
        __IO uint32_t CWKUP;
        __IO uint32_t CLBD;
        __IO uint32_t MS;
        __IO uint32_t CTEND;
        __IO uint32_t CLBM;
        uint32_t RESERVED2[1];
        __IO uint32_t ML;
        __IO uint32_t FBME;
        __IO uint32_t NFE;
        __IO uint32_t SBS;
    } stc_usart_cr1_bit_t;

    typedef struct
    {
        __IO uint32_t MPE;
        __IO uint32_t WKUPIE;
        __IO uint32_t BEIE;
        __IO uint32_t BEE;
        __IO uint32_t LBDIE;
        __IO uint32_t LBDL;
        uint32_t RESERVED0[2];
        __IO uint32_t WKUPE;
        uint32_t RESERVED1[4];
        __IO uint32_t STOP;
        __IO uint32_t LINEN;
        __IO uint32_t UATSBKE;
        __IO uint32_t SBK;
        __IO uint32_t SBKM;
        uint32_t RESERVED2[1];
        __IO uint32_t LBMIE;
        uint32_t RESERVED3[2];
        __IO uint32_t REIE;
        __IO uint32_t MKERR;
        uint32_t RESERVED4[8];
    } stc_usart_cr2_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[3];
        __IO uint32_t HDSEL;
        __IO uint32_t LOOP;
        uint32_t RESERVED1[3];
        __IO uint32_t RTSE;
        __IO uint32_t CTSE;
        uint32_t RESERVED2[7];
        __IO uint32_t CABR;
        uint32_t RESERVED3[12];
        __IO uint32_t DEM;
        __IO uint32_t DEP;
    } stc_usart_cr3_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[4];
        __IO uint32_t ULBREN;
        uint32_t RESERVED1[27];
    } stc_usart_pr_bit_t;

    typedef struct
    {
        __IO uint32_t BGREN;
        uint32_t RESERVED0[31];
    } stc_vref_bgrcr_bit_t;

    typedef struct
    {
        __IO uint32_t CSEN;
        uint32_t RESERVED0[31];
    } stc_vref_cscr_bit_t;

    typedef struct
    {
        __IO uint32_t AVCCMONEN;
        __IO uint32_t VREFINTEN;
        __IO uint32_t IVREFEN;
        __IO uint32_t HIZ;
        uint32_t RESERVED0[28];
    } stc_vref_cr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[16];
        __IO uint32_t SLPOFF;
        uint32_t RESERVED1[14];
        __IO uint32_t ITS;
    } stc_wdt_cr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[16];
        __IO uint32_t UDF;
        __IO uint32_t REF;
        uint32_t RESERVED1[14];
    } stc_wdt_sr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[29];
        __I uint32_t STA1;
        __I uint32_t STA2;
        __I uint32_t STA3;
    } stc_xbar_hecr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[30];
        __I uint32_t MDSTA;
        __I uint32_t ICLSTA;
    } stc_xbar_micr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[30];
        __I uint32_t MDSTA;
        __I uint32_t ICLSTA;
    } stc_xbar_micr16_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[29];
        __I uint32_t STA1;
        __I uint32_t STA2;
        __I uint32_t STA3;
    } stc_xbar_hebcr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[31];
        __I uint32_t TESTA;
    } stc_xbar_tecr_bit_t;

    typedef struct
    {
        uint32_t RESERVED0[31];
        __I uint32_t TRLSTA;
    } stc_xbar_trlcr_bit_t;

    typedef struct
    {
        stc_adc_str_bit_t STR_b;
        uint32_t RESERVED0[8];
        stc_adc_cr0_bit_t CR0_b;
        stc_adc_cr1_bit_t CR1_b;
        stc_adc_cr2_bit_t CR2_b;
        uint32_t RESERVED1[160];
        stc_adc_trgsr_bit_t TRGSR_b;
        uint32_t RESERVED2[288];
        stc_adc_isr_bit_t ISR_b;
        stc_adc_icr_bit_t ICR_b;
        stc_adc_isclrr_bit_t ISCLRR_b;
        uint32_t RESERVED3[40];
        stc_adc_synccr_bit_t SYNCCR_b;
        uint32_t RESERVED4[656];
        stc_adc_awdcr_bit_t AWDCR_b;
        stc_adc_awdsr_bit_t AWDSR_b;
        stc_adc_awdsclrr_bit_t AWDSCLRR_b;
        uint32_t RESERVED5[736];
        stc_adc_ofr_bit_t OFR0_b;
        stc_adc_ofr_bit_t OFR1_b;
        stc_adc_ofr_bit_t OFR2_b;
        stc_adc_ofr_bit_t OFR3_b;
        stc_adc_ofr_bit_t OFR4_b;
        stc_adc_ofr_bit_t OFR5_b;
        stc_adc_ofr_bit_t OFR6_b;
        stc_adc_ofr_bit_t OFR7_b;
    } bCM_ADC_TypeDef;

    typedef struct
    {
        stc_aos_intsfttrg_bit_t INTSFTTRG_b;
        uint32_t RESERVED0[2912];
        stc_aos_pevntnfcr_bit_t PEVNTNFCR_b;
    } bCM_AOS_TypeDef;

    typedef struct
    {
        stc_cmp_mdr_bit_t MDR_b;
        stc_cmp_fir_bit_t FIR_b;
        stc_cmp_ocr_bit_t OCR_b;
        stc_cmp_omr_bit_t OMR_b;
        uint32_t RESERVED0[96];
        stc_cmp_bwsr1_bit_t BWSR1_b;
    } bCM_CMP_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[156512];
        stc_cmu_lrccr_bit_t LRCCR_b;
        uint32_t RESERVED1[600];
        stc_cmu_xtalcfgr_bit_t XTALCFGR_b;
        uint32_t RESERVED2[236424];
        stc_cmu_pllhcr_bit_t PLLHCR_b;
        uint32_t RESERVED3[56];
        stc_cmu_xtalcr_bit_t XTALCR_b;
        uint32_t RESERVED4[24];
        stc_cmu_hrccr_bit_t HRCCR_b;
        uint32_t RESERVED5[8];
        stc_cmu_mrccr_bit_t MRCCR_b;
        uint32_t RESERVED6[24];
        stc_cmu_oscstbsr_bit_t OSCSTBSR_b;
        stc_cmu_mcocfgr_bit_t MCO1CFGR_b;
        stc_cmu_mcocfgr_bit_t MCO2CFGR_b;
        stc_cmu_tpiuckcfgr_bit_t TPIUCKCFGR_b;
        stc_cmu_xtalstdcr_bit_t XTALSTDCR_b;
        stc_cmu_xtalstdsr_bit_t XTALSTDSR_b;
        uint32_t RESERVED7[1520];
        stc_cmu_pllhcfgr_bit_t PLLHCFGR_b;
    } bCM_CMU_TypeDef;

    typedef struct
    {
        stc_cordic_csr_bit_t CSR_b;
        uint32_t RESERVED0[64];
        stc_cordic_inten_bit_t INTEN_b;
        stc_cordic_isr_bit_t ISR_b;
        stc_cordic_icr_bit_t ICR_b;
    } bCM_CORDIC_TypeDef;

    typedef struct
    {
        stc_crc_cr_bit_t CR_b;
    } bCM_CRC_TypeDef;

    typedef struct
    {
        stc_ctc_cr1_bit_t CR1_b;
        uint32_t RESERVED0[32];
        stc_ctc_str_bit_t STR_b;
    } bCM_CTC_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[32];
        stc_dac_dacr_bit_t DACR_b;
        stc_dac_daadpcr_bit_t DAADPCR_b;
        uint32_t RESERVED1[168];
        stc_dac_daocr_bit_t DAOCR_b;
        uint32_t RESERVED2[16];
        stc_dac_dacr2_bit_t DACR2_b;
        uint32_t RESERVED3[64];
        stc_dac_rampswtrgr_bit_t RAMPSWTRGR_b;
        uint32_t RESERVED4[48];
        stc_dac_dacr3_bit_t DACR3_b;
    } bCM_DAC_TypeDef;

    typedef struct
    {
        stc_dma_en_bit_t EN_b;
        stc_dma_intstat0_bit_t INTSTAT0_b;
        stc_dma_intstat1_bit_t INTSTAT1_b;
        stc_dma_intmask0_bit_t INTMASK0_b;
        stc_dma_intmask1_bit_t INTMASK1_b;
        stc_dma_intclr0_bit_t INTCLR0_b;
        stc_dma_intclr1_bit_t INTCLR1_b;
        uint32_t RESERVED0[32];
        stc_dma_reqstat_bit_t REQSTAT_b;
        stc_dma_chstat_bit_t CHSTAT_b;
        uint32_t RESERVED1[32];
        stc_dma_rcfgctl_bit_t RCFGCTL_b;
        stc_dma_swreq_bit_t SWREQ_b;
        uint32_t RESERVED2[320];
        stc_dma_chctl_bit_t CHCTL0_b;
        uint32_t RESERVED3[480];
        stc_dma_chctl_bit_t CHCTL1_b;
        uint32_t RESERVED4[480];
        stc_dma_chctl_bit_t CHCTL2_b;
        uint32_t RESERVED5[480];
        stc_dma_chctl_bit_t CHCTL3_b;
        uint32_t RESERVED6[480];
        stc_dma_chctl_bit_t CHCTL4_b;
        uint32_t RESERVED7[480];
        stc_dma_chctl_bit_t CHCTL5_b;
        uint32_t RESERVED8[480];
        stc_dma_chctl_bit_t CHCTL6_b;
        uint32_t RESERVED9[480];
        stc_dma_chctl_bit_t CHCTL7_b;
    } bCM_DMA_TypeDef;

    typedef struct
    {
        stc_dsogi_pll_cr_bit_t CR_b;
        stc_dsogi_pll_st_bit_t ST_b;
    } bCM_DSOGI_PLL_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[160];
        stc_efm_fstp_bit_t FSTP_b;
        stc_efm_frmc_bit_t FRMC_b;
        stc_efm_fwmc_bit_t FWMC_b;
        stc_efm_fsr_bit_t FSR_b;
        stc_efm_fsclr_bit_t FSCLR_b;
        stc_efm_fite_bit_t FITE_b;
        stc_efm_fswp_bit_t FSWP_b;
        stc_efm_frmc2_bit_t FRMC2_b;
        stc_efm_frltswp_bit_t FRLTSWP_b;
        uint32_t RESERVED1[1632];
        stc_efm_mmf_remcr_bit_t MMF_REMCR0_b;
        stc_efm_mmf_remcr_bit_t MMF_REMCR1_b;
        uint32_t RESERVED2[928];
        stc_efm_wlock_bit_t WLOCK_b;
        uint32_t RESERVED3[96];
        stc_efm_f0nwprt_bit_t F0NWPRT_b;
        uint32_t RESERVED4[96];
        stc_efm_f1nwprt_bit_t F1NWPRT_b;
        uint32_t RESERVED5[3424];
        stc_efm_ckcr_bit_t CKCR_b;
        stc_efm_ckpr_bit_t CKPR_b;
        stc_efm_cksr_bit_t CKSR_b;
        stc_efm_eien_bit_t EIEN_b;
        uint32_t RESERVED6[128];
        stc_efm_fecccr_bit_t F0ECCCR_b;
        uint32_t RESERVED7[32];
        stc_efm_ferr0_bit_t F0ERR0_b;
        stc_efm_ferr1_bit_t F0ERR1_b;
        uint32_t RESERVED8[384];
        stc_efm_fecccr_bit_t F1ECCCR_b;
        uint32_t RESERVED9[32];
        stc_efm_ferr0_bit_t F1ERR0_b;
        stc_efm_ferr1_bit_t F1ERR1_b;
    } bCM_EFM_TypeDef;

