MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    typedef struct
    {
        stc_emb_ctl1_bit_t CTL1_b;
        stc_emb_ctl2_bit_t CTL2_b;
        stc_emb_soe_bit_t SOE_b;
        stc_emb_stat1_bit_t STAT1_b;
        stc_emb_statclr_bit_t STATCLR_b;
        stc_emb_inten_bit_t INTEN_b;
        stc_emb_rlssel_bit_t RLSSEL_b;
        stc_emb_ctl3_bit_t CTL3_b;
        stc_emb_ctl4_bit_t CTL4_b;
        uint32_t RESERVED0[32];
        stc_emb_stat2_bit_t STAT2_b;
        uint32_t RESERVED1[32];
        stc_emb_stat3_bit_t STAT3_b;
        stc_emb_ctl5_bit_t CTL5_b;
        stc_emb_ctl6_bit_t CTL6_b;
    } bCM_EMB_TypeDef;

    typedef struct
    {
        stc_ermu_eoc_bit_t EO0C_b;
        stc_ermu_eos_bit_t EO0S_b;
        uint32_t RESERVED0[64];
        stc_ermu_eottc_bit_t EO0TTC_b;
        uint32_t RESERVED1[864];
        stc_ermu_eoc_bit_t EO1C_b;
        stc_ermu_eos_bit_t EO1S_b;
        uint32_t RESERVED2[64];
        stc_ermu_eottc_bit_t EO1TTC_b;
        uint32_t RESERVED3[864];
        stc_ermu_eoc_bit_t EO2C_b;
        stc_ermu_eos_bit_t EO2S_b;
        uint32_t RESERVED4[64];
        stc_ermu_eottc_bit_t EO2TTC_b;
        uint32_t RESERVED5[864];
        stc_ermu_eoc_bit_t EO3C_b;
        stc_ermu_eos_bit_t EO3S_b;
        uint32_t RESERVED6[64];
        stc_ermu_eottc_bit_t EO3TTC_b;
        uint32_t RESERVED7[864];
        stc_ermu_wtc_bit_t WT0C_b;
        stc_ermu_wts_bit_t WT0S_b;
        uint32_t RESERVED8[64];
        stc_ermu_wtse_bit_t WT0SE_b;
        uint32_t RESERVED9[96];
        stc_ermu_wtc_bit_t WT1C_b;
        stc_ermu_wts_bit_t WT1S_b;
        uint32_t RESERVED10[64];
        stc_ermu_wtse_bit_t WT1SE_b;
        uint32_t RESERVED11[96];
        stc_ermu_wtc_bit_t WT2C_b;
        stc_ermu_wts_bit_t WT2S_b;
        uint32_t RESERVED12[64];
        stc_ermu_wtse_bit_t WT2SE_b;
        uint32_t RESERVED13[96];
        stc_ermu_wtc_bit_t WT3C_b;
        stc_ermu_wts_bit_t WT3S_b;
        uint32_t RESERVED14[64];
        stc_ermu_wtse_bit_t WT3SE_b;
        uint32_t RESERVED15[7264];
        stc_ermu_ccps_bit_t CCPS_b;
    } bCM_ERMU_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[160];
        stc_fcm_rccr_bit_t RCCR_b;
        stc_fcm_rier_bit_t RIER_b;
        uint32_t RESERVED1[32];
        stc_fcm_clr_bit_t CLR_b;
    } bCM_FCM_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[96];
        stc_fcm_com_str_bit_t STR_b;
        uint32_t RESERVED1[96];
        stc_fcm_com_sr_bit_t SR_b;
    } bCM_FCM_COM_TypeDef;

    typedef struct
    {
        stc_fmac_fir_cr_bit_t FIR_CR_b;
        uint32_t RESERVED0[128];
        stc_fmac_fir_int_cr_bit_t FIR_INT_CR_b;
        stc_fmac_fir_sta_bit_t FIR_STA_b;
        uint32_t RESERVED1[544];
        stc_fmac_iir_cr1_bit_t IIR_CR1_b;
        stc_fmac_iir_cr2_bit_t IIR_CR2_b;
        stc_fmac_iir_int_cr_bit_t IIR_INT_CR_b;
        stc_fmac_iir_sta1_bit_t IIR_STA1_b;
        stc_fmac_iir_sta2_bit_t IIR_STA2_b;
        stc_fmac_iir_buf_sta_bit_t IIR_BUF_STA_b;
    } bCM_FMAC_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[32];
        stc_fmac_ecc_ram0_cksr_bit_t RAM0_CKSR_b;
        stc_fmac_ecc_ram0_eien_bit_t RAM0_EIEN_b;
        uint32_t RESERVED1[192];
        stc_fmac_ecc_ram1_cksr_bit_t RAM1_CKSR_b;
        stc_fmac_ecc_ram1_eien_bit_t RAM1_EIEN_b;
    } bCM_FMAC_ECC_TypeDef;

    typedef struct
    {
        stc_gpio_pidr_bit_t PIDRA_b;
        uint32_t RESERVED0[16];
        stc_gpio_podr_bit_t PODRA_b;
        stc_gpio_poer_bit_t POERA_b;
        stc_gpio_posr_bit_t POSRA_b;
        stc_gpio_porr_bit_t PORRA_b;
        stc_gpio_potr_bit_t POTRA_b;
        uint32_t RESERVED1[16];
        stc_gpio_pidr_bit_t PIDRB_b;
        uint32_t RESERVED2[16];
        stc_gpio_podr_bit_t PODRB_b;
        stc_gpio_poer_bit_t POERB_b;
        stc_gpio_posr_bit_t POSRB_b;
        stc_gpio_porr_bit_t PORRB_b;
        stc_gpio_potr_bit_t POTRB_b;
        uint32_t RESERVED3[16];
        stc_gpio_pidr_bit_t PIDRC_b;
        uint32_t RESERVED4[16];
        stc_gpio_podr_bit_t PODRC_b;
        stc_gpio_poer_bit_t POERC_b;
        stc_gpio_posr_bit_t POSRC_b;
        stc_gpio_porr_bit_t PORRC_b;
        stc_gpio_potr_bit_t POTRC_b;
        uint32_t RESERVED5[16];
        stc_gpio_pidr_bit_t PIDRD_b;
        uint32_t RESERVED6[16];
        stc_gpio_podr_bit_t PODRD_b;
        stc_gpio_poer_bit_t POERD_b;
        stc_gpio_posr_bit_t POSRD_b;
        stc_gpio_porr_bit_t PORRD_b;
        stc_gpio_potr_bit_t POTRD_b;
        uint32_t RESERVED7[16];
        stc_gpio_pidr_bit_t PIDRE_b;
        uint32_t RESERVED8[16];
        stc_gpio_podr_bit_t PODRE_b;
        stc_gpio_poer_bit_t POERE_b;
        stc_gpio_posr_bit_t POSRE_b;
        stc_gpio_porr_bit_t PORRE_b;
        stc_gpio_potr_bit_t POTRE_b;
        uint32_t RESERVED9[16];
        stc_gpio_pidr_bit_t PIDRF_b;
        uint32_t RESERVED10[16];
        stc_gpio_podr_bit_t PODRF_b;
        stc_gpio_poer_bit_t POERF_b;
        stc_gpio_posr_bit_t POSRF_b;
        stc_gpio_porr_bit_t PORRF_b;
        stc_gpio_potr_bit_t POTRF_b;
        uint32_t RESERVED11[16];
        stc_gpio_pidr_bit_t PIDRG_b;
        uint32_t RESERVED12[16];
        stc_gpio_podr_bit_t PODRG_b;
        stc_gpio_poer_bit_t POERG_b;
        stc_gpio_posr_bit_t POSRG_b;
        stc_gpio_porr_bit_t PORRG_b;
        stc_gpio_potr_bit_t POTRG_b;
        uint32_t RESERVED13[7280];
        stc_gpio_pwpr_bit_t PWPR_b;
        uint32_t RESERVED14[16];
        stc_gpio_pcr_bit_t PCRA0_b;
        stc_gpio_pfsr_bit_t PFSRA0_b;
        stc_gpio_pcr_bit_t PCRA1_b;
        stc_gpio_pfsr_bit_t PFSRA1_b;
        stc_gpio_pcr_bit_t PCRA2_b;
        stc_gpio_pfsr_bit_t PFSRA2_b;
        stc_gpio_pcr_bit_t PCRA3_b;
        stc_gpio_pfsr_bit_t PFSRA3_b;
        stc_gpio_pcr_bit_t PCRA4_b;
        stc_gpio_pfsr_bit_t PFSRA4_b;
        stc_gpio_pcr_bit_t PCRA5_b;
        stc_gpio_pfsr_bit_t PFSRA5_b;
        stc_gpio_pcr_bit_t PCRA6_b;
        stc_gpio_pfsr_bit_t PFSRA6_b;
        stc_gpio_pcr_bit_t PCRA7_b;
        stc_gpio_pfsr_bit_t PFSRA7_b;
        stc_gpio_pcr_bit_t PCRA8_b;
        stc_gpio_pfsr_bit_t PFSRA8_b;
        stc_gpio_pcr_bit_t PCRA9_b;
        stc_gpio_pfsr_bit_t PFSRA9_b;
        stc_gpio_pcr_bit_t PCRA10_b;
        stc_gpio_pfsr_bit_t PFSRA10_b;
        stc_gpio_pcr_bit_t PCRA11_b;
        stc_gpio_pfsr_bit_t PFSRA11_b;
        stc_gpio_pcr_bit_t PCRA12_b;
        stc_gpio_pfsr_bit_t PFSRA12_b;
        stc_gpio_pcr_bit_t PCRA13_b;
        stc_gpio_pfsr_bit_t PFSRA13_b;
        stc_gpio_pcr_bit_t PCRA14_b;
        stc_gpio_pfsr_bit_t PFSRA14_b;
        stc_gpio_pcr_bit_t PCRA15_b;
        stc_gpio_pfsr_bit_t PFSRA15_b;
        stc_gpio_pcr_bit_t PCRB0_b;
        stc_gpio_pfsr_bit_t PFSRB0_b;
        stc_gpio_pcr_bit_t PCRB1_b;
        stc_gpio_pfsr_bit_t PFSRB1_b;
        stc_gpio_pcr_bit_t PCRB2_b;
        stc_gpio_pfsr_bit_t PFSRB2_b;
        stc_gpio_pcr_bit_t PCRB3_b;
        stc_gpio_pfsr_bit_t PFSRB3_b;
        stc_gpio_pcr_bit_t PCRB4_b;
        stc_gpio_pfsr_bit_t PFSRB4_b;
        stc_gpio_pcr_bit_t PCRB5_b;
        stc_gpio_pfsr_bit_t PFSRB5_b;
        stc_gpio_pcr_bit_t PCRB6_b;
        stc_gpio_pfsr_bit_t PFSRB6_b;
        stc_gpio_pcr_bit_t PCRB7_b;
        stc_gpio_pfsr_bit_t PFSRB7_b;
        stc_gpio_pcr_bit_t PCRB8_b;
        stc_gpio_pfsr_bit_t PFSRB8_b;
        stc_gpio_pcr_bit_t PCRB9_b;
        stc_gpio_pfsr_bit_t PFSRB9_b;
        stc_gpio_pcr_bit_t PCRB10_b;
        stc_gpio_pfsr_bit_t PFSRB10_b;
        stc_gpio_pcr_bit_t PCRB11_b;
        stc_gpio_pfsr_bit_t PFSRB11_b;
        stc_gpio_pcr_bit_t PCRB12_b;
        stc_gpio_pfsr_bit_t PFSRB12_b;
        stc_gpio_pcr_bit_t PCRB13_b;
        stc_gpio_pfsr_bit_t PFSRB13_b;
        stc_gpio_pcr_bit_t PCRB14_b;
        stc_gpio_pfsr_bit_t PFSRB14_b;
        stc_gpio_pcr_bit_t PCRB15_b;
        stc_gpio_pfsr_bit_t PFSRB15_b;
        stc_gpio_pcr_bit_t PCRC0_b;
        stc_gpio_pfsr_bit_t PFSRC0_b;
        stc_gpio_pcr_bit_t PCRC1_b;
        stc_gpio_pfsr_bit_t PFSRC1_b;
        stc_gpio_pcr_bit_t PCRC2_b;
        stc_gpio_pfsr_bit_t PFSRC2_b;
        stc_gpio_pcr_bit_t PCRC3_b;
        stc_gpio_pfsr_bit_t PFSRC3_b;
        stc_gpio_pcr_bit_t PCRC4_b;
        stc_gpio_pfsr_bit_t PFSRC4_b;
        stc_gpio_pcr_bit_t PCRC5_b;
        stc_gpio_pfsr_bit_t PFSRC5_b;
        stc_gpio_pcr_bit_t PCRC6_b;
        stc_gpio_pfsr_bit_t PFSRC6_b;
        stc_gpio_pcr_bit_t PCRC7_b;
        stc_gpio_pfsr_bit_t PFSRC7_b;
        stc_gpio_pcr_bit_t PCRC8_b;
        stc_gpio_pfsr_bit_t PFSRC8_b;
        stc_gpio_pcr_bit_t PCRC9_b;
        stc_gpio_pfsr_bit_t PFSRC9_b;
        stc_gpio_pcr_bit_t PCRC10_b;
        stc_gpio_pfsr_bit_t PFSRC10_b;
        stc_gpio_pcr_bit_t PCRC11_b;
        stc_gpio_pfsr_bit_t PFSRC11_b;
        stc_gpio_pcr_bit_t PCRC12_b;
        stc_gpio_pfsr_bit_t PFSRC12_b;
        stc_gpio_pcr_bit_t PCRC13_b;
        stc_gpio_pfsr_bit_t PFSRC13_b;
        stc_gpio_pcr_bit_t PCRC14_b;
        stc_gpio_pfsr_bit_t PFSRC14_b;
        stc_gpio_pcr_bit_t PCRC15_b;
        stc_gpio_pfsr_bit_t PFSRC15_b;
        stc_gpio_pcr_bit_t PCRD0_b;
        stc_gpio_pfsr_bit_t PFSRD0_b;
        stc_gpio_pcr_bit_t PCRD1_b;
        stc_gpio_pfsr_bit_t PFSRD1_b;
        stc_gpio_pcr_bit_t PCRD2_b;
        stc_gpio_pfsr_bit_t PFSRD2_b;
        stc_gpio_pcr_bit_t PCRD3_b;
        stc_gpio_pfsr_bit_t PFSRD3_b;
        stc_gpio_pcr_bit_t PCRD4_b;
        stc_gpio_pfsr_bit_t PFSRD4_b;
        stc_gpio_pcr_bit_t PCRD5_b;
        stc_gpio_pfsr_bit_t PFSRD5_b;
        stc_gpio_pcr_bit_t PCRD6_b;
        stc_gpio_pfsr_bit_t PFSRD6_b;
        stc_gpio_pcr_bit_t PCRD7_b;
        stc_gpio_pfsr_bit_t PFSRD7_b;
        stc_gpio_pcr_bit_t PCRD8_b;
        stc_gpio_pfsr_bit_t PFSRD8_b;
        stc_gpio_pcr_bit_t PCRD9_b;
        stc_gpio_pfsr_bit_t PFSRD9_b;
        stc_gpio_pcr_bit_t PCRD10_b;
        stc_gpio_pfsr_bit_t PFSRD10_b;
        stc_gpio_pcr_bit_t PCRD11_b;
        stc_gpio_pfsr_bit_t PFSRD11_b;
        stc_gpio_pcr_bit_t PCRD12_b;
        stc_gpio_pfsr_bit_t PFSRD12_b;
        stc_gpio_pcr_bit_t PCRD13_b;
        stc_gpio_pfsr_bit_t PFSRD13_b;
        stc_gpio_pcr_bit_t PCRD14_b;
        stc_gpio_pfsr_bit_t PFSRD14_b;
        stc_gpio_pcr_bit_t PCRD15_b;
        stc_gpio_pfsr_bit_t PFSRD15_b;
        stc_gpio_pcr_bit_t PCRE0_b;
        stc_gpio_pfsr_bit_t PFSRE0_b;
        stc_gpio_pcr_bit_t PCRE1_b;
        stc_gpio_pfsr_bit_t PFSRE1_b;
        stc_gpio_pcr_bit_t PCRE2_b;
        stc_gpio_pfsr_bit_t PFSRE2_b;
        stc_gpio_pcr_bit_t PCRE3_b;
        stc_gpio_pfsr_bit_t PFSRE3_b;
        stc_gpio_pcr_bit_t PCRE4_b;
        stc_gpio_pfsr_bit_t PFSRE4_b;
        stc_gpio_pcr_bit_t PCRE5_b;
        stc_gpio_pfsr_bit_t PFSRE5_b;
        stc_gpio_pcr_bit_t PCRE6_b;
        stc_gpio_pfsr_bit_t PFSRE6_b;
        stc_gpio_pcr_bit_t PCRE7_b;
        stc_gpio_pfsr_bit_t PFSRE7_b;
        stc_gpio_pcr_bit_t PCRE8_b;
        stc_gpio_pfsr_bit_t PFSRE8_b;
        stc_gpio_pcr_bit_t PCRE9_b;
        stc_gpio_pfsr_bit_t PFSRE9_b;
        stc_gpio_pcr_bit_t PCRE10_b;
        stc_gpio_pfsr_bit_t PFSRE10_b;
        stc_gpio_pcr_bit_t PCRE11_b;
        stc_gpio_pfsr_bit_t PFSRE11_b;
        stc_gpio_pcr_bit_t PCRE12_b;
        stc_gpio_pfsr_bit_t PFSRE12_b;
        stc_gpio_pcr_bit_t PCRE13_b;
        stc_gpio_pfsr_bit_t PFSRE13_b;
        stc_gpio_pcr_bit_t PCRE14_b;
        stc_gpio_pfsr_bit_t PFSRE14_b;
        stc_gpio_pcr_bit_t PCRE15_b;
        stc_gpio_pfsr_bit_t PFSRE15_b;
        stc_gpio_pcr_bit_t PCRF0_b;
        stc_gpio_pfsr_bit_t PFSRF0_b;
        stc_gpio_pcr_bit_t PCRF1_b;
        stc_gpio_pfsr_bit_t PFSRF1_b;
        stc_gpio_pcr_bit_t PCRF2_b;
        stc_gpio_pfsr_bit_t PFSRF2_b;
        stc_gpio_pcr_bit_t PCRF3_b;
        stc_gpio_pfsr_bit_t PFSRF3_b;
        stc_gpio_pcr_bit_t PCRF4_b;
        stc_gpio_pfsr_bit_t PFSRF4_b;
        stc_gpio_pcr_bit_t PCRF5_b;
        stc_gpio_pfsr_bit_t PFSRF5_b;
        stc_gpio_pcr_bit_t PCRF6_b;
        stc_gpio_pfsr_bit_t PFSRF6_b;
        stc_gpio_pcr_bit_t PCRF7_b;
        stc_gpio_pfsr_bit_t PFSRF7_b;
        stc_gpio_pcr_bit_t PCRF8_b;
        stc_gpio_pfsr_bit_t PFSRF8_b;
        stc_gpio_pcr_bit_t PCRF9_b;
        stc_gpio_pfsr_bit_t PFSRF9_b;
        stc_gpio_pcr_bit_t PCRF10_b;
        stc_gpio_pfsr_bit_t PFSRF10_b;
        stc_gpio_pcr_bit_t PCRF11_b;
        stc_gpio_pfsr_bit_t PFSRF11_b;
        stc_gpio_pcr_bit_t PCRF12_b;
        stc_gpio_pfsr_bit_t PFSRF12_b;
        stc_gpio_pcr_bit_t PCRF13_b;
        stc_gpio_pfsr_bit_t PFSRF13_b;
        stc_gpio_pcr_bit_t PCRF14_b;
        stc_gpio_pfsr_bit_t PFSRF14_b;
        stc_gpio_pcr_bit_t PCRF15_b;
        stc_gpio_pfsr_bit_t PFSRF15_b;
        stc_gpio_pcr_bit_t PCRG0_b;
        stc_gpio_pfsr_bit_t PFSRG0_b;
        stc_gpio_pcr_bit_t PCRG1_b;
        stc_gpio_pfsr_bit_t PFSRG1_b;
        stc_gpio_pcr_bit_t PCRG2_b;
        stc_gpio_pfsr_bit_t PFSRG2_b;
        stc_gpio_pcr_bit_t PCRG3_b;
        stc_gpio_pfsr_bit_t PFSRG3_b;
        stc_gpio_pcr_bit_t PCRG4_b;
        stc_gpio_pfsr_bit_t PFSRG4_b;
        stc_gpio_pcr_bit_t PCRG5_b;
        stc_gpio_pfsr_bit_t PFSRG5_b;
        stc_gpio_pcr_bit_t PCRG6_b;
        stc_gpio_pfsr_bit_t PFSRG6_b;
        stc_gpio_pcr_bit_t PCRG7_b;
        stc_gpio_pfsr_bit_t PFSRG7_b;
        stc_gpio_pcr_bit_t PCRG8_b;
        stc_gpio_pfsr_bit_t PFSRG8_b;
        stc_gpio_pcr_bit_t PCRG9_b;
        stc_gpio_pfsr_bit_t PFSRG9_b;
        stc_gpio_pcr_bit_t PCRG10_b;
        stc_gpio_pfsr_bit_t PFSRG10_b;
    } bCM_GPIO_TypeDef;

    typedef struct
    {
        stc_hash_cr_bit_t CR_b;
    } bCM_HASH_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[1216];
        stc_hrpwm_capar_bit_t CAPAR_b;
        stc_hrpwm_capbr_bit_t CAPBR_b;
        uint32_t RESERVED1[128];
        stc_hrpwm_eefoffsetar_bit_t EEFOFFSETAR_b;
        stc_hrpwm_eefoffsetbr_bit_t EEFOFFSETBR_b;
        stc_hrpwm_eefwinar_bit_t EEFWINAR_b;
        stc_hrpwm_eefwinbr_bit_t EEFWINBR_b;
        stc_hrpwm_vperr_bit_t VPERR_b;
        uint32_t RESERVED2[32];
        stc_hrpwm_pcnar1_bit_t PCNAR1_b;
        stc_hrpwm_bpcnar1_bit_t BPCNAR1_b;
        uint32_t RESERVED3[256];
        stc_hrpwm_pcnbr1_bit_t PCNBR1_b;
        stc_hrpwm_bpcnbr1_bit_t BPCNBR1_b;
        uint32_t RESERVED4[256];
        stc_hrpwm_aoseoutselr_bit_t AOSEOUTSELR_b;
        stc_hrpwm_baoseoutselr_bit_t BAOSEOUTSELR_b;
        stc_hrpwm_iconr_bit_t ICONR_b;
        stc_hrpwm_biconr_bit_t BICONR_b;
        stc_hrpwm_dconr_bit_t DCONR_b;
        stc_hrpwm_bdconr_bit_t BDCONR_b;
        stc_hrpwm_gconr1_bit_t GCONR1_b;
        stc_hrpwm_bgconr1_bit_t BGCONR1_b;
        uint32_t RESERVED5[352];
        stc_hrpwm_gconr_bit_t GCONR_b;
        stc_hrpwm_bconr1_bit_t BCONR1_b;
        stc_hrpwm_bconr2_bit_t BCONR2_b;
        stc_hrpwm_gbcr_bit_t GBCR_b;
        stc_hrpwm_gbcfg_bit_t GBCFG_b;
        stc_hrpwm_idlecr_bit_t IDLECR_b;
        uint32_t RESERVED6[32];
        stc_hrpwm_stflr1_bit_t STFLR1_b;
        stc_hrpwm_stflr2_bit_t STFLR2_b;
        stc_hrpwm_hstar1_bit_t HSTAR1_b;
        stc_hrpwm_hstar2_bit_t HSTAR2_b;
        stc_hrpwm_hclrr1_bit_t HCLRR1_b;
        stc_hrpwm_hclrr2_bit_t HCLRR2_b;
        stc_hrpwm_hcpar1_bit_t HCPAR1_b;
        stc_hrpwm_hcpar2_bit_t HCPAR2_b;
        stc_hrpwm_hcpbr1_bit_t HCPBR1_b;
        stc_hrpwm_hcpbr2_bit_t HCPBR2_b;
        stc_hrpwm_eefltcr1_bit_t EEFLTCR1_b;
        stc_hrpwm_eefltcr2_bit_t EEFLTCR2_b;
        stc_hrpwm_eefltcr3_bit_t EEFLTCR3_b;
        uint32_t RESERVED7[32];
        stc_hrpwm_cr_bit_t CR_b;
        stc_hrpwm_phsctl_bit_t PHSCTL_b;
        uint32_t RESERVED8[64];
        stc_hrpwm_udircfg_bit_t UDIRCFG_b;
        stc_hrpwm_ddircfg_bit_t DDIRCFG_b;
        stc_hrpwm_tripoutsel_bit_t TRIPOUTSEL_b;
        stc_hrpwm_dectl_bit_t DECTL_b;
        uint32_t RESERVED9[32];
        stc_hrpwm_deactctl_bit_t DEACTCTL_b;
        stc_hrpwm_destat_bit_t DESTAT_b;
        stc_hrpwm_defrc_bit_t DEFRC_b;
        stc_hrpwm_declr_bit_t DECLR_b;
        uint32_t RESERVED10[32];
        stc_hrpwm_demonctl_bit_t DEMONCTL_b;
        uint32_t RESERVED11[64];
        stc_hrpwm_mindbcfg_bit_t MINDBCFG_b;
        uint32_t RESERVED12[32];
        stc_hrpwm_lutctla_bit_t LUTCTLA_b;
        stc_hrpwm_lutctlb_bit_t LUTCTLB_b;
    } bCM_HRPWM_TypeDef;

    typedef struct
    {
        stc_hrpwm_common_calcr_bit_t CALCR_b;
        uint32_t RESERVED0[896];
        stc_hrpwm_common_glaosselr6_bit_t GLAOSSELR6_b;
        stc_hrpwm_common_glaosselr5_bit_t GLAOSSELR5_b;
        stc_hrpwm_common_glaosselr4_bit_t GLAOSSELR4_b;
        stc_hrpwm_common_glaosselr3_bit_t GLAOSSELR3_b;
        stc_hrpwm_common_glaosselr2_bit_t GLAOSSELR2_b;
        stc_hrpwm_common_glaosselr1_bit_t GLAOSSELR1_b;
        uint32_t RESERVED1[128];
        stc_hrpwm_common_sftsrr_bit_t SFTSRR_b;
        stc_hrpwm_common_scapr_bit_t SCAPR_b;
        stc_hrpwm_common_sstaidlr_bit_t SSTAIDLR_b;
        stc_hrpwm_common_sstarunr1_bit_t SSTARUNR1_b;
        stc_hrpwm_common_sstarunr2_bit_t SSTARUNR2_b;
        stc_hrpwm_common_sstadidlr_bit_t SSTADIDLR_b;
        stc_hrpwm_common_gctlr_bit_t GCTLR_b;
        stc_hrpwm_common_gbconr_bit_t GBCONR_b;
        stc_hrpwm_common_gbsflr_bit_t GBSFLR_b;
        stc_hrpwm_common_bmcr_bit_t BMCR_b;
        stc_hrpwm_common_bmstrg1_bit_t BMSTRG1_b;
        stc_hrpwm_common_bmstrg2_bit_t BMSTRG2_b;
        uint32_t RESERVED2[128];
        stc_hrpwm_common_eecr1_bit_t EECR1_b;
        stc_hrpwm_common_eecr2_bit_t EECR2_b;
        uint32_t RESERVED3[32];
        stc_hrpwm_common_synocr_bit_t SYNOCR_b;
        stc_hrpwm_common_fcntr_bit_t FCNTR_b;
        stc_hrpwm_common_sstar_bit_t SSTAR_b;
        stc_hrpwm_common_sstpr_bit_t SSTPR_b;
        stc_hrpwm_common_sclrr_bit_t SCLRR_b;
        stc_hrpwm_common_supdr_bit_t SUPDR_b;
        stc_hrpwm_common_bdupr1_bit_t BDUPR11_b;
        stc_hrpwm_common_bdupr2_bit_t BDUPR12_b;
        stc_hrpwm_common_bdupr1_bit_t BDUPR21_b;
        stc_hrpwm_common_bdupr2_bit_t BDUPR22_b;
        stc_hrpwm_common_bdupr1_bit_t BDUPR31_b;
        stc_hrpwm_common_bdupr2_bit_t BDUPR32_b;
        stc_hrpwm_common_bdupr1_bit_t BDUPR41_b;
        stc_hrpwm_common_bdupr2_bit_t BDUPR42_b;
        stc_hrpwm_common_bdupr1_bit_t BDUPR51_b;
        stc_hrpwm_common_bdupr2_bit_t BDUPR52_b;
        stc_hrpwm_common_bdupr1_bit_t BDUPR61_b;
        stc_hrpwm_common_bdupr2_bit_t BDUPR62_b;
        stc_hrpwm_common_bdupr1_bit_t BDUPR71_b;
        stc_hrpwm_common_bdupr2_bit_t BDUPR72_b;
        stc_hrpwm_common_bdupr1_bit_t BDUPR81_b;
        stc_hrpwm_common_bdupr2_bit_t BDUPR82_b;
    } bCM_HRPWM_COMMON_TypeDef;

    typedef struct
    {
        stc_hrpwm_emb_ctl1_bit_t CTL1_b;
        stc_hrpwm_emb_ctl2_bit_t CTL2_b;
        stc_hrpwm_emb_soe_bit_t SOE_b;
        stc_hrpwm_emb_stat_bit_t STAT_b;
        stc_hrpwm_emb_statclr_bit_t STATCLR_b;
        stc_hrpwm_emb_inten_bit_t INTEN_b;
        stc_hrpwm_emb_rlssel_bit_t RLSSEL_b;
        stc_hrpwm_emb_ctl3_bit_t CTL3_b;
        stc_hrpwm_emb_ctl4_bit_t CTL4_b;
        stc_hrpwm_emb_ctl5_bit_t CTL5_b;
    } bCM_HRPWM_EMB_TypeDef;

    typedef struct
    {
        stc_i2c_cr1_bit_t CR1_b;
        stc_i2c_cr2_bit_t CR2_b;
        stc_i2c_cr3_bit_t CR3_b;
        stc_i2c_cr4_bit_t CR4_b;
        stc_i2c_slr0_bit_t SLR0_b;
        stc_i2c_slr1_bit_t SLR1_b;
        uint32_t RESERVED0[32];
        stc_i2c_sr_bit_t SR_b;
        stc_i2c_clr_bit_t CLR_b;
        uint32_t RESERVED1[64];
        stc_i2c_ccr_bit_t CCR_b;
        stc_i2c_fltr_bit_t FLTR_b;
        stc_i2c_fstr_bit_t FSTR_b;
        uint32_t RESERVED2[40];
        stc_i2c_peccr_bit_t PECCR_b;
        uint32_t RESERVED3[16];
        stc_i2c_slr2_bit_t SLR2_b;
        uint32_t RESERVED4[8];
        stc_i2c_nbcr_bit_t NBCR_b;
    } bCM_I2C_TypeDef;

    typedef struct
    {
        stc_icg_icg0_bit_t ICG0_b;
        stc_icg_icg1_bit_t ICG1_b;
        uint32_t RESERVED0[704];
        stc_icg_icg8_bit_t ICG8A_b;
        stc_icg_icg8_bit_t ICG8B_b;
        stc_icg_icg8_bit_t ICG8C_b;
    } bCM_ICG_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[32];
        stc_intc_nmier_bit_t NMIER_b;
        stc_intc_nmifr_bit_t NMIFR_b;
        stc_intc_nmifcr_bit_t NMIFCR_b;
        stc_intc_eirqcr_bit_t EIRQCR0_b;
        stc_intc_eirqcr_bit_t EIRQCR1_b;
        stc_intc_eirqcr_bit_t EIRQCR2_b;
        stc_intc_eirqcr_bit_t EIRQCR3_b;
        stc_intc_eirqcr_bit_t EIRQCR4_b;
        stc_intc_eirqcr_bit_t EIRQCR5_b;
        stc_intc_eirqcr_bit_t EIRQCR6_b;
        stc_intc_eirqcr_bit_t EIRQCR7_b;
        stc_intc_eirqcr_bit_t EIRQCR8_b;
        stc_intc_eirqcr_bit_t EIRQCR9_b;
        stc_intc_eirqcr_bit_t EIRQCR10_b;
        stc_intc_eirqcr_bit_t EIRQCR11_b;
        stc_intc_eirqcr_bit_t EIRQCR12_b;
        stc_intc_eirqcr_bit_t EIRQCR13_b;
        stc_intc_eirqcr_bit_t EIRQCR14_b;
        stc_intc_eirqcr_bit_t EIRQCR15_b;
        stc_intc_wken_bit_t WKEN_b;
        stc_intc_eifr_bit_t EIFR_b;
        stc_intc_eifcr_bit_t EIFCR_b;
        uint32_t RESERVED1[4704];
        stc_intc_fpuier_bit_t FPUIER_b;
    } bCM_INTC_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[96];
        stc_mcan_dbtp_bit_t DBTP_b;
        stc_mcan_test_bit_t TEST_b;
        uint32_t RESERVED1[32];
        stc_mcan_cccr_bit_t CCCR_b;
        uint32_t RESERVED2[96];
        stc_mcan_tocc_bit_t TOCC_b;
        uint32_t RESERVED3[160];
        stc_mcan_ecr_bit_t ECR_b;
        stc_mcan_psr_bit_t PSR_b;
        uint32_t RESERVED4[64];
        stc_mcan_ir_bit_t IR_b;
        stc_mcan_ie_bit_t IE_b;
        stc_mcan_ils_bit_t ILS_b;
        stc_mcan_ile_bit_t ILE_b;
        uint32_t RESERVED5[256];
        stc_mcan_gfc_bit_t GFC_b;
        uint32_t RESERVED6[128];
        stc_mcan_hpms_bit_t HPMS_b;
        stc_mcan_ndat1_bit_t NDAT1_b;
        stc_mcan_ndat2_bit_t NDAT2_b;
        stc_mcan_rxf0c_bit_t RXF0C_b;
        stc_mcan_rxf0s_bit_t RXF0S_b;
        uint32_t RESERVED7[64];
        stc_mcan_rxf1c_bit_t RXF1C_b;
        stc_mcan_rxf1s_bit_t RXF1S_b;
        uint32_t RESERVED8[64];
        stc_mcan_txbc_bit_t TXBC_b;
        stc_mcan_txfqs_bit_t TXFQS_b;
        uint32_t RESERVED9[32];
        stc_mcan_txbrp_bit_t TXBRP_b;
        stc_mcan_txbar_bit_t TXBAR_b;
        stc_mcan_txbcr_bit_t TXBCR_b;
        stc_mcan_txbto_bit_t TXBTO_b;
        stc_mcan_txbcf_bit_t TXBCF_b;
        stc_mcan_txbtie_bit_t TXBTIE_b;
        stc_mcan_txbcie_bit_t TXBCIE_b;
        uint32_t RESERVED10[96];
        stc_mcan_txefs_bit_t TXEFS_b;
    } bCM_MCAN_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[32];
        stc_mcanram_cksr_bit_t CKSR_b;
        stc_mcanram_eien_bit_t EIEN_b;
    } bCM_MCANRAM_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[512];
        stc_mpu_sr_bit_t SR_b;
        stc_mpu_eclr_bit_t ECLR_b;
        stc_mpu_wp_bit_t WP_b;
        stc_mpu_ippr_bit_t IPPR_b;
        stc_mpu_srge_bit_t S1RGE_b;
        stc_mpu_srgwp_bit_t S1RGWP_b;
        stc_mpu_srgrp_bit_t S1RGRP_b;
        stc_mpu_scr_bit_t S1CR_b;
        stc_mpu_srge_bit_t S2RGE_b;
        stc_mpu_srgwp_bit_t S2RGWP_b;
        stc_mpu_srgrp_bit_t S2RGRP_b;
        stc_mpu_scr_bit_t S2CR_b;
    } bCM_MPU_TypeDef;

    typedef struct
    {
        stc_ots_ctl_bit_t CTL_b;
    } bCM_OTS_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[160];
        stc_peric_tmr_synenr_bit_t TMR_SYNENR_b;
        uint32_t RESERVED1[32];
        stc_peric_usart1_nfc_bit_t USART1_NFC_b;
        uint32_t RESERVED2[288];
        stc_peric_spi1_nfc_bit_t SPI1_NFC_b;
    } bCM_PERIC_TypeDef;

    typedef struct
    {
        stc_pid_cr_bit_t CR_b;
        uint32_t RESERVED0[384];
        stc_pid_sta_bit_t STA_b;
        stc_pid_cr2_bit_t CR2_b;
    } bCM_PID_TypeDef;

    typedef struct
    {
        stc_pid_cmp_cr_bit_t CR_b;
        uint32_t RESERVED0[32];
        stc_pid_cmp_csta_bit_t CSTA_b;
    } bCM_PID_CMP_TypeDef;

