MAXLII/ATOMAN/platform/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Include/hc32f558.h
    typedef struct
    {
        uint32_t RESERVED0[192];
        stc_pla_ctl_bit_t CTL0_b;
        uint32_t RESERVED1[64];
        stc_pla_ctl_bit_t CTL1_b;
        uint32_t RESERVED2[64];
        stc_pla_ctl_bit_t CTL2_b;
        uint32_t RESERVED3[64];
        stc_pla_ctl_bit_t CTL3_b;
        uint32_t RESERVED4[64];
        stc_pla_ctl_bit_t CTL4_b;
        uint32_t RESERVED5[64];
        stc_pla_ctl_bit_t CTL5_b;
        uint32_t RESERVED6[64];
        stc_pla_ctl_bit_t CTL6_b;
        uint32_t RESERVED7[64];
        stc_pla_ctl_bit_t CTL7_b;
        uint32_t RESERVED8[64];
        stc_pla_ctl_bit_t CTL8_b;
        uint32_t RESERVED9[64];
        stc_pla_ctl_bit_t CTL9_b;
        uint32_t RESERVED10[64];
        stc_pla_ctl_bit_t CTL10_b;
        uint32_t RESERVED11[64];
        stc_pla_ctl_bit_t CTL11_b;
        uint32_t RESERVED12[64];
        stc_pla_ctl_bit_t CTL12_b;
        uint32_t RESERVED13[64];
        stc_pla_ctl_bit_t CTL13_b;
        uint32_t RESERVED14[64];
        stc_pla_ctl_bit_t CTL14_b;
        uint32_t RESERVED15[64];
        stc_pla_ctl_bit_t CTL15_b;
    } bCM_PLA_TypeDef;

    typedef struct
    {
        stc_pwc_fcg0_bit_t FCG0_b;
        stc_pwc_fcg1_bit_t FCG1_b;
        stc_pwc_fcg2_bit_t FCG2_b;
        stc_pwc_fcg3_bit_t FCG3_b;
        stc_pwc_fcg0pc_bit_t FCG0PC_b;
        uint32_t RESERVED0[155616];
        stc_pwc_pwrc4_bit_t PWRC4_b;
        uint32_t RESERVED1[24];
        stc_pwc_pvdcr0_bit_t PVDCR0_b;
        uint32_t RESERVED2[24];
        stc_pwc_pvdcr1_bit_t PVDCR1_b;
        uint32_t RESERVED3[24];
        stc_pwc_pvdfcr_bit_t PVDFCR_b;
        uint32_t RESERVED4[312];
        stc_pwc_pwrc6_bit_t PWRC6_b;
        uint32_t RESERVED5[1240];
        stc_pwc_rampc0_bit_t RAMPC0_b;
        uint32_t RESERVED6[32];
        stc_pwc_pramlpc_bit_t PRAMLPC_b;
        stc_pwc_lpmcsr_bit_t LPMCSR_b;
        stc_pwc_lpmcscr_bit_t LPMCSCR_b;
        stc_pwc_pvdicr_bit_t PVDICR_b;
        uint32_t RESERVED7[24];
        stc_pwc_pvddsr_bit_t PVDDSR_b;
        uint32_t RESERVED8[235704];
        stc_pwc_stpmcr_bit_t STPMCR_b;
        uint32_t RESERVED9[8064];
        stc_pwc_fprc_bit_t FPRC_b;
    } bCM_PWC_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[1536];
        stc_rmu_frst0_bit_t FRST0_b;
        stc_rmu_frst1_bit_t FRST1_b;
        stc_rmu_frst2_bit_t FRST2_b;
        stc_rmu_frst3_bit_t FRST3_b;
        uint32_t RESERVED1[320];
        stc_rmu_prstcr0_bit_t PRSTCR0_b;
        uint32_t RESERVED2[24];
        stc_rmu_rstf0_bit_t RSTF0_b;
    } bCM_RMU_TypeDef;

    typedef struct
    {
        stc_sdfm_chcfgr1_bit_t CH0CFGR1_b;
        uint32_t RESERVED0[224];
        stc_sdfm_chcfgr1_bit_t CH1CFGR1_b;
        uint32_t RESERVED1[224];
        stc_sdfm_chcfgr1_bit_t CH2CFGR1_b;
        uint32_t RESERVED2[224];
        stc_sdfm_chcfgr1_bit_t CH3CFGR1_b;
        uint32_t RESERVED3[224];
        stc_sdfm_chcfgr1_bit_t CH4CFGR1_b;
        uint32_t RESERVED4[224];
        stc_sdfm_chcfgr1_bit_t CH5CFGR1_b;
        uint32_t RESERVED5[224];
        stc_sdfm_chcfgr1_bit_t CH6CFGR1_b;
        uint32_t RESERVED6[224];
        stc_sdfm_chcfgr1_bit_t CH7CFGR1_b;
        uint32_t RESERVED7[224];
        stc_sdfm_fltcr1_bit_t FLT0CR1_b;
        stc_sdfm_fltcr2_bit_t FLT0CR2_b;
        stc_sdfm_fltisr_bit_t FLT0ISR_b;
        stc_sdfm_flticr_bit_t FLT0ICR_b;
        uint32_t RESERVED8[96];
        stc_sdfm_fltrdatar_bit_t FLT0RDATAR_b;
        uint32_t RESERVED9[256];
        stc_sdfm_fltfifoctl_bit_t FLT0FIFOCTL_b;
        uint32_t RESERVED10[96];
        stc_sdfm_fltcparm_bit_t FLT0CPARM_b;
        uint32_t RESERVED11[352];
        stc_sdfm_fltcr1_bit_t FLT1CR1_b;
        stc_sdfm_fltcr2_bit_t FLT1CR2_b;
        stc_sdfm_fltisr_bit_t FLT1ISR_b;
        stc_sdfm_flticr_bit_t FLT1ICR_b;
        uint32_t RESERVED12[96];
        stc_sdfm_fltrdatar_bit_t FLT1RDATAR_b;
        uint32_t RESERVED13[256];
        stc_sdfm_fltfifoctl_bit_t FLT1FIFOCTL_b;
        uint32_t RESERVED14[96];
        stc_sdfm_fltcparm_bit_t FLT1CPARM_b;
        uint32_t RESERVED15[352];
        stc_sdfm_fltcr1_bit_t FLT2CR1_b;
        stc_sdfm_fltcr2_bit_t FLT2CR2_b;
        stc_sdfm_fltisr_bit_t FLT2ISR_b;
        stc_sdfm_flticr_bit_t FLT2ICR_b;
        uint32_t RESERVED16[96];
        stc_sdfm_fltrdatar_bit_t FLT2RDATAR_b;
        uint32_t RESERVED17[256];
        stc_sdfm_fltfifoctl_bit_t FLT2FIFOCTL_b;
        uint32_t RESERVED18[96];
        stc_sdfm_fltcparm_bit_t FLT2CPARM_b;
        uint32_t RESERVED19[352];
        stc_sdfm_fltcr1_bit_t FLT3CR1_b;
        stc_sdfm_fltcr2_bit_t FLT3CR2_b;
        stc_sdfm_fltisr_bit_t FLT3ISR_b;
        stc_sdfm_flticr_bit_t FLT3ICR_b;
        uint32_t RESERVED20[96];
        stc_sdfm_fltrdatar_bit_t FLT3RDATAR_b;
        uint32_t RESERVED21[256];
        stc_sdfm_fltfifoctl_bit_t FLT3FIFOCTL_b;
        uint32_t RESERVED22[96];
        stc_sdfm_fltcparm_bit_t FLT3CPARM_b;
    } bCM_SDFM_TypeDef;

    typedef struct
    {
        stc_ske_ctrl_bit_t CTRL_b;
        stc_ske_cfg_bit_t CFG_b;
        stc_ske_sr1_bit_t SR1_b;
        stc_ske_sr2_bit_t SR2_b;
        uint32_t RESERVED0[896];
        stc_ske_din_cr_bit_t DIN_CR_b;
    } bCM_SKE_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[32];
        stc_spi_cr_bit_t CR_b;
        uint32_t RESERVED1[32];
        stc_spi_cfg1_bit_t CFG1_b;
        uint32_t RESERVED2[32];
        stc_spi_sr_bit_t SR_b;
        stc_spi_cfg2_bit_t CFG2_b;
    } bCM_SPI_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[32];
        stc_sramc_wtpr_bit_t WTPR_b;
        stc_sramc_ckcr_bit_t CKCR_b;
        stc_sramc_ckpr_bit_t CKPR_b;
        stc_sramc_cksr_bit_t CKSR_b;
        stc_sramc_sram1_eien_bit_t SRAM1_EIEN_b;
        uint32_t RESERVED1[224];
        stc_sramc_sramh_eien_bit_t SRAMH_EIEN_b;
        uint32_t RESERVED2[96];
        stc_sramc_cache_eien_bit_t CACHE_EIEN_b;
    } bCM_SRAMC_TypeDef;

    typedef struct
    {
        stc_swdt_cr_bit_t CR_b;
        stc_swdt_sr_bit_t SR_b;
    } bCM_SWDT_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[128];
        stc_tmr0_bconr_bit_t BCONR_b;
        stc_tmr0_stflr_bit_t STFLR_b;
    } bCM_TMR0_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[2560];
        stc_tmr6_gconr_bit_t GCONR_b;
        stc_tmr6_iconr_bit_t ICONR_b;
        stc_tmr6_bconr_bit_t BCONR_b;
        stc_tmr6_dconr_bit_t DCONR_b;
        uint32_t RESERVED1[32];
        stc_tmr6_pcnar_bit_t PCNAR_b;
        stc_tmr6_pcnbr_bit_t PCNBR_b;
        stc_tmr6_fcngr_bit_t FCNGR_b;
        stc_tmr6_vperr_bit_t VPERR_b;
        stc_tmr6_stflr_bit_t STFLR_b;
        uint32_t RESERVED2[192];
        stc_tmr6_hstar_bit_t HSTAR_b;
        stc_tmr6_hstpr_bit_t HSTPR_b;
        stc_tmr6_hclrr_bit_t HCLRR_b;
        stc_tmr6_hupdr_bit_t HUPDR_b;
        stc_tmr6_hcpar_bit_t HCPAR_b;
        stc_tmr6_hcpbr_bit_t HCPBR_b;
        stc_tmr6_hcupr_bit_t HCUPR_b;
        stc_tmr6_hcdor_bit_t HCDOR_b;
    } bCM_TMR6_TypeDef;

    typedef struct
    {
        uint32_t RESERVED0[1888];
        stc_tmr6_common_fcntr_bit_t FCNTR_b;
        stc_tmr6_common_sstar_bit_t SSTAR_b;
        stc_tmr6_common_sstpr_bit_t SSTPR_b;
        stc_tmr6_common_sclrr_bit_t SCLRR_b;
        stc_tmr6_common_supdr_bit_t SUPDR_b;
    } bCM_TMR6_COMMON_TypeDef;

    typedef struct
    {
        stc_trlpwm_cr_bit_t CR_b;
        stc_trlpwm_brakesr_bit_t BRAKESR_b;
        stc_trlpwm_isr_bit_t ISR_b;
        stc_trlpwm_icr_bit_t ICR_b;
        stc_trlpwm_ier_bit_t IER_b;
        uint32_t RESERVED0[96];
        stc_trlpwm_ctlleg_bit_t CTLLEG0_b;
        uint32_t RESERVED1[224];
        stc_trlpwm_ctlleg_bit_t CTLLEG1_b;
        uint32_t RESERVED2[224];
        stc_trlpwm_ctlleg_bit_t CTLLEG2_b;
    } bCM_TRLPWM_TypeDef;

    typedef struct
    {
        stc_trng_cr_bit_t CR_b;
        stc_trng_mr_bit_t MR_b;
    } bCM_TRNG_TypeDef;

    typedef struct
    {
        stc_usart_sr_bit_t SR_b;
        stc_usart_tdr_bit_t TDR_b;
        uint32_t RESERVED0[48];
        stc_usart_cr1_bit_t CR1_b;
        stc_usart_cr2_bit_t CR2_b;
        stc_usart_cr3_bit_t CR3_b;
        stc_usart_pr_bit_t PR_b;
    } bCM_USART_TypeDef;

    typedef struct
    {
        stc_vref_bgrcr_bit_t BGRCR_b;
        stc_vref_cscr_bit_t CSCR_b;
        stc_vref_cr_bit_t CR_b;
    } bCM_VREF_TypeDef;

    typedef struct
    {
        stc_wdt_cr_bit_t CR_b;
        stc_wdt_sr_bit_t SR_b;
    } bCM_WDT_TypeDef;

    typedef struct
    {
        stc_xbar_hecr_bit_t HECR1_b;
        stc_xbar_hecr_bit_t HECR2_b;
        stc_xbar_hecr_bit_t HECR3_b;
        stc_xbar_hecr_bit_t HECR4_b;
        stc_xbar_hecr_bit_t HECR5_b;
        stc_xbar_hecr_bit_t HECR6_b;
        stc_xbar_hecr_bit_t HECR7_b;
        stc_xbar_hecr_bit_t HECR8_b;
        stc_xbar_hecr_bit_t HECR9_b;
        stc_xbar_hecr_bit_t HECR10_b;
        uint32_t RESERVED0[64];
        stc_xbar_micr_bit_t MICR1_b;
        stc_xbar_micr_bit_t MICR2_b;
        stc_xbar_micr_bit_t MICR3_b;
        stc_xbar_micr_bit_t MICR4_b;
        stc_xbar_micr_bit_t MICR5_b;
        stc_xbar_micr_bit_t MICR6_b;
        stc_xbar_micr_bit_t MICR7_b;
        stc_xbar_micr_bit_t MICR8_b;
        stc_xbar_micr_bit_t MICR9_b;
        stc_xbar_micr_bit_t MICR10_b;
        stc_xbar_micr_bit_t MICR11_b;
        stc_xbar_micr_bit_t MICR12_b;
        stc_xbar_micr_bit_t MICR13_b;
        stc_xbar_micr_bit_t MICR14_b;
        stc_xbar_micr_bit_t MICR15_b;
        stc_xbar_micr16_bit_t MICR16_b;
        stc_xbar_hebcr_bit_t HEBCR1_b;
        stc_xbar_hebcr_bit_t HEBCR2_b;
        stc_xbar_hebcr_bit_t HEBCR3_b;
        stc_xbar_hebcr_bit_t HEBCR4_b;
        stc_xbar_hebcr_bit_t HEBCR5_b;
        stc_xbar_hebcr_bit_t HEBCR6_b;
        stc_xbar_hebcr_bit_t HEBCR7_b;
        stc_xbar_hebcr_bit_t HEBCR8_b;
        uint32_t RESERVED1[128];
        stc_xbar_tecr_bit_t TECR1_b;
        stc_xbar_tecr_bit_t TECR2_b;
        stc_xbar_tecr_bit_t TECR3_b;
        stc_xbar_tecr_bit_t TECR4_b;
        stc_xbar_tecr_bit_t TECR5_b;
        stc_xbar_tecr_bit_t TECR6_b;
        uint32_t RESERVED2[64];
        stc_xbar_trlcr_bit_t TRLCR1_b;
        stc_xbar_trlcr_bit_t TRLCR2_b;
    } bCM_XBAR_TypeDef;

/***************************************************************************** */
/* Device Specific Peripheral bit_band declaration & memory map */
/***************************************************************************** */
#define bCM_ADC1         ((bCM_ADC_TypeDef *)0x42800000UL)
#define bCM_ADC2         ((bCM_ADC_TypeDef *)0x42808000UL)
#define bCM_ADC3         ((bCM_ADC_TypeDef *)0x42810000UL)
#define bCM_ADC4         ((bCM_ADC_TypeDef *)0x42818000UL)
#define bCM_AOS          ((bCM_AOS_TypeDef *)0x42210000UL)
#define bCM_CMP1         ((bCM_CMP_TypeDef *)0x42760000UL)
#define bCM_CMP2         ((bCM_CMP_TypeDef *)0x42762000UL)
#define bCM_CMP3         ((bCM_CMP_TypeDef *)0x42764000UL)
#define bCM_CMP4         ((bCM_CMP_TypeDef *)0x42766000UL)
#define bCM_CMP5         ((bCM_CMP_TypeDef *)0x42768000UL)
#define bCM_CMP6         ((bCM_CMP_TypeDef *)0x4276A000UL)
#define bCM_CMP7         ((bCM_CMP_TypeDef *)0x4276C000UL)
#define bCM_CMP8         ((bCM_CMP_TypeDef *)0x4276E000UL)
#define bCM_CMU          ((bCM_CMU_TypeDef *)0x42900000UL)
#define bCM_CORDIC       ((bCM_CORDIC_TypeDef *)0x42AA0000UL)
#define bCM_CRC          ((bCM_CRC_TypeDef *)0x42118000UL)
#define bCM_CTC          ((bCM_CTC_TypeDef *)0x42938000UL)
#define bCM_DAC1         ((bCM_DAC_TypeDef *)0x42820000UL)
#define bCM_DAC2         ((bCM_DAC_TypeDef *)0x42828000UL)
#define bCM_DAC3         ((bCM_DAC_TypeDef *)0x42830000UL)
#define bCM_DAC4         ((bCM_DAC_TypeDef *)0x42838000UL)
#define bCM_DMA1         ((bCM_DMA_TypeDef *)0x42A60000UL)
#define bCM_DMA2         ((bCM_DMA_TypeDef *)0x42A68000UL)
#define bCM_DSOGI_PLL    ((bCM_DSOGI_PLL_TypeDef *)0x42418000UL)
#define bCM_EFM          ((bCM_EFM_TypeDef *)0x42208000UL)
#define bCM_EMB0         ((bCM_EMB_TypeDef *)0x42710000UL)
#define bCM_EMB1         ((bCM_EMB_TypeDef *)0x42710800UL)
#define bCM_EMB2         ((bCM_EMB_TypeDef *)0x42711000UL)
#define bCM_EMB3         ((bCM_EMB_TypeDef *)0x42711800UL)
#define bCM_EMB4         ((bCM_EMB_TypeDef *)0x42712000UL)
#define bCM_EMB5         ((bCM_EMB_TypeDef *)0x42712800UL)
#define bCM_ERMU         ((bCM_ERMU_TypeDef *)0x42910000UL)
#define bCM_FCM1         ((bCM_FCM_TypeDef *)0x42908000UL)
#define bCM_FCM2         ((bCM_FCM_TypeDef *)0x42908800UL)
#define bCM_FCM3         ((bCM_FCM_TypeDef *)0x42909000UL)
#define bCM_FCM4         ((bCM_FCM_TypeDef *)0x42909800UL)
#define bCM_FCM_COM      ((bCM_FCM_COM_TypeDef *)0x42908000UL)
#define bCM_FMAC         ((bCM_FMAC_TypeDef *)0x42B00000UL)
#define bCM_FMAC_ECC     ((bCM_FMAC_ECC_TypeDef *)0x42B10000UL)
#define bCM_GPIO         ((bCM_GPIO_TypeDef *)0x42A70000UL)
#define bCM_HASH         ((bCM_HASH_TypeDef *)0x42108000UL)
#define bCM_HRPWM1       ((bCM_HRPWM_TypeDef *)0x42680000UL)
#define bCM_HRPWM2       ((bCM_HRPWM_TypeDef *)0x42688000UL)
#define bCM_HRPWM3       ((bCM_HRPWM_TypeDef *)0x42690000UL)
#define bCM_HRPWM4       ((bCM_HRPWM_TypeDef *)0x42698000UL)
#define bCM_HRPWM5       ((bCM_HRPWM_TypeDef *)0x426A0000UL)
#define bCM_HRPWM6       ((bCM_HRPWM_TypeDef *)0x426A8000UL)
#define bCM_HRPWM7       ((bCM_HRPWM_TypeDef *)0x426B0000UL)
#define bCM_HRPWM8       ((bCM_HRPWM_TypeDef *)0x426B8000UL)
#define bCM_HRPWM_COMMON ((bCM_HRPWM_COMMON_TypeDef *)0x426D0000UL)
#define bCM_HRPWM_EMB1   ((bCM_HRPWM_EMB_TypeDef *)0x426C8000UL)
#define bCM_HRPWM_EMB2   ((bCM_HRPWM_EMB_TypeDef *)0x426C8800UL)
#define bCM_HRPWM_EMB3   ((bCM_HRPWM_EMB_TypeDef *)0x426C9000UL)
#define bCM_HRPWM_EMB4   ((bCM_HRPWM_EMB_TypeDef *)0x426C9800UL)
#define bCM_HRPWM_EMB5   ((bCM_HRPWM_EMB_TypeDef *)0x426CA000UL)
#define bCM_HRPWM_EMB6   ((bCM_HRPWM_EMB_TypeDef *)0x426CA800UL)
#define bCM_HRPWM_EMB7   ((bCM_HRPWM_EMB_TypeDef *)0x426CB000UL)
#define bCM_HRPWM_EMB8   ((bCM_HRPWM_EMB_TypeDef *)0x426CB800UL)
#define bCM_I2C1         ((bCM_I2C_TypeDef *)0x429C0000UL)
#define bCM_I2C2         ((bCM_I2C_TypeDef *)0x429C8000UL)
#define bCM_I2C3         ((bCM_I2C_TypeDef *)0x429D0000UL)
#define bCM_INTC         ((bCM_INTC_TypeDef *)0x42A20000UL)
#define bCM_MCAN1        ((bCM_MCAN_TypeDef *)0x42560000UL)
#define bCM_MCAN2        ((bCM_MCAN_TypeDef *)0x42568000UL)
#define bCM_MCAN3        ((bCM_MCAN_TypeDef *)0x42570000UL)
#define bCM_MCANRAM      ((bCM_MCANRAM_TypeDef *)0x425B0000UL)
#define bCM_MPU          ((bCM_MPU_TypeDef *)0x42A00000UL)
#define bCM_OTS          ((bCM_OTS_TypeDef *)0x42950000UL)
#define bCM_PERIC        ((bCM_PERIC_TypeDef *)0x42AA8000UL)
#define bCM_PID1         ((bCM_PID_TypeDef *)0x42AE0000UL)
#define bCM_PID2         ((bCM_PID_TypeDef *)0x42AE2000UL)
#define bCM_PID_CMP      ((bCM_PID_CMP_TypeDef *)0x42AE8000UL)
#define bCM_PLA          ((bCM_PLA_TypeDef *)0x429F8000UL)
#define bCM_PWC          ((bCM_PWC_TypeDef *)0x42900000UL)
#define bCM_RMU          ((bCM_RMU_TypeDef *)0x42998000UL)
#define bCM_SDFM         ((bCM_SDFM_TypeDef *)0x42750000UL)
#define bCM_SKE          ((bCM_SKE_TypeDef *)0x421C0000UL)
#define bCM_SPI1         ((bCM_SPI_TypeDef *)0x42380000UL)
#define bCM_SPI2         ((bCM_SPI_TypeDef *)0x42388000UL)
#define bCM_SPI3         ((bCM_SPI_TypeDef *)0x42390000UL)
#define bCM_SRAMC        ((bCM_SRAMC_TypeDef *)0x42A10000UL)
#define bCM_SWDT         ((bCM_SWDT_TypeDef *)0x42928000UL)
#define bCM_TMR0_1       ((bCM_TMR0_TypeDef *)0x42480000UL)
#define bCM_TMR0_2       ((bCM_TMR0_TypeDef *)0x42488000UL)
#define bCM_TMR6_1       ((bCM_TMR6_TypeDef *)0x42300000UL)
#define bCM_TMR6_2       ((bCM_TMR6_TypeDef *)0x42308000UL)
#define bCM_TMR6_3       ((bCM_TMR6_TypeDef *)0x42310000UL)
#define bCM_TMR6_4       ((bCM_TMR6_TypeDef *)0x42318000UL)
#define bCM_TMR6_5       ((bCM_TMR6_TypeDef *)0x42320000UL)
#define bCM_TMR6_6       ((bCM_TMR6_TypeDef *)0x42328000UL)
#define bCM_TMR6_COMMON  ((bCM_TMR6_COMMON_TypeDef *)0x42306000UL)
#define bCM_TRLPWM1      ((bCM_TRLPWM_TypeDef *)0x42748000UL)
#define bCM_TRLPWM2      ((bCM_TRLPWM_TypeDef *)0x42758000UL)
#define bCM_TRNG         ((bCM_TRNG_TypeDef *)0x42840000UL)
#define bCM_USART1       ((bCM_USART_TypeDef *)0x42398000UL)
#define bCM_USART2       ((bCM_USART_TypeDef *)0x423A0000UL)
#define bCM_USART3       ((bCM_USART_TypeDef *)0x423A8000UL)
#define bCM_USART4       ((bCM_USART_TypeDef *)0x423B0000UL)
#define bCM_VREF         ((bCM_VREF_TypeDef *)0x429F0000UL)
#define bCM_WDT          ((bCM_WDT_TypeDef *)0x42920000UL)
#define bCM_XBAR         ((bCM_XBAR_TypeDef *)0x42420000UL)

#ifdef __cplusplus
}
#endif

#endif /* __HC32F558_H__ */
